[
  {
    "guid": "7d370623-c75a-4534-bfb4-632287dfc9a8",
    "title": "Can Golden State survive without Jimmy Butler + KAT causing chaos for Knicks?",
    "link": "https://sports.yahoo.com/nba/article/can-golden-state-survive-without-jimmy-butler--kat-causing-chaos-for-knicks-204731025.html",
    "description": "Tom Haberstroh and Dan Devine react to Jimmy Butler&#39;s season-ending ACL injury.",
    "content_html": "Subscribe to The Big NumberApple Podcasts | Spotify | YouTubeTom Haberstroh and Dan Devine react to Jimmy Butler's season-ending ACL injury and discuss its impact on Golden State. Is there a Kuminga or Butler trade that could possibly save the Warriors' season?Plus, they break down what’s going on with the New York Knicks as their downhill slide continues after the NBA Cup. Is the criticism of Karl-Anthony Towns fair, or should Mike Brown shoulder the blame?(1:06) The Big Number: Jimmy Butler out for the season(28:08) The Little Numbers: Warriors offense without Butler(32:44) The Little Numbers: Draymond Green's salary(36:53) The Little Numbers: Golden State's playoff odds(42:56) Is KAT what's wrong with the Knicks?JANUARY 19: Jimmy Butler III of Warriors warms up during the pregame of the NBA game 23 between Miami Heat and Golden State Warriors in San Francisco at Chase Center on January 19, 2026 in San Francisco, California, United States. (Photo by Tayfun Coskun/Anadolu via Getty Images)Tayfun Coskun🖥️ Watch this full episode on the Yahoo Sports NBA YouTube channelCheck out the rest of the Yahoo Sports podcast family at https://apple.co/3zEuTQj or at yahoosports.tv",
    "author": "Tom Haberstroh,Dan Devine",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 20:47:31 +0000",
    "ingested_at": "2026-01-21T21:21:34.138368Z"
  },
  {
    "guid": "c0b61193-a4a9-40ff-909b-abc7f63bb6aa",
    "title": "NBA midseason grades: Report cards for every East team, plus each roster&#39;s MVP so far",
    "link": "https://sports.yahoo.com/nba/article/nba-midseason-grades-report-cards-for-every-east-team-plus-each-rosters-mvp-so-far-200526447.html",
    "description": "Which East teams deserve the highest marks at the regular season’s midway point?",
    "content_html": "Every team in the Eastern Conference has played at least 41 games, which means we have reached the NBA regular season’s midway point, which means it is high time for a report card. (Our midseason awards can be found here.)The Detroit Pistons (31-10), led on offense by Cade Cunningham and owners of the East’s best defense, are running away with the No. 1 seed, holding on to a 5.5-game lead in the conference.Still, the East is as wide open as it has ever been. The second-place and surprising Boston Celtics (26-16) could return Jayson Tatum for the fourth quarter of this season. The New York Knicks (25-18) have been floundering, but we know what they are capable of when they are firing on all cylinders. Same goes for the sloooowly-getting-better Cleveland Cavaliers (24-20).[Subscribe to Yahoo Sports NBA on YouTube]Meanwhile, the Philadelphia 76ers (23-19) and Orlando Magic (23-19) are lurking, if only they could stay healthy. Then there are the Toronto Raptors (26-19), who are as plucky as anybody.We have yet to see a team in the East that has made the statement: We are prepared to battle whomever emerges from the Western Conference in the NBA Finals. Maybe Detroit is THEM. The Pistons could use one more impact player, but that is for the trade deadline to determine.Now, though, it is time to get to the grades …Atlanta Hawks • Boston Celtics • Brooklyn Nets • Charlotte Hornets • Chicago Bulls • Cleveland Cavaliers • Detroit Pistons • Indiana Pacers • Miami Heat • Milwaukee Bucks • New York Knicks • Orlando Magic • Philadelphia 76ers • Toronto Raptors • Washington Wizards(Our first-quarter grades can be found here.)(Mallory Bielecki/Yahoo Sports Illustration)Atlanta Hawks (20-25)Midseason MVP: Jalen Johnson (23-10-8 on 51/36/78)Offensive rating: 113.4 (22nd) • Defensive rating: 114.8 (16th)Best lineup: Johnson • Nickeil Alexander-Walker • Dyson Daniels • Zaccharie Risacher • Kristaps Porziņģis (+19 in 129 minutes)Against .500+ teams: 11-18 • Against losing teams: 9-7Comments: Since trading Trae Young, the Hawks are 3-4, hardly the start they anticipated upon dealing the four-time All-Star point guard. … On the whole, they have been outscored by 1.4 points per 100 meaningful possessions when Young is not on the court, per Cleaning the Glass. … Atlanta was supposed to be a darkhorse candidate to emerge from the East. Instead, it looks like it could be bound for the play-in again. … Is another big move in development?Grade: DBoston Celtics (26-16)Midseason MVP: Jaylen Brown (30-7-5 on 49/36/79)Offensive rating: 121.4 (2nd) • Defensive rating: 114.0 (14th)Best lineup: Brown • Payton Pritchard • Derrick White • Sam Hauser • Neemias Queta (+53 in 134 minutes)Against .500+ teams: 13-12 • Against losing teams: 13-4Comments: The Celtics own the East’s second-best record and its second-best net rating, all in the absence of an injured Jayson Tatum. … Tatum’s return could be sooner than later. … Jaylen Brown has played his way into the MVP conversation. … Anfernee Simons and Sam Hauser have also played well enough for the Celtics to consider a) not moving either at the deadline or b) packaging one or both of them, along with picks, for a significant upgrade. … They could use another big.Grade: ABrooklyn Nets (12-29)Midseason MVP: Michael Porter Jr. (26-7-3 on 49/40/85)Offensive rating: 112.3 (25th) • Defensive rating: 117.4 (26th)Best lineup: Porter • Egor Demin • Tre Mann • Noah Clowney • Nicolas Claxton (+18 in 306 minutes)Against .500+ teams: 5-18 • Against losing teams: 7-11Comments: The Nets may have won their trade of Cam Johnson, given how well Michael Porter Jr. has played to this point and the fact that they received an additional first-round pick in the deal. … Porter might fetch more first-round assets if he is shopped by the deadline. … The Nets needed one of their five first-round picks to pop, and none of them have, though Egor Demin has played better of late (14-3-3 on 45/45/83 shooting splits in his last 14 appearances).Grade: CCharlotte Hornets (16-27)Midseason MVP: Kon Knueppel (19-5-4 on 49/44/89)Offensive rating: 116.9 (7th) • Defensive rating: 116.7 (21st)Best lineup: Knueppel • LaMelo Ball • Brandon Miller • Miles Bridges • Moussa Diabate (+63 in 112 minutes)Against .500+ teams: 7-16 • Against losing teams: 9-11Comments: Rookie wing Kon Knueppel, it seems, was a true find at the No. 4 draft slot. … Brandon Miller should be good, too. Together they are a decent foundation. … Is LaMelo Ball a part of that same foundation? He is reportedly open to a trade away from Charlotte, and it might be in the Hornets’ best interest to deal him. … They have not won with him. … Then again, they are +11.5 points per 100 meaningful possessions when Knueppel, Miller and Ball share a court.Grade: DChicago Bulls (21-22)Midseason MVP: Josh Giddey (19-9-9 on 47/39/76)Offensive rating: 114.4 (16th) • Defensive rating: 116.8 (23rd)Best lineup: Giddey • Matas Buzelis • Kevin Huerter • Isaac Okoro • Nikola Vučević (+5 in 65 minutes)Against .500+ teams: 10-11 • Against losing teams: 11-11Comments: Shocker of all shockers: The Bulls are hovering around .500 again, bound for another play-in tournament in a watered-down Eastern Conference, no chance at winning. … Lots to like about Matas Buzelis. … You can’t help but appreciate Nikola Vučević’s efforts, too, even as he seems endlessly frustrated by Chicago’s perpetual quest for mediocrity. … What to do with Coby White, a 2026 free agent? … The Bulls are full of questions, empty of answers. Grade: DCleveland Cavaliers (24-20)Midseason MVP: Donovan Mitchell (29-5-6 on 49/38/84)Offensive rating: 116.5 (10th) • Defensive rating: 114.6 (15th)Best lineup: Mitchell • Darius Garland • De’Andre Hunter • Evan Mobley • Jarrett Allen (+29 in 51 minutes)Against .500+ teams: 10-15 • Against losing teams: 14-5Comments: That redundancy of Donovan Mitchell and Darius Garland in the backcourt and Evan Mobley and Jarrett Allen in the frontcourt? Still a problem. … Far more of a problem than it was a year ago at this time, when the Cavs were bound for a 64-win campaign. … Then again, when all four are on the court, Cleveland is still +7.2 points per 100 meaningful possessions. … Maybe they need a wing. … Maybe they just need Garland healthy. … They need something.Grade: CDetroit Pistons (31-10)Midseason MVP: Cade Cunningham (26-6-10 on 45/33/82)Offensive rating: 116.0 (11th) • Defensive rating: 108.5 (2nd)Best lineup: Cunningham • Ausar Thompson • Duncan Robinson • Tobias Harris • Jalen Duren (+57 in 276 minutes)Against .500+ teams: 14-4 • Against losing teams: 17-6Comments: The Pistons own the East’s best record and best net rating. How could we complain? … Cade Cunningham has been everything Detroit could have asked for from its No. 1 pick. … Jalen Duren should be an All-Star. … They need to upgrade the Tobias Harris position if they want to seriously compete with the West. … Lauri Markkanen would be nice, but his cost is prohibitive. … Michael Porter Jr.? Now, he would establish them as clear favorites in the East.Grade: AIndiana Pacers (10-34)Midseason MVP: Pascal Siakam (24-7-4 on 48/38/68)Offensive rating: 107.9 (30th) • Defensive rating: 116.0 (19th)Best lineup: Siakam • Andrew Nembhard • Ben Sheppard • Bennedict Mathurin • Jay Huff (+9 in 39 minutes)Against .500+ teams: 3-25 • Against losing teams: 7-9Comments: Look at what the Celtics have done without Tatum, and look at what the Pacers have done without Tyrese Haliburton. … It’s not the worst-case scenario. Indiana has quickly pivoted to becoming a tanking team, once it became clear it had no chance of seriously competing for a playoff spot. … In that sense, they are a success, falling to the bottom of the Eastern Conference standings, in line for a top-four overall pick. Could be a lot worse, actually.Grade: CMiami Heat (23-21)Midseason MVP: Norman Powell (24-4-3 on 49/42/85)Offensive rating: 113.7 (20th) • Defensive rating: 112.8 (8th)Best lineup: Powell • Tyler Herro • Davion Mitchell • Andrew Wiggins • Bam Adebayo (+27 in 94 minutes)Against .500+ teams: 10-18 • Against losing teams: 13-3Comments: The Heat installed a new, almost pick-and-roll-less offense, which was all the rage as the season began, only to settle in at 20th in the NBA on that end by midseason. … They still play at the fastest pace in the league — by a wide margin. … Norm Powell, the Clippers’ loss, is Miami’s gain. … Bam Adebayo, forever an anchor of a top-10 defense. … The Heat are 4-7 with Tyler Herro in the lineup and cannot find any sense of a rhythm as he battles a series of injuries.Grade: CMilwaukee Bucks (18-24)Midseason MVP: Giannis Antetokounmpo (29-10-6 on 65/40/65)Offensive rating: 113.0 (23rd) • Defensive rating: 116.1 (20th)Best lineup: Antetokounmpo • Ryan Rollins • Kevin Porter Jr. • AJ Green • Myles Turner (+44 in 173 minutes)Against .500+ teams: 6-18 • Against losing teams: 12-6Comments: The Bucks are performing like a top-tier team when Giannis Antetokounmpo is on the court, outscoring opponents by 6.9 points per 100 possessions. … They are operating like a bottom-dweller when he is on the bench, getting outscored by 9.5 points per 100 possessions. … Still, Antetokounmpo insists he will not ask out of Milwaukee, leaving that discussion to the team and his agents. … Might the Bucks make one more desperation move to satiate Giannis? Grade: DNew York Knicks (25-18)Midseason MVP: Jalen Brunson (28-3-6 on 48/39/85)Offensive rating: 118.9 (4th) • Defensive rating: 115.9 (18th)Best lineup: Brunson • Miles McBride • Josh Hart • Mikal Bridges • Karl-Anthony Towns (+45 in 118 minutes)Against .500+ teams: 11-13 • Against losing teams: 14-5Comments: The Knicks, who entered the season as betting favorites to win the East, are now staring up at Detroit in that regard. … They also trail the Tatum-less Celtics in the standings. … They are 2-9 with the 27th-ranked net rating (-8.4) in their last 11 games. … Newsday’s sources suggested the sharks are circling Karl-Anthony Towns, though another report shot down that idea. … It is hard to imagine the Knicks shaking up their core for anyone but Antetokounmpo.Grade: COrlando Magic (23-19)Midseason MVP: Paolo Banchero (21-9-5 on 45/27/76)Offensive rating: 114.4 (18th) • Defensive rating: 113.6 (12th)Best lineup: Banchero • Jalen Suggs • Desmond Bane • Franz Wagner • Wendell Carter Jr. (+47 in 117 minutes)Against .500+ teams: 12-12 • Against losing teams: 11-7Comments: Franz Wagner and Paolo Banchero have played 16 games together; the Magic are 8-8 in those outings. … Hard to tell what Orlando is capable of, since Jalen Suggs has also had trouble staying on the court. … Anthony Black’s progress (16-4-4 on 47/36/73 shooting splits) is a revelation. … Of the 48 players who have taken 15 or more shots per game, Banchero ranks 44th in true shooting percentage (55%). … Can Orlando get back into the top 10 on defense?Grade: CPhiladelphia 76ers (23-19)Midseason MVP: Tyrese Maxey (30-4-7 on 47/40/88)Offensive rating: 114.4 (15th) • Defensive rating: 113.2 (11th)Best lineup: Maxey • VJ Edgecombe • Paul George • Dominick Barlow • Joel Embiid (+22 in 142 minutes)Against .500+ teams: 9-14 • Against losing teams: 14-5Comments: Tyrese Maxey, what a player. … VJ Edgecombe is going to be a heck of a backcourt partner to Maxey. The 76ers are set there. … Joel Embiid since mid-December: 28-8-4 on 51/30/86 splits, and he can barely even jump. Can he stay healthy through multiple rounds of playoffs? … Paul George is also contributing as somewhat of an outsized role player. … Who wants to face these Sixers in the first round? Just imagine if they acquire another wing.Grade: BToronto Raptors (26-19)Midseason MVP: Scottie Barnes (20-8-6 on 50/32/82)Offensive rating: 114.1 (19th) • Defensive rating: 112.5 (6th)Best lineup: Barnes • Immanuel Quickley • RJ Barrett • Brandon Ingram • Jakob Poeltl (+18 in 166 minutes)Against .500+ teams: 11-12 • Against losing teams: 15-7Comments: The Raptors own the league’s sixth-rated defense, and their rim protector, Jakob Poeltl, has not played since Dec. 21 … You can see why Toronto might be interested in Anthony Davis. … You can see why they might want Ja Morant, too, since the Immanuel Quickley spot could also be upgraded. … But who wants the three years left on his deal after this season? … Collectively, though, we couldn’t ask for much more from this team, especially Brandon Ingram.Grade: AWashington Wizards (10-32)Midseason MVP: Alex Sarr (17-7-3 on 51/35/70)Offensive rating: 109.6 (28th) • Defensive rating: 120.7 (29th)Best lineup: Sarr • Bub Carrington • Tre Johnson • Kyshawn George • Khris Middleton (-5 in 41 minutes)Against .500+ teams: 2-20 • Against losing teams: 8-12Comments: Is Trae Young ever going to play for this team this season? Maybe they will nurse his quad injury for as long as it takes to pull their tank into a bottom-four spot. … The Wizards are still waiting on a star to emerge from their recent string of first-round draft picks, though Alex Sarr (17-7-3 on 51/35/70 shooting splits and a league-leading 2.2 blocks per game) is a player. … Get Tre Johnson more shots than his 10 per game. … Another high-end lottery pick loading.Grade: B",
    "author": "Ben Rohrbach",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 20:05:26 +0000",
    "ingested_at": "2026-01-21T20:21:27.479168Z"
  },
  {
    "guid": "02b7bb97-49f9-4d2e-aaf2-960f8fbbb3b0",
    "title": "Lakers center DeAndre Ayton shows off new look after leaving game due to eye poke: &#39;He looks like a pirate&#39;",
    "link": "https://sports.yahoo.com/nba/article/lakers-center-deandre-ayton-shows-off-new-look-after-leaving-game-due-to-eye-poke-he-looks-like-a-pirate-143539153.html",
    "description": "Deandre Ayton could be back in time for the Lakers&#39; next game.",
    "content_html": "Los Angeles Lakers big man Deandre Ayton is temporarily adopting a new look. After leaving Tuesday's contest due to an eye poke, Ayton posted a photo on Instagram in which he's wearing a patch over his eye.On the photo, Ayton added a pirate emoji, poking fun at his appearance.From Deandre’s IG: https://t.co/BVi0xIjnXgpic.twitter.com/fnXvfYnQon— Dave McMenamin (@mcten) January 21, 2026He was far from the only member of the Lakers to make that comparison. After the contest, Lakers head coach JJ Redick said Ayton looked \"like a pirate\" after leaving the contest just before halftime. Ayton did not play the entire third quarter due to the injury. Before the fourth quarter was over, the Lakers announced he would miss the rest of the contest. He finished with four points and eight rebounds in roughly 15 minutes during the Lakers' 115-107 win over the Denver Nuggets.While Redick said Ayton's eye was \"not in good shape\" after the game, the team doesn't expect Ayton to miss time. Redick added that the center \"will be fine\" ahead of Thursday's game against the Los Angeles Clippers. Even if Ayton needs to miss that game, it doesn't sound like the eye injury will keep him sidelined for long. After spending the last two seasons with the Portland Trail Blazers, Ayton joined the Lakers on a two-year deal in the offseason. He's put up his usual numbers through 37 games with the team, averaging 13.9 points and 8.8 rebounds.",
    "author": "Chris Cwik",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 14:35:39 +0000",
    "ingested_at": "2026-01-21T18:42:14.608838Z"
  },
  {
    "guid": "207ca0ad-31ea-47a9-b51f-21940d4d772f",
    "title": "What does losing Jimmy Butler mean for the Warriors as we know them?",
    "link": "https://sports.yahoo.com/nba/article/what-does-losing-jimmy-butler-mean-for-the-warriors-as-we-know-them-220033863.html",
    "description": "Golden State&#39;s best-laid plans have gone up in smoke. Is it finally time for a hard reset?",
    "content_html": "Adding Jimmy Butler fundamentally changed who the Warriors were last season — the way they played, the heights they could aspire to, their chances of playing meaningful basketball deep into springtime once again. Losing Butler on Monday to a torn right ACL — a devastating blow that sapped every ounce of sweetness out of Golden State’s fourth consecutive double-digit win — fundamentally changes who the Warriors are this season, and threatens a devastating alteration to who they could conceivably still be in the “fading dynasty” stage of the Stephen Curry/Draymond Green/Steve Kerr era.Let’s start with the obvious: It is extremely, extremely damaging to lose a player as good as Butler, whose teams have either outright won or been demonstrably better in his minutes in every season save the one where he was trying to force his way out of Minnesota.Even at age 36, a crisp 15 years and nearly 35,000 NBA minutes into his career, Butler remains one of the league’s best all-around players — a high-efficiency, low-mistake offensive connector; a versatile and disruptive defender; a high-IQ adaptor able to fit neatly into the flow when playing alongside Curry and scale up into a larger, more central role when Steph’s off the floor; a consistently high-floor contributor with few peers at his position.(Grant Thomas/Yahoo Sports illutration)Butler is second on the Warriors in scoring, third in assists and rebounds, and leads them in steals and total minutes played. There are four players in the NBA this season averaging at least 20 points, five rebounds, four assists and a steal per game while making at least half of their shots: Butler, perennial MVP favorite Nikola Jokić, and ascendant All-Star-caliber bigs Alperen Şengün and Jalen Johnson.The advanced stats, as ever, love him: He’s been a top-15-to-20 player this season in the eyes of estimated plus-minus, LEBRON, DARKO, value over replacement player, player efficiency rating, win shares per 48 minutes, box plus-minus and regularized adjusted plus-minus, among other metrics. The Warriors have been 9.6 points per 100 possessions better with Butler on the court than off it this season, according to Cleaning the Glass; among players who’ve logged 1,000 minutes, that’s the 10th-largest on/off swing in the NBA.Butler had averaged just under 22-5-5 on pristine .649 true shooting over the past month prior to exiting early against Miami. He was playing some of the best ball of his career, and with it, the Warriors had started to stabilize: Golden State has won four straight and 12 of its last 16, with the NBA’s second-best record and fifth-best net rating in that span.During that period, the Warriors have outscored opponents by 8.4 points per 100 possessions with Butler on the floor, compared to a plus-4.4 net rating without him. That includes a mammoth plus-12.9 net rating in the 183 minutes that Butler played without Curry, continuing the trend that began last season of Golden State finally being able to not only survive non-Steph minutes, but sometimes actually build a lead while he rested. (Imagine that.)Only one Warriors five-man lineup without Butler in it has played more than 20 minutes together this season; the quintet of Curry, Green, Gary Payton II, Brandin Podziemski and Moses Moody has been outscored by 13 points. That, um, will need to change — as will the general tenor of the non-Steph minutes, which, with Butler lost for the season, threaten to return to disaster time. The Warriors have been outscored by 3.9 points-per-100 this season with neither Curry nor Butler on the floor, posting a dismal non-garbage-time offensive rating of just 105.2 — several sub-basements below what the league-worst attack of the Tyrese Haliburton-less 10-34 Pacers has mustered over the course of this season.Combine that with the degree to which Golden State had struggled to tread water in non-Jimmy minutes even with Steph on the floor — just plus-1.1 points-per-100 over nearly 500 minutes this season — and the Warriors have a pretty gnarly puzzle to solve over the second half of the season if they hope to have any chance of remaining in postseason position.After Tuesday’s loss to the Toronto Raptors, Golden State sits at 25-20, in eighth place in the Western Conference — in line for their third straight trip to the play-in tournament. With Butler in the fold and playing at an All-Star level, Kerr, general manager Mike Dunleavy Jr. and Co. could reasonably harbor hopes of erasing the two-game gap between them and the fifth-place Houston Rockets, putting themselves in position to not only avoid the play-in but potentially challenge for home-court advantage in the opening round of the playoffs. Now, though, the Warriors braintrust has to consider whether it’s likelier that they rise or fall — they’re three games ahead of ninth-place Portland, five games up on the 10th-place Clippers, and 5.5 clear of 11th-place Memphis — and how their internal projections will inform their decision-making ahead of the Feb. 5 trade deadline.Five days past the NBA’s most closely watched trade eligibility date, Jonathan Kuminga remains a member of the Warriors. Twenty-four hours ago, it seemed likely that Dunleavy would keep beating the bushes in search of a deal that could turn the out-of-favor 23-year-old into something, anything, that could improve the Warriors’ chances of making a deep playoff run. But with Golden State now in desperate need of a wing-sized person capable of putting the ball in the basket, even if it’s not in precisely the way Kerr prefers, and with the most frequently stated reason for shelving Kuminga — effectively, we can’t play three not-really-shooters who need the ball in their hands, and Jimmy and Draymond are better than Kuminga is — now a moot point, does that calculus change?If and when Kerr turns back to Kuminga — which he did at least on Tuesday — how might the fifth-year forward respond? It seems like an awful lot, asking someone who has essentially been out of the rotation for two months to suddenly start replicating the production of a top-20 player — especially considering lineups where he’s had to carry the offensive workload without Steph or Jimmy have gotten drilled over the past two seasons. If a reintroduced Kuminga struggles under these adverse conditions, does it become even more difficult to move him for a return of noteworthy value? And if he doesn’t — if he looks great — well, then what do you do with a guy you’ve signaled in every way possible that you’re ready to drive to the airport at the earliest opportunity, but who’s suddenly become a load-bearing column in your current build?The $11 billion question hanging over all of this, in the hours after Butler’s grim diagnosis: Just what is that “current build,” now?The premise behind the Butler trade and subsequent extension was clean, clear and evident to all who observed it. Golden State had lined up the contracts of Curry, Butler and Green to take aim at a title run in 2024-25 and 2025-26, with a possible third in 2026-27, when Green holds a $27.7 million player option. It was an unmistakable declaration of intent: As long as we have Steph playing LIKE THIS, we’re going to go for it.And it worked, and it looked great … until it didn’t. The first run ended in the second round, after Steph hurt his hamstring against the Timberwolves; with Butler’s season now over, the second one appears to have ended before it could even get started. And now, the Warriors find themselves back where they were this time last year: with Curry still playing like this, but without a supporting cast commensurate with the frankly unbelievable level at which he continues to produce.Maybe that gives the rest of Golden State’s roster short shrift. De’Anthony Melton is finally healthy again and playing great. Al Horford’s starting to show signs of coming around. Podziemski’s in the midst of his best run of play of the season. Moody and Buddy Hield are shooting better than 40% from 3-point land over the last month. Maybe they keep rolling, and Kerr’s able to find enough contributions from elsewhere — from rookie Will Richard, from Quinten Post, from Trayce Jackson-Davis, and on, and on — to keep the Warriors in the fight, where they’re forever one Curry flurry from delivering a knockout blow.And maybe the injury doesn’t necessarily preclude one last big comeback run. The average return-to-play following an ACL tear is about 11 months, according to Jeff Stotts of In Street Clothes; that would put Butler’s return somewhere around Christmas, meaning he’d miss roughly the first quarter of the 2026-27 season, giving Golden State a lot of runway to get up to full strength before mid-April. Maybe there are still two real bites at the apple here.Maybe, though, Butler’s injury shakes the Warriors’ faith in the viability of that timeline — in the likelihood that, 14 months from now, a core of a 39-year-old Curry, a 37-year-old Green and a 37-year-old, post-ACL-reconstruction Butler will be good enough to win in the playoffs. If Dunleavy and Co. arrive at that conclusion, they’ll have to decide whether they’re comfortable continuing to ride what they’ve got into the sunset — appreciating that time comes for us all, that best-laid plans sometimes go awry, and that it’s worth allowing the Steph-Draymond-Jimmy core to run its course — or if it’s time to make even more drastic changes to the roster, in service of seeding the ground for the next era of Warriors basketball, whenever that might start.The former path would be perfectly respectable, if not downright honorable. In a world that’s seen the Warriors try to pull off the two timelines plan and let Klay Thompson walk, though, the latter can’t be ruled out. I don’t think that means they’re going to trade Steph in the middle of the night. (Although, y’know: Luka.) I do think, though, it means that just about anything else could be on the table, one fundamental change begetting another.",
    "author": "Dan Devine",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 22:00:33 +0000",
    "ingested_at": "2026-01-21T18:32:07.726957Z"
  },
  {
    "guid": "7aebb458-e608-45b7-bc1c-b161f81d4fe7",
    "title": "Jeanie Buss reportedly felt LeBron James wasn&#39;t grateful enough after Lakers took son Bronny in NBA Draft",
    "link": "https://sports.yahoo.com/nba/article/jeanie-buss-reportedly-felt-lebron-james-wasnt-grateful-enough-after-lakers-took-son-bronny-in-nba-draft-170021056.html",
    "description": "Jeanie Buss reportedly soured on LeBron James after the Russell Westbrook trade.",
    "content_html": "The Los Angeles Lakers returned to notoriety when the team signed superstar LeBron James in free agency ahead of the 2018-19 NBA season. While that partnership turned out well initially — with James leading the team to a championship in his second season — Lakers owner Jeanie Buss reportedly began to sour on James, per ESPN's Baxter Holmes. That tidbit was revealed as part of a much larger piece on the Buss' family drama and how it led to the team being sold to Mark Walter. While there are plenty of juicy revelations in the article, Buss' relationship with James will likely draw the most attention.Buss' opinion of James reportedly started to change after the Lakers traded for Russell Westbrook in 2021. The move, which the team made to make James happy, backfired. Westbook's fit on the Lakers was awkward, and the team failed to make the playoffs after acquiring the veteran. Buss reportedly was frustrated with the way James washed his hands of the deal and blamed others after it failed, per ESPN.Buss reportedly even considered trading James at one point — with the Los Angeles Clippers being the most likely destination. That didn't happen, and James inserted a no-trade clause into his 2024 extension, making a deal impossible now unless James approves it. The relationship further soured after the Lakers drafted James' son, Bronny, in the second round of the 2024 NBA Draft. Buss reportedly felt LeBron should have been more grateful the team picked his son in the draft, per ESPN.\"And when the Lakers drafted James' son, Bronny, with the 55th pick in the 2024 draft, Jeanie privately remarked that James should be grateful for such a gesture, but she felt that he wasn't, people close to the team told ESPN.\"Bronny, 21, has been used in a reserve role in the NBA. He's averaged 1.9 points in 51 career games. If those reports are true, Buss and James could be heading for a clean break in the offseason. James' contract is up at the end of the season, allowing the 41-year-old to easily leave the team in the offseason. James has still performed well this season and has helped the Lakers to a 26-16 start. If he wants to keep playing, James could almost certainly find a job with another franchise.But it's unclear whether James will do that. The 23-year veteran has not addressed his future in the NBA past the 2025-26 season. If James does come back for one more year, it's possible he once again considers the Lakers. But if Wednesday's report is accurate, James' return to Los Angeles could be dependent on whether Buss, who remains the team's governor and minority owner, can still co-exist with the superstar.",
    "author": "Chris Cwik",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 17:00:21 +0000",
    "ingested_at": "2026-01-21T17:47:01.817184Z"
  },
  {
    "guid": "dfba9e54-13f9-4582-abed-760e0541ed82",
    "title": "Warriors GM Mike Dunleavy Jr. not planning to deal Jimmy Butler&#39;s contract, ponders Jonathan Kuminga&#39;s trade value: &#39;There needs to be demand&#39;",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/warriors-gm-mike-dunleavy-jr-not-planning-to-deal-jimmy-butlers-contract-ponders-jonathan-kumingas-trade-value-there-needs-to-be-demand-044620803.html",
    "description": "The NBA trade deadline is Feb. 5. The Warriors have a lot to figure out before then.",
    "content_html": "Jimmy Butler's ACL tear is a devastating blow for the veteran All-Star and cause for a reckoning in Golden State over its plans to compete in the back-end of Stephen Curry's prime. General manager Mike Dunleavy was on hand Tuesday night to address the Warriors' short- and long-term plans ahead of Golden State's home game against the Toronto Raptors.He was asked about Butler's future with the franchise as well as that of disgruntled forward Jonathan Kuminga, who's been languishing on the bench amid poor play and a trade demand. And ... let's just say that he has divergent thoughts on Butler's and Kuminga's value on the basketball court.Dunleavy not ready to tear things downWith Butler's injury prompting chatter of a full teardown and the end of the era of competitive basketball with Curry, Dunleavy was asked about the prospect of trading away Butler's contract, which has one year and $56.8 million remaining beyond this season. Dunleavy said that he's not entertaining the idea.  \"I don't envision that,\" Dunleavy said. \"But now that you've brought it up, I guess I'd say what I envision for him is kind of giving us a boost next year the same way he did last year when he arrived. \"And so, at some point during the season, him returning and being the player he's been.\"Mike Dunleavy said he does not envision he will trade Jimmy Butler’s contract and believes Butler will rehab and return to help the team at some point next season pic.twitter.com/FjU1xzDnb6— Anthony Slater (@anthonyVslater) January 21, 2026That sounds like a man not ready to wave the white flag on the Curry era. It also sounds like the words of an optimist. Butler will be 37 next season and coming off one of the most serious injuries in sports. Can Butler return to high-level basketball after ACL tear?Butler's been a boon for the Warriors and helped spark a run to the second round of the playoffs last season after arriving via a midseason trade. The Warriors made the playoffs as the No. 7 seed out of the play-in, then upset the No. 2 seed Rockets in the first round before falling to the Timberwolves in the second. Butler's arrival was a big reason for that success, and he was playing at an All-Star level this season (20 ppg, 5.6 rpg, 4.9 apg, 1.4 spg) before tearing his right ACL Monday night. If anyone's capable of returning from an ACL tear to play at a high level at 37 years old, Butler's the type of player to do it. And for now, at least, Dunleavy appears to be holding out hope that that's how things play out.The alternative is not an appealing option and one that could mean dealing Curry while he still has trade value. They are not ready for that in Golden State. What about Kuminga?As for the short-term, Butler's minutes just opened up, and they need to be filled. That could mean the end of Kuminga's relegation to the bench. Head coach Steve Kerr opened the door to that possibility, telling reporters that Kuminga \"could be\" part of the rotation in Butler's absence. That would require a willingness on both sides to thaw an icy relationship. Dunleavy doesn't sound eager to extend an olive branch. When asked about Kuminga's trade demand, Dunleavy suggested that Kuminga might not drum up much demand for his services.\"As far as the demand, I'm aware of that. In terms of demands, when you make a demand, there needs to be demand — on the market.\"Warriors GM Mike Dunleavy Jr. with a candid quote on Jonathan Kuminga's trade demand. pic.twitter.com/7iNoKxpd2z— KNBR (@KNBR) January 21, 2026\"I think as far as the demand — I'm aware of that,\" Dunleavy said. \"I think in terms of demands, when you make a demand, there needs to be demand on the market. So, we'll see where that unfolds.The NBA trade deadline is Feb. 5. The Warriors have a lot to figure out before then.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 04:46:20 +0000",
    "ingested_at": "2026-01-21T17:47:01.817695Z"
  },
  {
    "guid": "209fe6a9-ff19-4e7c-928c-0df8b03e9ae8",
    "title": "Lamar Odom arrested on suspicion of DUI in Vegas after reportedly driving more than 100 mph",
    "link": "https://sports.yahoo.com/nba/article/lamar-odom-arrested-on-suspicion-of-dui-in-vegas-after-reportedly-driving-more-than-100-mph-234657944.html",
    "description": "Odom was arrested and charged with DUI in 2013 and has been open about his previous struggles with drug addiction.",
    "content_html": "Lamar Odom was arrested on suspicion of driving under the influence in Las Vegas over the weekend after a Nevada State Police trooper spotted the 46-year-old, two-time NBA champion driving more than 100 mph, according to KTNV 13 Action News' Tuesday report.Around 2:20 a.m. on Saturday, the trooper saw a black SUV speeding on Interstate 15, where the speed limit was posted at 65 mph. When the trooper pulled over the car, which also changed lanes without signaling, they found Odom and an unidentified male passenger, per KTNV, which reported that both had red, watery eyes and smelled of marijuana.Odom, a former 14-year NBA veteran who's been open about his previous struggles with drug addiction and depression, was arrested and charged with DUI in 2013.On Saturday, when Odom was searching for his registration and insurance, he tried to initiate conversation with the trooper, according 8 News Now, which cited documents it obtained Tuesday. He asked how the trooper's night was going besides him \"driving like he was 'in Back to the Future,'\" the report stated, via 8 News Now.Lamar Odom, flanked here by Derek Fisher and Trevor Ariza at a Los Angeles Lakers at a Christmas Day game in 2023, was arrested in Las Vegas on suspicion of DUI over the weekend. (Photo by Allen Berezovsky/Getty Images)Allen Berezovsky via Getty ImagesWhen Odom was asked why he was speeding — 8 News Now reported that his SUV was tracked going as fast as 106 mph — he reportedly changed his story multiple times, first noting that he was \"almost home\" and then later saying that he was headed to his friend's house.Odom reportedly followed a similar pattern when he was asked about the last time he consumed marijuana. At one point, he quickly changed his answer from he \"doesn't really smoke\" to saying he \"does not smoke,\" according to the report 8 News Now obtained. Eventually, Odom admitted he smoked \"maybe earlier today.\"The report showed that Odom failed the sobriety tests he was given and then was arrested, per 8 News Now. As of Tuesday, Odom was no longer in custody, per The Associated Press, which cited Clark County jail records. He was booked there on charges of DUI, driving more than 41 miles per hour over the speed limit and failing to maintain travel in a street lane/improper lane change, as reported by USA Today.He has a hearing scheduled for March 17.Odom played for four different NBA teams from 1999-2013 before drug abuse derailed the remainder of the forward's basketball career. It also ruptured his marriage to Khloé Kardashian. An overdose left him comatose for three days in a Vegas hospital when he was found unconscious in a brothel in 2015, although Odom still says he doesn't recall taking drugs that night.Odom was part of the NBA All-Rookie first team with the Los Angeles Clippers, who drafted him No. 4 overall out of Rhode Island in 1999. He became the league's Sixth Man of the Year with the Lakers in 2011 after helping the franchise win back-to-back titles in 2009-10.",
    "author": "Andy Backstrom",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 23:46:57 +0000",
    "ingested_at": "2026-01-21T16:27:25.050642Z"
  },
  {
    "guid": "ac16fe41-4e1c-449a-9675-8ed28dccd0f3",
    "title": "Warriors All-Star Jimmy Butler out for season with torn ACL, will undergo surgery",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/warriors-all-star-jimmy-butler-out-for-season-with-torn-acl-will-undergo-surgery-044425188.html",
    "description": "Butler tore his right ACL in Monday&#39;s Warriors win over the Heat.",
    "content_html": "Golden State Warriors forward Jimmy Butler suffered a torn ACL in Monday's 135-112 win over the Miami Heat. His season is over.Butler's agent, Bernie Lee, confirmed the injury Tuesday. Lee called it a \"gut punch\" and said Butler would \"attack this challenge\" hoping to come back stronger. The Warriors also confirmed the injury later Tuesday and announced that Butler would undergo surgery at a \"to-be-determined date.\"Butler, meanwhile, posted on Instagram stating he would \"be back before you know it.\" [Get more Warriors news: Golden State team team feed]The injury took place in the third quarter at the Chase Center after Butler caught a contested pass in the paint. Butler landed awkwardly on his right leg and fell to the ground after contact from Davion Mitchell drew a foul. Butler writhed on the court and clutched his right knee after sustaining the injury. Warriors coach Steve Kerr called a timeout to check on Butler as Butler screamed in pain on the baseline.Prayers up for Jimmy Butler 🙏🙏 pic.twitter.com/0RrwwWkf8w— SleeperHoops (@Sleeper_Hoops) January 20, 2026Butler eventually left the court with the help of two teammates. He was unable to put weight on his right foot as he made his way to the tunnel. Jimmy Butler can’t put weight on his right knee. Buddy Hield and Jonathan Kuminga helping him to the locker room after a concerning scene in Chase Center. pic.twitter.com/4uSCuzXgEk— Anthony Slater (@anthonyVslater) January 20, 2026The Warriors announced after his exit that Butler was ruled out for the game with a right knee injury. They later said Butler would undergo an MRI and didn't reveal any information about the severity of the injury.\"Praying for the best, as far as scans,\" Warriors guard Stephen Curry said, according to ESPN's Anthony Slater.Overnight Tuesday, ESPN's Shams Charania reported Butler was dealing with a torn ACL.Butler previously had two significant injuries to same knee earlier in his career: a meniscus tear in 2018 and an MCL sprain in 2024. Big blow for Butler, WarriorsButler, a five-time All-NBA selection, is in his second season with the Warriors following a midseason trade from the Heat in 2024-25. The Warriors acquired Butler in an effort to compete for another championship on the back end of Stephen Curry's prime. Butler's maintained his high level of play at 36 years old. In 37 games before Monday's, Butler was averaging 20.1 points, 5.6 rebounds, 4.9 assists and 1.4 steals per game while shooting 51.9% from the field and 38.1% from 3. Curry, meanwhile, is averaging 27.6 points per game and leads the league for an 11th time with 4.5 made 3s per game on 38.6% shooting. He was named an All-Star starter earlier Monday.With Butler and Curry leading the team, the Warriors now hold a 25-19 record, good for eighth place the Western Conference. Butler's ACL tear projects to end any previous long-shot hope of Golden State competing in the West and could impact how the approach the trade market ahead of the Feb. 5 deadline.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 04:44:25 +0000",
    "ingested_at": "2026-01-21T15:32:04.287091Z"
  },
  {
    "guid": "02b7bb97-49f9-4d2e-aaf2-960f8fbbb3b0",
    "title": "Lakers center DeAndre Ayton shows off new look after leaving game due to eye poke: &#39;He looks like a pirate&#39;",
    "link": "https://sports.yahoo.com/nba/article/lakers-center-deandre-ayton-shows-off-new-look-after-leaving-game-due-to-eye-poke-he-looks-like-a-pirate-143539153.html",
    "description": "Deandre Ayton could be back in time for the Lakers&#39; next game.",
    "content_html": "Los Angeles Lakers big man Deandre Ayton is temporarily adopting a new look. After leaving Tuesday's contest due to an eye poke, Ayton posted a photo on Instagram in which he's wearing a patch over his eye.On the photo, Ayton added a pirate emoji, poking fun at his appearance.From Deandre’s IG: https://t.co/BVi0xIjnXgpic.twitter.com/fnXvfYnQon— Dave McMenamin (@mcten) January 21, 2026He was far from the only member of the Lakers to make that comparison. After the contest, Lakers head coach JJ Redick said Ayton looked \"like a pirate\" after leaving the contest just before halftime. Ayton did not play the entire third quarter due to the injury. Before the fourth quarter was over, the Lakers announced he would miss the rest of the contest. He finished with four points and eight rebounds in roughly 15 minutes during the Lakers' 115-107 win over the Denver Nuggets.While Redick said Ayton's eye was \"not in good shape\" after the game, the team doesn't expect Ayton to miss time. Redick added that the center \"will be fine\" ahead of Thursday's game against the Los Angeles Clippers. Even if Ayton needs to miss that game, it doesn't sound like the eye injury will keep him sidelined for long. After spending the last two seasons with the Portland Trail Blazers, Ayton joined the Lakers on a two-year deal in the offseason. He's put up his usual numbers through 37 games with the team, averaging 13.9 points and 8.8 rebounds.",
    "author": "Chris Cwik",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 14:35:39 +0000",
    "ingested_at": "2026-01-21T15:22:20.781208Z"
  },
  {
    "guid": "207ca0ad-31ea-47a9-b51f-21940d4d772f",
    "title": "What does losing Jimmy Butler mean for the Warriors as we know them?",
    "link": "https://sports.yahoo.com/nba/article/what-does-losing-jimmy-butler-mean-for-the-warriors-as-we-know-them-220033863.html",
    "description": "Golden State&#39;s best-laid plans have gone up in smoke. Is it finally time for a hard reset?",
    "content_html": "Adding Jimmy Butler fundamentally changed who the Warriors were last season — the way they played, the heights they could aspire to, their chances of playing meaningful basketball deep into springtime once again. Losing Butler on Monday to a torn right ACL — a devastating blow that sapped every ounce of sweetness out of Golden State’s fourth consecutive double-digit win — fundamentally changes who the Warriors are this season, and threatens a devastating alteration to who they could conceivably still be in the “fading dynasty” stage of the Stephen Curry/Draymond Green/Steve Kerr era.Let’s start with the obvious: It is extremely, extremely damaging to lose a player as good as Butler, whose teams have either outright won or been demonstrably better in his minutes in every season save the one where he was trying to force his way out of Minnesota.[Subscribe to Yahoo Sports NBA on YouTube]Even at age 36, a crisp 15 years and nearly 35,000 NBA minutes into his career, Butler remains one of the league’s best all-around players — a high-efficiency, low-mistake offensive connector; a versatile and disruptive defender; a high-IQ adaptor able to fit neatly into the flow when playing alongside Curry and scale up into a larger, more central role when Steph’s off the floor; a consistently high-floor contributor with few peers at his position.(Grant Thomas/Yahoo Sports illutration)Butler is second on the Warriors in scoring, third in assists and rebounds, and leads them in steals and total minutes played. There are four players in the NBA this season averaging at least 20 points, five rebounds, four assists and a steal per game while making at least half of their shots: Butler, perennial MVP favorite Nikola Jokić, and ascendant All-Star-caliber bigs Alperen Şengün and Jalen Johnson.The advanced stats, as ever, love him: He’s been a top-15-to-20 player this season in the eyes of estimated plus-minus, LEBRON, DARKO, value over replacement player, player efficiency rating, win shares per 48 minutes, box plus-minus and regularized adjusted plus-minus, among other metrics. The Warriors have been 9.6 points per 100 possessions better with Butler on the court than off it this season, according to Cleaning the Glass; among players who’ve logged 1,000 minutes, that’s the 10th-largest on/off swing in the NBA.Butler had averaged just under 22-5-5 on pristine .649 true shooting over the past month prior to exiting early against Miami. He was playing some of the best ball of his career, and with it, the Warriors had started to stabilize: Golden State has won four straight and 12 of its last 16, with the NBA’s second-best record and fifth-best net rating in that span.During that period, the Warriors have outscored opponents by 8.4 points per 100 possessions with Butler on the floor, compared to a plus-4.4 net rating without him. That includes a mammoth plus-12.9 net rating in the 183 minutes that Butler played without Curry, continuing the trend that began last season of Golden State finally being able to not only survive non-Steph minutes, but sometimes actually build a lead while he rested. (Imagine that.)Only one Warriors five-man lineup without Butler in it has played more than 20 minutes together this season; the quintet of Curry, Green, Gary Payton II, Brandin Podziemski and Moses Moody has been outscored by 13 points. That, um, will need to change — as will the general tenor of the non-Steph minutes, which, with Butler lost for the season, threaten to return to disaster time. The Warriors have been outscored by 3.9 points-per-100 this season with neither Curry nor Butler on the floor, posting a dismal non-garbage-time offensive rating of just 105.2 — several sub-basements below what the league-worst attack of the Tyrese Haliburton-less 10-34 Pacers has mustered over the course of this season.Combine that with the degree to which Golden State had struggled to tread water in non-Jimmy minutes even with Steph on the floor — just plus-1.1 points-per-100 over nearly 500 minutes this season — and the Warriors have a pretty gnarly puzzle to solve over the second half of the season if they hope to have any chance of remaining in postseason position.Golden State enters Tuesday’s game against the Toronto Raptors at 25-19, in eighth place in the Western Conference — in line for their third straight trip to the play-in tournament. With Butler in the fold and playing at an All-Star level, Kerr, general manager Mike Dunleavy Jr. and Co. could reasonably harbor hopes of erasing the two-game gap between them and the fifth-place Houston Rockets, putting themselves in position to not only avoid the play-in but potentially challenge for home-court advantage in the opening round of the playoffs. Now, though, the Warriors braintrust has to consider whether it’s likelier that they rise or fall — they’re three games ahead of ninth-place Portland, five games up on the 10th-place Clippers, and 5.5 clear of 11th-place Memphis — and how their internal projections will inform their decision-making ahead of the Feb. 5 trade deadline.Five days past the NBA’s most closely watched trade eligibility date, Jonathan Kuminga remains a member of the Warriors. Twenty-four hours ago, it seemed likely that Dunleavy would keep beating the bushes in search of a deal that could turn the out-of-favor 23-year-old into something, anything, that could improve the Warriors’ chances of making a deep playoff run. But with Golden State now in desperate need of a wing-sized person capable of putting the ball in the basket, even if it’s not in precisely the way Kerr prefers, and with the most frequently stated reason for shelving Kuminga — effectively, we can’t play three not-really-shooters who need the ball in their hands, and Jimmy and Draymond are better than Kuminga is — now a moot point, does that calculus change?If and when Kerr turns back to Kuminga — which he didn’t on Monday, but which he said could happen in the days and weeks ahead — how might the fifth-year forward respond? It seems like an awful lot, asking someone who has essentially been out of the rotation for two months to suddenly start replicating the production of a top-20 player — especially considering lineups where he’s had to carry the offensive workload without Steph or Jimmy have gotten drilled over the past two seasons. If a reintroduced Kuminga struggles under these adverse conditions, does it become even more difficult to move him for a return of noteworthy value? And if he doesn’t — if he looks great — well, then what do you do with a guy you’ve signaled in every way possible that you’re ready to drive to the airport at the earliest opportunity, but who’s suddenly become a load-bearing column in your current build?The $11 billion question hanging over all of this, in the hours after Butler’s grim diagnosis: Just what is that “current build,” now?The premise behind the Butler trade and subsequent extension was clean, clear and evident to all who observed it. Golden State had lined up the contracts of Curry, Butler and Green to take aim at a title run in 2024-25 and 2025-26, with a possible third in 2026-27, when Green holds a $27.7 million player option. It was an unmistakable declaration of intent: As long as we have Steph playing LIKE THIS, we’re going to go for it.And it worked, and it looked great … until it didn’t. The first run ended in the second round, after Steph hurt his hamstring against the Timberwolves; with Butler’s season now over, the second one appears to have ended before it could even get started. And now, the Warriors find themselves back where they were this time last year: with Curry still playing like this, but without a supporting cast commensurate with the frankly unbelievable level at which he continues to produce.Maybe that gives the rest of Golden State’s roster short shrift. De’Anthony Melton is finally healthy again and playing great. Al Horford’s starting to show signs of coming around. Podziemski’s in the midst of his best run of play of the season. Moody and Buddy Hield are shooting better than 40% from 3-point land over the last month. Maybe they keep rolling, and Kerr’s able to find enough contributions from elsewhere — from rookie Will Richard, from Quinten Post, from Trayce Jackson-Davis, and on, and on — to keep the Warriors in the fight, where they’re forever one Curry flurry from delivering a knockout blow.And maybe the injury doesn’t necessarily preclude one last big comeback run. The average return-to-play following an ACL tear is about 11 months, according to Jeff Stotts of In Street Clothes; that would put Butler’s return somewhere around Christmas, meaning he’d miss roughly the first quarter of the 2026-27 season, giving Golden State a lot of runway to get up to full strength before mid-April. Maybe there are still two real bites at the apple here.Maybe, though, Butler’s injury shakes the Warriors’ faith in the viability of that timeline — in the likelihood that, 14 months from now, a core of a 39-year-old Curry, a 37-year-old Green and a 37-year-old, post-ACL-reconstruction Butler will be good enough to win in the playoffs. If Dunleavy and Co. arrive at that conclusion, they’ll have to decide whether they’re comfortable continuing to ride what they’ve got into the sunset — appreciating that time comes for us all, that best-laid plans sometimes go awry, and that it’s worth allowing the Steph-Draymond-Jimmy core to run its course — or if it’s time to make even more drastic changes to the roster, in service of seeding the ground for the next era of Warriors basketball, whenever that might start.The former path would be perfectly respectable, if not downright honorable. In a world that’s seen the Warriors try to pull off the two timelines plan and let Klay Thompson walk, though, the latter can’t be ruled out. I don’t think that means they’re going to trade Steph in the middle of the night. (Although, y’know: Luka.) I do think, though, it means that just about anything else could be on the table, one fundamental change begetting another.",
    "author": "Dan Devine",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 22:00:33 +0000",
    "ingested_at": "2026-01-21T06:36:27.156383Z"
  },
  {
    "guid": "546622cb-4dcc-436e-8fce-f18921e8383c",
    "title": "NBA Power Rankings: Rating 25 &#39;available&#39; trade candidates, from worst to first",
    "link": "https://sports.yahoo.com/nba/article/nba-power-rankings-rating-25-available-trade-candidates-from-worst-to-first-213505024.html",
    "description": "With the NBA trade deadline two weeks away, let&#39;s sort through the players who have reportedly been in trade talks.",
    "content_html": "Welcome back to the world’s most accurate power rankings, where this week, before the Feb. 5 trade deadline, we are adding a wrinkle, rating 25 “available” NBA players from worst to first.Just how “available” they are is in some question. Giannis Antetokounmpo, for example, may want out, but until he formally requests a trade, the Milwaukee Bucks will be hesitant to grant him one. Others are readily available. Some may only be parted with for the right asking price.But all of them make some sense as trade candidates, given their situations. So, here we are to sort them based upon their talent, their contracts, their fits, their everything. Mostly: Can any of them meaningfully change a team’s championship chances? Here we try to sort them in order, mostly, based on how much each could alter this year’s title picture. Surely you will not argue.(Taylor Wilhelm/Yahoo Sports Illustration)One more thing before we get to the rankings: Karl-Anthony Towns. Is he available? Whispers are growing louder, if only because his New York Knicks are struggling. But I still cannot imagine a world in which the Knicks disrupt their roster — one that remains a favorite to emerge from the East — for anyone but Antetokounmpo. So we will leave him sidelined for now.Honorable mentions: Cam Thomas, Brooklyn Nets; Chris Paul, Los Angeles Clippers; De’Andre Hunter, Cleveland Cavaliers; Malik Monk; Sacramento Kings.25. Jonathan Kuminga, Golden State WarriorsOn Thursday, Kuminga demanded a trade from the Warriors. On Friday, we discussed whether he was even a good basketball player. On Monday, Golden State’s Jimmy Butler tore his right ACL, leaving open a massive hole on the wing. Warriors coach Steve Kerr was asked if he will turn to Kuminga, and in a disheartened voice he said, “Sure. Absolutely.” Audition time, I guess?24. Immanuel Quickley, Toronto RaptorsThe Raptors have canvassed the market, shopping “some of their players, including RJ Barrett and Immanuel Quickley,” looking to see what value they might find, according to ESPN. Among their reported potential targets are Anthony Davis and Ja Morant. Why a trade partner would want the three years and $97.5 million left on Quickley’s deal is a question to which it would need answers.[Subscribe to Yahoo Sports NBA on YouTube]23. Kristaps Porziņģis, Atlanta HawksThe Hawks, along with the Raptors, are reportedly among the teams that remain interested in the services of Davis, even after a hand injury that could sideline him through the All-Star break. Any Hawks trade for a high-priced star would have to include the $30.7 million expiring contract for Porziņģis, whose health remains a concern. Get him on the court, though, and he would help.22. Anfernee Simons, Boston CelticsOver the summer, Boston was “still very much willing to talk about Simons” in trade discussions, per longtime Celtics insider Steve Bulpett, even after acquiring the former Blazers guard in July. It makes sense, given Simons’ expiring $27.7 million salary. Boston has two reasons to shop him: 1) to duck the luxury tax or 2) to roll that salary forward for a surprisingly competitive roster. 21. Nikola Vučević, Chicago BullsBecause Vučević is on an expiring $21.5 million salary, longtime trade speculation has only rampedup this season, and Vučević himself might even want a change in scenery. To that end, Bulls coach Billy Donovan said, “I do think he’s invested and committed.” Which may make him even more tradable. The Bulls hold enough expiring money to pursue Davis, a local product.20. Jalen Green, Phoenix SunsWhile Green has not been mentioned in any well-sourced trade rumors, the Suns would almost certainly have to include his $33.6 million salary in any discussion of upgrades to a team fighting for a guaranteed playoff seed in the West. The former No. 2 overall pick has shown flashes as a 20-point scorer, though his defense and an ongoing hamstring injury are reasons for concern. 19. Herb Jones, New Orleans PelicansHerb Jones and Trey Murphy III are among the names the Pelicans are not willing to discuss ahead of the Feb. 5 trade deadline, per Chris Haynes. But teams will continue to call, so long as New Orleans remains at the bottom of the standings. Jones, a 3-and-D wing who has shot 32% from distance over the past two seasons, signed a three-year, $67.6 million extension in July. 18. DeMar DeRozan, Sacramento KingsThe NBA’s worst-keptsecret: Everyone on the Kings, including Domantas Sabonis, Zach LaVine and DeMar DeRozan, are available in a trade, particularly as Sacramento pursues another headliner. The Kings could even be open to a DeRozan-for-Morant swap, so long as it does not cost them much more than Devin Carter, but is that enough to persuade Memphis?17. Zach LaVine, Sacramento KingsAs with DeRozan, there is no secret about LaVine’s availability via trade. He is owed $49 million next season, when he will turn 32 years old. He has played four playoff games in 12 years. He has always been an efficient 20-point scorer, even if he cannot defend well and commits almost as many turnovers as he registers assists. It only makes sense that his contract is up for grabs.16. RJ Barrett, Toronto RaptorsLike Quickley, Barrett’s salary — $27.7 million this season and $29.6 million next season — makes for an intriguing match in Toronto’s pursuit of an upgrade, which is another reason why he has been linked to rumors surrounding both Davis and Morant. Barrett holds some value on his own, as the 25-year-old has averaged a fairly efficient 20-5-4 for the fourth-place Raptors.15. Coby White, Chicago BullsRival executives are circling the Bulls, according to ESPN’s Jamal Collier, and they may be more open to trading White’s expiring $12.9 million salary than ever before, per Substack insider Marc Stein. Of course, White is owed a potentially costly contract extension at season’s end. The Wolves are reportedly among the teams weighing whether that juice is worth the squeeze.14. Jarrett Allen, Cleveland CavaliersGiven the mix in Cleveland, with Evan Mobley emerging as a force in the middle, we have long wondered whether Allen would be long for the Cavaliers. Trade consideration subsided last season, as the Cavs won 64 games, but ever since they lost another second-round playoff series and started this season in search of a playoff guarantee, speculation has only resurfaced.13. Tyler Herro, Miami HeatMiami will be linked to whatever superstar becomes available, including if and when the Bucks decide to entertain sweepstakes for Giannis Antetokounmpo. One of the few assets the Heat can offer in return is Herro, a 26-year-old, one-time All-Star and former Sixth Man of the Year. He is owed $33 million in 2026-27. How enticing that is to a team trading a superstar is in question. 12. LaMelo Ball, Charlotte Hornets“Ball has grown increasingly frustrated with the organization and is open to a trade away from the franchise,” according to Yahoo Sports’ Kelly Iko. Of course, Ball denied this publicly, saying, “The source wasn’t me, so it’s false info,” though reports ever since have maintained that rival executives are operating under the assumption that Ball is available. Does anyone want him?11. Darius Garland, Cleveland CavaliersAs is the case with Allen in the frontcourt, there is a logjam in Cleveland’s backcourt, where Donovan Mitchell is the premier option. Garland’s impact is somewhat redundant, and the Cavs might be looking to make better sense of their roster. For those interested, though, Substack’s Jake Fischer insists, “I just haven’t heard any credible rumblings about Garland’s availability.”10. Austin Reaves, Los Angeles LakersCredit Lakers superstar LeBron James’ agent, Rich Paul, for entering Reaves’ name into the trade discussion, as he proposed a swap of the Lakers’ 27-year-old guard for Jaren Jackson Jr. Paul is not wrong, either, as Reaves could be owed a near-max contract at season’s end, and any quest for a star partner to James and Luka Dončić would require Reaves’ services in return. 9. Domantas Sabonis, Sacramento KingsAgain: No secret has been made about the availability of Sabonis, LaVine and DeRozan. The Kings are looking to mix things up, once again, and if it costs them their best players, so be it. It is not like Sacramento is winning anything as currently constituted. And Sabonis is capable of a triple-double on any given night, although his defense might dissuade most potential suitors.8. Zion Williamson, New Orleans PelicansWilliamson is among the names the Pelicans have been unwilling to shop, Haynes reported, though he may be the most likely of New Orleans’ targets to be traded, per The Athletic’s William Guillory. The Wizards are reportedly on the list of teams that could be interested at the right price. The right price for the oft-injured forward, though, may not be what the Pels want.7. Ja Morant, Memphis Grizzlies“Everybody in here who knows me, knows I’m a very loyal guy,” insisted Morant. “I got a logo on my back, and that should tell you where I want to be.” Of course, based on everything else we have heard, Morant no longer wants to be on the Grizzlies, and they no longer want him, either. As anticipated, multiple suitors have emerged for Morant, including Miami, though at what cost?6. Trey Murphy III, New Orleans PelicansAnd again: Murphy is among the names New Orleans has been unwilling to discuss. Still, “not completely no on Trey, but a pretty high price tag,” according to The Athletic’s Sam Amick. And it makes complete sense. Murphy (22-6-4 on near 50/40/90 shooting splits) is the exact kind of 3-and-D wing, with the potential for more to his game, that any rival team would want to acquire.5. Michael Porter Jr., Brooklyn NetsIt is unclear how much the Warriors’ reported interest in Porter has changed in the wake of Butler’s injury, as it was even unclear how much Golden State was interested anyhow. Detroit has discussed the idea of dealing for Porter, according to Fischer. We have seen Porter win a title. Surely another contender can convince itself he can help them win, too.4. Jaren Jackson Jr., Memphis GrizzliesAs the market for Morant unfolds, “there’s a growing thought [among rival executives] that Jackson … could be the next domino to fall at some point,” according to Iko. That thought is widely held about the NBA’s 2023 Defensive Player of the Year. What need would Memphis have for Jackson if the franchise is, as reported, seeking a future-focused package for Morant?3. Anthony Davis, Dallas MavericksDavis’ most recent injury muddied the waters of his trade market, as has every injury he has sustained throughout his career. Atlanta and Toronto both appear to still be interested, but “the cost is most certainly going to be lower than it was even a month ago,” per ESPN’s Shams Charania. Which is why it may be in the best interest of Dallas and Davis to keep the status quo.2. Lauri Markkanen, Utah JazzIt was thought a long shot that Markkanen would remain a member of the Jazz, but Utah exec Austin Ainge insisted the Finnish forward “hopefully is part of our next team when we’re going up.” Keyonte George’s emergence gives Ainge further reason to believe in a come-up, so any trade of Markkanen would surely cost his suitor “an arm and a leg in years of draft capital.” 1. Giannis Antetokounmpo, Milwaukee BucksFunny thing about Giannis. He might want out. “I don’t know,” he said most recently, “I take it day by day.” He should want out, since his Bucks are bound for the lottery. But he does not want to ask out, for fear of alienating the fans in Milwaukee, per Collier. So maybe he will let his agent do his bidding. In which case, the league will line up for his services. This is Giannis, after all.",
    "author": "Ben Rohrbach",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 21:35:05 +0000",
    "ingested_at": "2026-01-21T06:24:05.268253Z"
  },
  {
    "guid": "dfba9e54-13f9-4582-abed-760e0541ed82",
    "title": "Warriors GM Mike Dunleavy Jr. not planning to deal Jimmy Butler&#39;s contract, ponders Jonathan Kuminga&#39;s trade value: &#39;There needs to be demand&#39;",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/warriors-gm-mike-dunleavy-jr-not-planning-to-deal-jimmy-butlers-contract-ponders-jonathan-kumingas-trade-value-there-needs-to-be-demand-044620803.html",
    "description": "The NBA trade deadline is Feb. 5. The Warriors have a lot to figure out before then.",
    "content_html": "Jimmy Butler's ACL tear is a devastating blow for the veteran All-Star and cause for a reckoning in Golden State over its plans to compete in the back-end of Stephen Curry's prime. General manager Mike Dunleavy was on hand Tuesday night to address the Warriors' short- and long-term plans ahead of Golden State's home game against the Toronto Raptors.He was asked about Butler's future with the franchise as well as that of disgruntled forward Jonathan Kuminga, who's been languishing on the bench amid poor play and a trade demand. And ... let's just say that he has divergent thoughts on Butler's and Kuminga's value on the basketball court.Dunleavy not ready to tear things downWith Butler's injury prompting chatter of a full teardown and the end of the era of competitive basketball with Curry, Dunleavy was asked about the prospect of trading away Butler's contract, which has one year and $56.8 million remaining beyond this season. Dunleavy said that he's not entertaining the idea.  \"I don't envision that,\" Dunleavy said. \"But now that you've brought it up, I guess I'd say what I envision for him is kind of giving us a boost next year the same way he did last year when he arrived. \"And so, at some point during the season, him returning and being the player he's been.\"Mike Dunleavy said he does not envision he will trade Jimmy Butler’s contract and believes Butler will rehab and return to help the team at some point next season pic.twitter.com/FjU1xzDnb6— Anthony Slater (@anthonyVslater) January 21, 2026That sounds like a man not ready to wave the white flag on the Curry era. It's also sounds like the words of an optimist. Butler will be 37 next season and coming off one of the most serious injuries in sports. Can Butler return to high-level basketball after ACL tear?Butler's been a boon for the Warriors and helped spark a run to the second round of the playoffs last season after arriving via a midseason trade. The Warriors made the playoffs as the No. 7 seed out of the play-in, then upset the No. 2 seed Rockets in the first round before falling to the Timberwolves in the second. Butler's arrival was a big reason for that success, and he was playing at an All-Star level this season (20 ppg, 5.6 rpg, 4.9 apg, 1.4 spg) before tearing his right ACL Monday night. If anyone's capable of returning from an ACL tear to play at a high level at 37 years old, Butler's the type of player to do it. And for now, at least, Dunleavy appears to be holding out hope that that's how things play out The alternative is not an appealing option and one that could mean dealing Curry while he still has trade value. They are not ready for that in Golden State. What about Kuminga?As for the short-term, Butler's minutes just opened up, and they need to be filled. That could mean the end of Kuminga's relegation to the bench. Head coach Steve Kerr opened the door to that possibility, telling reporters that Kuminga \"could be\" part of the rotation in Butler's absence. That would require a willingness on both sides to thaw an icy relationship. Dunleavy doesn't sound eager to extend an olive branch. When asked about Kuminga's trade demand, Dunleavy suggested that Kuminga might not drum up much demand for his services.\"As far as the demand, I'm aware of that. In terms of demands, when you make a demand, there needs to be demand — on the market.\"Warriors GM Mike Dunleavy Jr. with a candid quote on Jonathan Kuminga's trade demand. pic.twitter.com/7iNoKxpd2z— KNBR (@KNBR) January 21, 2026\"I think as far as the demand — I'm aware of that,\" Dunleavy said. \"I think in terms of demands, when you make a demand, there needs to be demand on the market. So, we'll see where that unfolds.The NBA trade deadline is Feb. 5. The Warriors have a lot to figure out before then.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Wed, 21 Jan 2026 04:46:20 +0000",
    "ingested_at": "2026-01-21T05:22:35.361103Z"
  },
  {
    "guid": "209fe6a9-ff19-4e7c-928c-0df8b03e9ae8",
    "title": "Lamar Odom arrested on suspicion of DUI in Vegas after reportedly driving more than 100 mph",
    "link": "https://sports.yahoo.com/nba/article/lamar-odom-arrested-on-suspicion-of-dui-in-vegas-after-reportedly-driving-more-than-100-mph-234657944.html",
    "description": "Odom was arrested and charged with DUI in 2013 and has been open about his previous struggles with drug addiction.",
    "content_html": "Lamar Odom was arrested on suspicion of driving under the influence in Las Vegas over the weekend after a Nevada State Police trooper spotted the 46-year-old, two-time NBA champion driving more than 100 mph, according to KTNV 13 Action News' Tuesday report.Around 2:20 a.m. on Saturday, the trooper saw a black SUV speeding on Interstate 15, where the speed limit was posted at 65 mph. When the trooper pulled over the car, which also changed lanes without signaling, they found Odom and an unidentified male passenger, per KTNV, which reported that both had red, watery eyes and smelled of marijuana.Odom, a former 14-year NBA veteran who's been open about his previous struggles with drug addiction and depression, was arrested and charged with DUI in 2013.On Saturday, when Odom was searching for his registration and insurance, he tried to initiate conversation with the trooper, according 8 News Now, which cited documents it obtained Tuesday. He asked how the trooper's night was going besides him \"driving like he was 'in Back to the Future,'\" the report stated, via 8 News Now.Lamar Odom, flanked here by Derek Fisher and Trevor Ariza at a Los Angeles Lakers at a Christmas Day game in 2023, was arrested in Las Vegas on suspicion of DUI over the weekend. (Photo by Allen Berezovsky/Getty Images)Allen Berezovsky via Getty ImagesWhen Odom was asked why he was speeding — 8 News Now reported that his SUV was tracked going as fast as 106 mph — he reportedly changed his story multiple times, first noting that he was \"almost home\" and then later saying that he was headed to his friend's house.Odom reportedly followed a similar pattern when he was asked about the last time he consumed marijuana. At one point, he quickly changed his answer from he \"doesn't really smoke\" to saying he \"does not smoke,\" according to the report 8 News Now obtained. Eventually, Odom admitted he smoked \"maybe earlier today.\"The report showed that Odom failed the sobriety tests he was given and then was arrested, per 8 News Now. As of Tuesday, Odom was no longer in custody, per The Associated Press, which cited Clark County jail records. He was booked there on charges of DUI, driving more than 41 miles per hour over the speed limit and failing to maintain travel in a street lane/improper lane change, as reported by USA Today.He has a hearing scheduled for March 17.Odom played for four different NBA teams from 1999-2013 before drug abuse derailed the remainder of the forward's basketball career. It also ruptured his marriage to Khloé Kardashian. An overdose left him comatose for three days in a Vegas hospital when he was found unconscious in a brothel in 2015, although Odom still says he doesn't recall taking drugs that night.Odom was part of the NBA All-Rookie first team with the Los Angeles Clippers, who drafted him No. 4 overall out of Rhode Island in 1999. He became the league's Sixth Man of the Year with the Lakers in 2011 after helping the franchise win back-to-back titles in 2009-10.",
    "author": "Andy Backstrom",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 23:46:57 +0000",
    "ingested_at": "2026-01-21T01:03:54.423805Z"
  },
  {
    "guid": "ac16fe41-4e1c-449a-9675-8ed28dccd0f3",
    "title": "Warriors All-Star Jimmy Butler out for season with torn ACL, will undergo surgery",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/warriors-all-star-jimmy-butler-out-for-season-with-torn-acl-will-undergo-surgery-044425188.html",
    "description": "Butler tore his right ACL in Monday&#39;s Warriors win over the Heat.",
    "content_html": "Golden State Warriors forward Jimmy Butler suffered a torn ACL in Monday's 135-112 win over the Miami Heat. His season is over.Butler's agent, Bernie Lee, confirmed the injury Tuesday. Lee called it a \"gut punch\" and said Butler would \"attack this challenge\" hoping to come back stronger. The Warriors also confirmed the injury later Tuesday and announced that Butler would undergo surgery at a \"to-be-determined date.\"Butler, meanwhile, posted on Instagram stating he would \"be back before you know it.\" [Get more Warriors news: Golden State team team feed]The injury took place in the third quarter at the Chase Center after Butler caught a contested pass in the paint. Butler landed awkwardly on his right leg and fell to the ground after contact from Davion Mitchell drew a foul. Butler writhed on the court and clutched his right knee after sustaining the injury. Warriors coach Steve Kerr called a timeout to check on Butler as Butler screamed in pain on the baseline.Prayers up for Jimmy Butler 🙏🙏 pic.twitter.com/0RrwwWkf8w— SleeperHoops (@Sleeper_Hoops) January 20, 2026Butler eventually left the court with the help of two teammates. He was unable to put weight on his right foot as he made his way to the tunnel. Jimmy Butler can’t put weight on his right knee. Buddy Hield and Jonathan Kuminga helping him to the locker room after a concerning scene in Chase Center. pic.twitter.com/4uSCuzXgEk— Anthony Slater (@anthonyVslater) January 20, 2026The Warriors announced after his exit that Butler was ruled out for the game with a right knee injury. They later said Butler would undergo an MRI and didn't reveal any information about the severity of the injury.\"Praying for the best, as far as scans,\" Warriors guard Stephen Curry said, according to ESPN's Anthony Slater.Overnight Tuesday, ESPN's Shams Charania reported Butler was dealing with a torn ACL.Butler previously had two significant injuries to same knee earlier in his career: a meniscus tear in 2018 and an MCL sprain in 2024. Big blow for Butler, WarriorsButler, a five-time All-NBA selection, is in his second season with the Warriors following a midseason trade from the Heat in 2024-25. The Warriors acquired Butler in an effort to compete for another championship on the back end of Stephen Curry's prime. Butler's maintained his high level of play at 36 years old. In 37 games before Monday's, Butler was averaging 20.1 points, 5.6 rebounds, 4.9 assists and 1.4 steals per game while shooting 51.9% from the field and 38.1% from 3. Curry, meanwhile, is averaging 27.6 points per game and leads the league for an 11th time with 4.5 made 3s per game on 38.6% shooting. He was named an All-Star starter earlier Monday.With Butler and Curry leading the team, the Warriors now hold a 25-19 record, good for eighth place the Western Conference. Butler's ACL tear projects to end any previous long-shot hope of Golden State competing in the West and could impact how the approach the trade market ahead of the Feb. 5 deadline.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 04:44:25 +0000",
    "ingested_at": "2026-01-20T23:13:51.060206Z"
  },
  {
    "guid": "a2ea111c-f40b-4604-8b13-af7c01c9ab73",
    "title": "Jalen Brunson, Karl-Anthony Towns respond to boos at MSG, reportedly hold players-only meeting: &#39;I&#39;d be booing us too&#39;",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/jalen-brunson-karl-anthony-towns-respond-to-boos-at-msg-reportedly-hold-players-only-meeting-id-be-booing-us-too-031512118.html",
    "description": "A day after the Knicks All-Stars responded to boos at MSG, news broke that Brunson called a players only meeting to address a 2-9 slump.",
    "content_html": "A New York Knicks skid reached what fans can only hope is its nadir Monday in a blowout loss to the hapless Dallas Mavericks at home. This once again — and repeatedly — led to boos from the crowd at Madison Square Garden. And, per ESPN's Ramona Shelburne, it prompted team captain Jalen Brunson to call a players only meeting after the loss. Per the report, Brunson emphasized in the meeting that Knicks players need to look to themselves rather than coach Mike Brown and his staff to fix the problems that have resulted in a 2-9 slump in their last 11 games on the heels of winning the NBA Cup in mid-December. The slump has led to frustration in the locker and among a vocal Knicks fan base.On Monday, boos started to rain from the MSG stands in the second quarter after the Mavericks built a 49-31 lead. The Knicks previously heard boos from the home crowd in the fourth quarter of Saturday's 106-99 loss to the Phoenix Suns. For the second straight night the Knicks hear loud boos from the MSG crowd. pic.twitter.com/EhWBDKCios— KNICKS BEAST (@KnicksBeast) January 19, 2026The Knicks did not respond well to Monday's boos. The Mavericks remained in control of the game en route to a 114-97 win to improve to 18-26, good for 12th place in the West.The slump for the Knicks has dropped them from a 23-9 start to 25-18. That's good enough for third place in the East. But the Knicks are now closer in the standings to the 11th-place Milwaukee Bucks (18-24) than they are to the first-place Detroit Pistons (31-10). And they ended Monday 1.5 games behind the much-loathed Boston Celtics (26-16).Jalen Brunson: 'I'd be booing us too'Brunson and fellow All-Star Karl-Anthony Towns both heard the boos — obviously. And they understand. Brunson finished Monday with 22 points and six assists. But he struggled from the field in a 9-of-22 shooting effort. He was asked about the boos at his locker room postgame.\"I'd be booing us too,\" Brunson said. \"Straight up.\"\"I'd be booing us too. Straight up\"- Jalen Brunson on the boos at MSG pic.twitter.com/XtnkiHkqOT— Knicks Videos (@sny_knicks) January 20, 2026Towns posted the best effort by a Knick with 22 points and 18 rebounds, but he committed a team-high five turnovers and five fouls. And he's posted a few duds of his own during the slump, including a six-point, one-rebound effort in a 121-90 loss to the Pistons on Jan. 5.Like Brunson, he understands the boos. And he put himself in the perspective of a fan paying to attend Monday's Martin Luther King Jr. Day matinee. Karl-Anthony Towns on the boos at MSG directed at him and the team\"You spend $140 to represent your favorite player with a jersey. You come to MLK Day here at The Garden and tickets are 3x the price. I'd be disappointed too\" pic.twitter.com/vrTAznt1mV— Knicks Videos (@sny_knicks) January 20, 2026\"You come, you spend, what $140 bucks to represent your favorite player with a jersey?\" Towns said. \"And you come to MLK Day here at the Garden and tickets are twice, three times the price?\"And to come here and spend your hard-earned money, money that you've saved up to bring your family to this game and for us to come here and obviously, not only [not] win — which is disappointing — but not really have a chance. I'd be disappointed, too.\"The fans who spend their hard-earned money, they give us so much love and motivation to go out there. They expect the results. And so do we. The fans are doing their part. And we've got to do our part.\"If there's any solace for frustrated Knicks fans, it's that those are the exact kind of responses you want to hear from star players who just got booed off their home court for another poor showing. But that won't stop the boos. Only winning will.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 03:15:12 +0000",
    "ingested_at": "2026-01-20T23:13:51.060705Z"
  },
  {
    "guid": "207ca0ad-31ea-47a9-b51f-21940d4d772f",
    "title": "What does losing Jimmy Butler mean for the Warriors as we know them?",
    "link": "https://sports.yahoo.com/nba/article/what-does-losing-jimmy-butler-mean-for-the-warriors-as-we-know-them-220033863.html",
    "description": "Golden State&#39;s best-laid plans have gone up in smoke. Is it finally time for a hard reset?",
    "content_html": "Adding Jimmy Butler fundamentally changed who the Warriors were last season — the way they played, the heights they could aspire to, their chances of playing meaningful basketball deep into springtime once again. Losing Butler on Monday to a torn right ACL — a devastating blow that sapped every ounce of sweetness out of Golden State’s fourth consecutive double-digit win — fundamentally changes who the Warriors are this season, and threatens a devastating alteration to who they could conceivably still be in the “fading dynasty” stage of the Stephen Curry/Draymond Green/Steve Kerr era.Let’s start with the obvious: It is extremely, extremely damaging to lose a player as good as Butler, whose teams have either outright won or been demonstrably better in his minutes in every season save the one where he was trying to force his way out of Minnesota.[Subscribe to Yahoo Sports NBA on YouTube]Even at age 36, a crisp 15 years and nearly 35,000 NBA minutes into his career, Butler remains one of the league’s best all-around players — a high-efficiency, low-mistake offensive connector; a versatile and disruptive defender; a high-IQ adaptor able to fit neatly into the flow when playing alongside Curry and scale up into a larger, more central role when Steph’s off the floor; a consistently high-floor contributor with few peers at his position.(Grant Thomas/Yahoo Sports illutration)Butler is second on the Warriors in scoring, third in assists and rebounds, and leads them in steals and total minutes played. There are four players in the NBA this season averaging at least 20 points, five rebounds, four assists and a steal per game while making at least half of their shots: Butler, perennial MVP favorite Nikola Jokić, and ascendant All-Star-caliber bigs Alperen Şengün and Jalen Johnson.The advanced stats, as ever, love him: He’s been a top-15-to-20 player this season in the eyes of estimated plus-minus, LEBRON, DARKO, value over replacement player, player efficiency rating, win shares per 48 minutes, box plus-minus and regularized adjusted plus-minus, among other metrics. The Warriors have been 9.6 points per 100 possessions better with Butler on the court than off it this season, according to Cleaning the Glass; among players who’ve logged 1,000 minutes, that’s the 10th-largest on/off swing in the NBA.Butler had averaged just under 22-5-5 on pristine .649 true shooting over the past month prior to exiting early against Miami. He was playing some of the best ball of his career, and with it, the Warriors had started to stabilize: Golden State has won four straight and 12 of its last 16, with the NBA’s second-best record and fifth-best net rating in that span.During that period, the Warriors have outscored opponents by 8.4 points per 100 possessions with Butler on the floor, compared to a plus-4.4 net rating without him. That includes a mammoth plus-12.9 net rating in the 183 minutes that Butler played without Curry, continuing the trend that began last season of Golden State finally being able to not only survive non-Steph minutes, but sometimes actually build a lead while he rested. (Imagine that.)Only one Warriors five-man lineup without Butler in it has played more than 20 minutes together this season; the quintet of Curry, Green, Gary Payton II, Brandin Podziemski and Moses Moody has been outscored by 13 points. That, um, will need to change — as will the general tenor of the non-Steph minutes, which, with Butler lost for the season, threaten to return to disaster time. The Warriors have been outscored by 3.9 points-per-100 this season with neither Curry nor Butler on the floor, posting a dismal non-garbage-time offensive rating of just 105.2 — several sub-basements below what the league-worst attack of the Tyrese Haliburton-less 10-34 Pacers has mustered over the course of this season.Combine that with the degree to which Golden State had struggled to tread water in non-Jimmy minutes even with Steph on the floor — just plus-1.1 points-per-100 over nearly 500 minutes this season — and the Warriors have a pretty gnarly puzzle to solve over the second half of the season if they hope to have any chance of remaining in postseason position.Golden State enters Tuesday’s game against the Toronto Raptors at 25-19, in eighth place in the Western Conference — in line for their third straight trip to the play-in tournament. With Butler in the fold and playing at an All-Star level, Kerr, general manager Mike Dunleavy Jr. and Co. could reasonably harbor hopes of erasing the two-game gap between them and the fifth-place Houston Rockets, putting themselves in position to not only avoid the play-in but potentially challenge for home-court advantage in the opening round of the playoffs. Now, though, the Warriors braintrust now has to consider whether it’s likelier that they rise or fall — they’re three games ahead of ninth-place Portland, five games up on the 10th-place Clippers, and 5.5 clear of 11th-place Memphis — and how their internal projections will inform their decision-making ahead of the Feb. 5 trade deadline.Five days past the NBA’s most closely watched trade eligibility date, Jonathan Kuminga remains a member of the Warriors. Twenty-four hours ago, it seemed likely that Dunleavy would keep beating the bushes in search of a deal that could turn the out-of-favor 23-year-old into something, anything, that could improve the Warriors’ chances of making a deep playoff run. But with Golden State now in desperate need of a wing-sized person capable of putting the ball in the basket, even if it’s not in precisely the way Kerr prefers, and with the most frequently stated reason for shelving Kuminga — effectively, we can’t play three not-really-shooters who need the ball in their hands, and Jimmy and Draymond are better than Kuminga is — does that calculus change?If and when Kerr turns back to Kuminga — which he didn’t on Monday, but which he said could happen in the days and weeks ahead — how might the fifth-year forward respond? It seems like an awful lot, asking someone who has essentially been out of the rotation for two months to suddenly start replicating the production of a top-20 player — especially considering lineups where he’s had to carry the offensive workload without Steph or Jimmy have gotten drilled over the past two seasons. If a reintroduced Kuminga struggles under these adverse conditions, does it become even more difficult to move him for a return of noteworthy value? And if he doesn’t — if he looks great — well, then what do you do with a guy you’ve signaled in every way possible that you’re ready to drive to the airport at the earliest opportunity, but who’s suddenly become a load-bearing column in your current build?The $11 billion question hanging over all of this, in the hours after Butler’s grim diagnosis: Just what is that “current build,” now?The premise behind the Butler trade and subsequent extension was clean, clear and evident to all who observed it. Golden State had lined up the contracts of Curry, Butler and Green to take aim at a title run in 2024-25 and 2025-26, with a possible third in 2026-27, when Green holds a $27.7 million player option. It was an unmistakable declaration of intent: As long as we have Steph playing LIKE THIS, we’re going to go for it.And it worked, and it looked great … until it didn’t. The first run ended in the second round, after Steph hurt his hamstring against the Timberwolves; with Butler’s season now over, the second one appears to have ended before it could even get started. And now, the Warriors find themselves back where they were this time last year: with Curry still playing like this, but without a supporting cast commensurate with the frankly unbelievable level at which he continues to produce.Maybe that gives the rest of Golden State’s roster short shrift. De’Anthony Melton is finally healthy again and playing great. Al Horford’s starting to show signs of coming around. Podziemski’s in the midst of his best run of play of the season. Moody and Buddy Hield are shooting better than 40% from 3-point land over the last month. Maybe they keep rolling, and Kerr’s able to find enough contributions from elsewhere — from rookie Will Richard, from Quinten Post, from Trayce Jackson-Davis, and on, and on — to keep the Warriors in the fight, where they’re forever one Curry flurry from delivering a knockout blow.And maybe the injury doesn’t necessarily preclude one last big comeback run. The average return-to-play following an ACL tear is about 11 months, according to Jeff Stotts of In Street Clothes; that would put Butler’s return somewhere around Christmas, meaning he’d miss roughly the first quarter of the 2026-27 season, giving Golden State a lot of runway to get up to full strength before mid-April. Maybe there are still two real bites at the apple here.Maybe, though, Butler’s injury shakes the Warriors’ faith in the viability of that timeline — in the likelihood that, 14 months from now, a core of a 39-year-old Curry, a 37-year-old Green and a 37-year-old, post-ACL-reconstruction Butler will be good enough to win in the playoffs. If Dunleavy and Co. arrive at that conclusion, they’ll have to decide whether they’re comfortable continuing to ride what they’ve got into the sunset — appreciating that time comes for us all, that best-laid plans sometimes go awry, and that it’s worth allowing the Steph-Draymond-Jimmy core to run its course — or if it’s time to make even more drastic changes to the roster, in service of seeding the ground for the next era of Warriors basketball, whenever that might start.The former path would be perfectly respectable, if not downright honorable. In a world that’s seen the Warriors try to pull off the two timelines plan and let Klay Thompson walk, though, the latter can’t be ruled out. I don’t think that means they’re going to trade Steph in the middle of the night. (Although, y’know: Luka.) I do think, though, it means that just about anything else could be on the table, one fundamental change begetting another.",
    "author": "Dan Devine",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 22:00:33 +0000",
    "ingested_at": "2026-01-20T22:14:53.735812Z"
  },
  {
    "guid": "546622cb-4dcc-436e-8fce-f18921e8383c",
    "title": "NBA Power Rankings: Rating 25 &#39;available&#39; trade candidates, from worst to first",
    "link": "https://sports.yahoo.com/nba/article/nba-power-rankings-rating-25-available-trade-candidates-from-worst-to-first-213505024.html",
    "description": "With the NBA trade deadline two weeks away, let&#39;s sort through the players who have reportedly been in trade talks.",
    "content_html": "Welcome back to the world’s most accurate power rankings, where this week, before the Feb. 5 trade deadline, we are adding a wrinkle, rating 25 “available” NBA players from worst to first.Just how “available” they are is in some question. Giannis Antetokounmpo, for example, may want out, but until he formally requests a trade, the Milwaukee Bucks will be hesitant to grant him one. Others are readily available. Some may only be parted with for the right asking price.But all of them make some sense as trade candidates, given their situations. So, here we are to sort them based upon their talent, their contracts, their fits, their everything. Mostly: Can any of them meaningfully change a team’s championship chances? Here we try to sort them in order, mostly, based on how much each could alter this year’s title picture. Surely you will not argue.(Taylor Wilhelm/Yahoo Sports Illustration)One more thing before we get to the rankings: Karl-Anthony Towns. Is he available? Whispers are growing louder, if only because his New York Knicks are struggling. But I still cannot imagine a world in which the Knicks disrupt their roster — one that remains a favorite to emerge from the East — for anyone but Antetokounmpo. So we will leave him sidelined for now.Honorable mentions: Cam Thomas, Brooklyn Nets; Chris Paul, Los Angeles Clippers; De’Andre Hunter, Cleveland Cavaliers; Malik Monk; Sacramento Kings.25. Jonathan Kuminga, Golden State WarriorsOn Thursday, Kuminga demanded a trade from the Warriors. On Friday, we discussed whether he was even a good basketball player. On Monday, Golden State’s Jimmy Butler tore his right ACL, leaving open a massive hole on the wing. Warriors coach Steve Kerr was asked if he will turn to Kuminga, and in a disheartened voice he said, “Sure. Absolutely.” Audition time, I guess?24. Immanuel Quickley, Toronto RaptorsThe Raptors have canvassed the market, shopping “some of their players, including RJ Barrett and Immanuel Quickley,” looking to see what value they might find, according to ESPN. Among their reported potential targets are Anthony Davis and Ja Morant. Why a trade partner would want the three years and $97.5 million left on Quickley’s deal is a question to which it would need answers.[Subscribe to Yahoo Sports NBA on YouTube]23. Kristaps Porziņģis, Atlanta HawksThe Hawks, along with the Raptors, are reportedly among the teams that remain interested in the services of Davis, even after a hand injury that could sideline him through the All-Star break. Any Hawks trade for a high-priced star would have to include the $30.7 million expiring contract for Porziņģis, whose health remains a concern. Get him on the court, though, and he would help.22. Anfernee Simons, Boston CelticsOver the summer, Boston was “still very much willing to talk about Simons” in trade discussions, per longtime Celtics insider Steve Bulpett, even after acquiring the former Blazers guard in July. It makes sense, given Simons’ expiring $27.7 million salary. Boston has two reasons to shop him: 1) to duck the luxury tax or 2) to roll that salary forward for a surprisingly competitive roster. 21. Nikola Vučević, Chicago BullsBecause Vučević is on an expiring $21.5 million salary, longtime trade speculation has only rampedup this season, and Vučević himself might even want a change in scenery. To that end, Bulls coach Billy Donovan said, “I do think he’s invested and committed.” Which may make him even more tradable. The Bulls hold enough expiring money to pursue Davis, a local product.20. Jalen Green, Phoenix SunsWhile Green has not been mentioned in any well-sourced trade rumors, the Suns would almost certainly have to include his $33.6 million salary in any discussion of upgrades to a team fighting for a guaranteed playoff seed in the West. The former No. 2 overall pick has shown flashes as a 20-point scorer, though his defense and an ongoing hamstring injury are reasons for concern. 19. Herb Jones, New Orleans PelicansHerb Jones and Trey Murphy III are among the names the Pelicans are not willing to discuss ahead of the Feb. 5 trade deadline, per Chris Haynes. But teams will continue to call, so long as New Orleans remains at the bottom of the standings. Jones, a 3-and-D wing who has shot 32% from distance over the past two seasons, signed a three-year, $67.6 million extension in July. 18. DeMar DeRozan, Sacramento KingsThe NBA’s worst-keptsecret: Everyone on the Kings, including Domantas Sabonis, Zach LaVine and DeMar DeRozan, are available in a trade, particularly as Sacramento pursues another headliner. The Kings could even be open to a DeRozan-for-Morant swap, so long as it does not cost them much more than Devin Carter, but is that enough to convince Memphis?17. Zach LaVine, Sacramento KingsAs with DeRozan, there is no secret about LaVine’s availability via trade. He is owed $49 million next season, when he will turn 32 years old. He has played four playoff games in 12 years. He has always been an efficient 20-point scorer, even if he cannot defend well and commits almost as many turnovers as he registers assists. It only makes sense that his contract is up for grabs.16. RJ Barrett, Toronto RaptorsLike Quickley, Barrett’s salary — $27.7 million this season and $29.6 million next season — makes for an intriguing match in Toronto’s pursuit of an upgrade, which is another reason why he has been linked to rumors surrounding both Davis and Morant. Barrett holds some value on his own, as the 25-year-old has averaged a fairly efficient 20-5-4 for the fourth-place Raptors.15. Coby White, Chicago BullsRival executives are circling the Bulls, according to ESPN’s Jamal Collier, and they may be more open to trading White’s expiring $12.9 million salary than ever before, per Substack insider Marc Stein. Of course, White is owed a potentially costly contract extension at season’s end. The Wolves are reportedly among the teams weighing whether that juice is worth the squeeze.14. Jarrett Allen, Cleveland CavaliersGiven the mix in Cleveland, with Evan Mobley emerging as a force in the middle, we have long wondered whether Allen would be long for the Cavaliers. Trade consideration subsided last season, as the Cavs won 64 games, but ever since they lost another second-round playoff series and started this season in search of a playoff guarantee, speculation has only resurfaced.13. Tyler Herro, Miami HeatMiami will be linked to whatever superstar becomes available, including if and when the Bucks decide to entertain sweepstakes for Giannis Antetokounmpo. One of the few assets the Heat can offer in return is Herro, a 26-year-old, one-time All-Star and former Sixth Man of the Year. He is owed $33 million in 2026-27. How enticing that is to a team trading a superstar is in question. 12. LaMelo Ball, Charlotte Hornets“Ball has grown increasingly frustrated with the organization and is open to a trade away from the franchise,” according to Yahoo Sports’ Kelly Iko. Of course, Ball denied this publicly, saying, “The source wasn’t me, so it’s false info,” though reports ever since have maintained that rival executives are operating under the assumption that Ball is available. Does anyone want him?11. Darius Garland, Cleveland CavaliersAs is the case with Allen in the frontcourt, there is a logjam in Cleveland’s backcourt, where Donovan Mitchell is the premier option. Garland’s impact is somewhat redundant, and the Cavs might be looking to make better sense of their roster. For those interested, though, Substack’s Jake Fischer insists, “I just haven’t heard any credible rumblings about Garland’s availability.”10. Austin Reaves, Los Angeles LakersCredit Lakers superstar LeBron James’ agent, Rich Paul, for entering Reaves’ name into the trade discussion, as he proposed a swap of the Lakers’ 27-year-old guard for Jaren Jackson Jr. Paul is not wrong, either, as Reaves could be owed a near-max contract at season’s end, and any quest for a star partner to James and Luka Dončić would require Reaves’ services in return. 9. Domantas Sabonis, Sacramento KingsAgain: No secret has been made about the availability of Sabonis, LaVine and DeRozan. The Kings are looking to mix things up, once again, and if it costs them their best players, so be it. It is not like Sacramento is winning anything as currently constituted. And Sabonis is capable of a triple-double on any given night, although his defense might dissuade most potential suitors.8. Zion Williamson, New Orleans PelicansWilliamson is among the names the Pelicans have been unwilling to shop, Haynes reported, though he may be the most likely of New Orleans’ targets to be traded, per The Athletic’s William Guillory. The Wizards are reportedly on the list of teams that could be interested at the right price. The right price for the oft-injured forward, though, may not be what the Pels want.7. Ja Morant, Memphis Grizzlies“Everybody in here who knows me, knows I’m a very loyal guy,” insisted Morant. “I got a logo on my back, and that should tell you where I want to be.” Of course, based on everything else we have heard, Morant no longer wants to be on the Grizzlies, and they no longer want him, either. As anticipated, multiple suitors have emerged for Morant, including Miami, though at what cost?6. Trey Murphy III, New Orleans PelicansAnd again: Murphy is among the names New Orleans has been unwilling to discuss. Still, “not completely no on Trey, but a pretty high price tag,” according to The Athletic’s Sam Amick. And it makes complete sense. Murphy (22-6-4 on near 50/40/90 shooting splits) is the exact kind of 3-and-D wing, with the potential for more to his game, that any rival team would want to acquire.5. Michael Porter Jr., Brooklyn NetsIt is unclear how much the Warriors’ reported interest in Porter has changed in the wake of Butler’s injury, as it was even unclear how much Golden State was interested anyhow. Detroit has discussed the idea of dealing for Porter, according to Fischer. We have seen Porter win a title. Surely another contender can convince itself he can help them win, too.4. Jaren Jackson Jr., Memphis GrizzliesAs the market for Morant unfolds, “there’s a growing thought [among rival executives] that Jackson … could be the next domino to fall at some point,” according to Iko. That thought is widely held about the NBA’s 2023 Defensive Player of the Year. What need would Memphis have for Jackson if the franchise is, as reported, seeking a future-focused package for Morant?3. Anthony Davis, Dallas MavericksDavis’ most recent injury muddied the waters of his trade market, as has every injury he has sustained throughout his career. Atlanta and Toronto both appear to still be interested, but “the cost is most certainly going to be lower than it was even a month ago,” per ESPN’s Shams Charania. Which is why it may be in the best interest of Dallas and Davis to keep the status quo.2. Lauri Markkanen, Utah JazzIt was thought a long shot that Markkanen would remain a member of the Jazz, but Utah exec Austin Ainge insisted that the Finnish forward “hopefully is part of our next team when we’re going up.” Keyonte George’s emergence gives Ainge further reason to believe in a come-up, so any trade of Markkanen would surely cost his suitor “an arm and a leg in years of draft capital.” 1. Giannis Antetokounmpo, Milwaukee BucksFunny thing about Giannis. He might want out. “I don’t know,” he said most recently, “I take it day by day.” He should want out, since his Bucks are bound for the lottery. But he does not want to ask out, for fear of alienating the fans in Milwaukee, per Collier. So maybe he will let his agent do his bidding. In which case, the league will line up for his services. This is Giannis, after all.",
    "author": "Ben Rohrbach",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 21:35:05 +0000",
    "ingested_at": "2026-01-20T22:14:53.737562Z"
  },
  {
    "guid": "6214ba23-50d3-4141-9a40-5a7be099b523",
    "title": "Warriors in trouble without Jimmy Butler, All-Star + Awards Talk",
    "link": "https://sports.yahoo.com/nba/article/warriors-in-trouble-without-jimmy-butler-all-star--awards-talk-210235750.html",
    "description": "Nekias Duncan and Steve Jones discuss the unfortunate season-ending injury to Jimmy Butler, and the ramifications that may have on the Warriors and Jonathan Kuminga.",
    "content_html": "Subscribe to The Dunker SpotApple Podcasts | Spotify | YouTubeWe have a fun episode of The Dunker Spot coming your way!Nekias Duncan and Steve Jones discuss the unfortunate season-ending injury to Jimmy Butler, and the ramifications that may have on the Warriors and Jonathan Kuminga.From there, the guys react to the All-Star starters for each conference* being announced, then try their hands at predicting who the coaches will select as reserves. Finally, they react to this most recent weekend of Unrivaled basketball.If you ever have NBA or WNBA questions, email us at dunkerspot@yahoo.com.1:47 -- Jimmy Butler out for season15:28 -- All-Star starters announced38:44 -- MVP discussion56:42 -- All-NBA discussion1:10:45 -- Unrivaled takeaways from the weekendSAN FRANCISCO, CALIFORNIA - JANUARY 13: Jimmy Butler III #10 of the Golden State Warriors looks on against the Portland Trail Blazers in the second half of an NBA basketball game at Chase Center on January 13, 2026 in San Francisco, California. (Photo by Thearon W. Henderson/Getty Images)\n\nThearon W. Henderson🖥️ Watch this full episode on the Yahoo Sports NBA YouTube channelCheck out the rest of the Yahoo Sports podcast family at https://apple.co/3zEuTQj or at yahoosports.tv",
    "author": "Nekias Duncan,Steve Jones",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 21:02:35 +0000",
    "ingested_at": "2026-01-20T21:14:12.931115Z"
  },
  {
    "guid": "31aeba1d-e004-4fb3-9a39-4e52dc0306cb",
    "title": "2025-26 NBA Midseason Awards: MVP, Rookie of the Year and Most Improved Player at the halfway mark",
    "link": "https://sports.yahoo.com/nba/article/2025-26-nba-midseason-awards-mvp-rookie-of-the-year-and-most-improved-player-at-the-halfway-mark-203732942.html",
    "description": "With every team hitting the 41-game mark, let’s hand out midseason awards.",
    "content_html": "Who has been the MVP of the league at the season’s halfway point? Who’s winning the Rookie of the Year race? With every team hitting the 41-game mark, let’s hand out midseason awards.Midseason Most Valuable PlayerMidseason Rookie of the YearMidseason Coach of the YearMidseason Defensive Player of the YearMidseason Sixth Man of the YearMidseason Most Improved Player(Mallory Bielecki/Yahoo Sports Illustration)The Midseason MVP is ...Dan Devine: Shai Gilgeous-Alexander, Thunder, for many of the same reasons he won last year. Take your pick: the best player on the best team; historically elite individual production that lines up pretty neatly next to Michael Jordan; the driving force behind what profiles as one of the greatest teams of all time; the primary reason OKC has a 5.5-game lead on the rest of the West; the most valuable clutch contributor in the league; first or second in nearly every advanced stat known to NBA nerdkind; and has played 10 more games and about 300 more minutes than Nikola Jokić. It’s a pretty strong damn case.Tom Haberstroh: Shai Gilgeous-Alexander. Injuries to the other four major candidates — Nikola Jokić, Giannis Antetokounmpo, Luka Dončić and Victor Wembanyama — have paved the way for the reigning MVP to repeat. I think Cade Cunningham could make a late-season push, but it’s Gilgeous-Alexander’s award to lose. He’s the best player on the best team and has established himself as the game’s top clutch assassin, scoring a league-high 122 points with the score within five points in the final five minutes.Steve Jones: Shai Gilgeous-Alexander. The debate will rage on down the stretch, but with an injury to Jokić, the Bucks fighting to get into the play-in and the Lakers slipping down the Western Conference standings, it feels like it’s clearly Gilgeous-Alexander. The consistency he’s brought on the offensive end has continued to power the Thunder to the top of the standings. It will be intriguing to see how hard Cunningham, Wembanyama and Jaylen Brown start to knock on the door. Morten Stig Jensen: Nikola Jokić, Nuggets. Gilgeous-Alexander has played in 10 more games so far, but that advantage isn't quite enough, in my eyes, to overtake Jokić's season. That will change, however, should Joker miss a significant portion of games throughout the rest of the season. If not by him becoming ineligible, then because Gilgeous-Alexander is playing so well that a games-played gap justifies him. Kelly Iko: Shai Gilgeous-Alexander. The Joker can miss only six more games before he’s ineligible due to the 65-game rule — and Cunningham would have a decent argument in any other season (26/10/6 on a team that should win 65 games) — but it’s SGA’s to lose. He’s averaging the highest points per shot attempt of any guard over the past decade (only Steph Curry comes close), OKC has a bottom-five offense without him, and his latest trick — dragging a Thunder team down its starting center and second-leading scorer across the finish line with the NBA’s best record — should be the icing on the cake. The Midseason Rookie of the Year is ...Iko: Cooper Flagg, Mavericks. He still has a ways to go in the efficiency department, but we’re talking about a 19-year-old posting 19/6/4 on a middling Mavericks team. That Dallas is within striking distance of the play-in is remarkable. Flagg has been asked to initiate offense, finish possessions, and defend multiple positions — and he’s taken those challenges with confidence. He’ll need to get to a point where he’s not a sub-30% 3-point shooter, but he’s done enough this season to warrant the award. Kon Knueppel has been awesome, though. Haberstroh: Kon Knueppel, Hornets. What a revelation. Think Klay Thompson or Khris Middleton — but with a higher ceiling. He’s a year and a half older than his former Duke mate Cooper Flagg, so in a sense it’s not too surprising that Knueppel has been more NBA-ready than the No. 1 overall pick. The Hornets found their franchise cornerstone.Devine: Kon Knueppel. He leads the rookie class in scoring on pretty shocking shooting efficiency — 56% on 2s, 43.5% on 3s, 89.4% at the charity stripe. As impressive, in my eyes: The 20-year-old has more than kept the Hornets afloat even in the significant amount of floor time he’s played without load-bearing offensive pieces LaMelo Ball and Brandon Miller. Flagg’s been largely fantastic in a tough set of circumstances in Dallas; ditto for Cedric Coward in Memphis; and VJ Edgecombe has fit brilliantly in in Philly. But Knueppel’s walked into the NBA shooting like an all-time-great marksman, and helped elevate the Hornets to within arm’s reach of the play-in tournament.Jones: Cooper Flagg. It’s hard to ignore the corner Flagg has turned this season and the consistent aggression and confidence he’s brought to the table. Despite the tough start, Flagg leads the Mavericks in total points, rebounds, assists and steals, which speaks to his responsibility on a nightly basis. Flagg has a great feel for when and how to get to his spots. And while Kon Knueppel has been great, Flagg has overcome his circumstances to impact the game every night. Jensen: Cooper Flagg, by a freaking hair. This one is far from over, folks. We have a legit Rookie of the Year race on our hands between Flagg and Knueppel, who looks as if he's going to be one of the league's primary shooters for the next decade-plus. Every ROY race is welcome around these parts, so the fact that we aren't seeing someone run away with this thing yet is extremely enticing. [Subscribe to Yahoo Sports NBA on YouTube]The Midseason Coach of the Year is ...Jones: J.B. Bickerstaff, Pistons. One of the more underrated skills for a coach to have is to understand the talent you have, maximize it and get the entire roster to buy in. Bickerstaff has been able to do that, keeping Detroit at the top of the East. The great play of Cunningham is one thing, the growth of Jalen Duren is another, but when you go through the roster you see an identity where everyone contributes. This team defends and believes every night, and whatever expectation you had has been exceeded to this point. Jensen: Mitch Johnson, Spurs. Victor Wembanyama has been in and out of the lineup, and Johnson is relying heavily on a three-guard rotation consisting primarily of players who aren't strong natural shooters. Devin Vassell has also missed time, and when he's played his influence has been somewhat average. Yet the Spurs are winning despite all of that. This group has fully embraced a team-first mentality, and that doesn't happen without a high level of quality in the leadership department. Devine: Jordan Ott, Suns. Everyone’s on their best behavior at media day: swearing that it’s going to develop a culture of relentlessness competitiveness that hinges on accountability and the non-negotiability of playing hard. Everyone says that stuff. The Suns are actually doing it, though — eighth in points allowed per possession, second in steals, third in deflections, tied for fourth in loose balls recovered, fifth in offensive rebound rate, sixth in how frequently they dial up full-court pressure, etc. — and they’re reaping the benefits, sitting at 26-17. The Suns needed a full-tilt spiritual reset in the worst way; Ott has brought it from Day 1.Iko: Mitch Johnson. The Suns have been a revelation and Ott has been at its epicenter, but what Johnson has done is simply too incredible to downplay. I was present when Johnson was introduced by Gregg Popovich and outlined his plan to improve the Spurs on both sides of the ball. The results are clear: They are eighth in offense, third in defense, fifth in rebounding and turnover rate and, more importantly, have learned to play without Wembanyama. The improvement of Stephon Castle, Keldon Johnson’s shapeshifting ability and Dylan Harper’s development all have Johnson’s fingerprints on them as well. Haberstroh: Mitch Johnson. San Antonio hasn’t had the full complement of Victor Wembanyama, De’Aaron Fox, Stephon Castle and Dylan Harper for half the season and yet it’s emerged as the second-best team in the loaded West. The first-year head coach has pulled all the right levers and scoffs at your NBA Cup hangover talk.The Midseason Defensive Player of the Year is ...Jensen: Victor Wembanyama. Dear NBA, the games played requirement for awards is officially nuts if Wemby goes his third straight season without winning DPOY, which in about 15 years should probably be named after him. The 7-foot-5 dynamo takes away everything. Shots at the rim, passing in the midrange area, corner 3-pointers, and everything in-between. His athleticism, length, and defensive IQ are all off the charts, and virtually all of his opponents rave about him after games. Come on now. Jones: Victor Wembanyama. His impact on the defensive end of the floor is a massive reason why the Spurs have been able to hang near the top of the Western Conference. A consistent presence in the paint, his weakside help consistently forces offenses to make decisions night in and night out. It’s not just his ability to erase space, rotate or protect the paint, it’s the communication and awareness to ensure he’s consistently in the right spot at the right time.  Haberstroh: Victor Wembanyama. I love that he and Chet Holmgren are going toe-to-toe — or fingertip-to-fingertip — for this award. The edge goes to Wemby for me because this is an individual award. The Thunder defense is elite no matter who steps on the floor. Wemby is the sole reason why the Spurs have a top-five defense in the NBA.Iko: Victor Wembanyama.There is no other player that alters opponents’ offensive game plans more aggressively than him. He’s the reason why the Spurs’ defense is menacing. Teams take the most shots from the perimeter and fewest at the rim when he’s on the floor (I wonder why that is), and don’t even think about getting easy baskets in transition. Devine: Victor Wembanyama. Just 45.4% of Spurs opponents’ shot attempts come in the paint when Wembanyama is on the floor; they convert those shots at league-worst levels when he’s out there. The Spurs allow a microscopic 105.8 points per 100 possessions in his floor time, and 117.4 points-per-100 without him; he is, in effect, the difference between San Antonio defending like the Thunder and defending like the Pacers. There are other reasonable answers — Rudy Gobert in Minnesota, Holmgren in OKC — but to me, the most obvious answer feels like the right one.The Midseason Sixth Man of the Year is ...Iko: Keldon Johnson, Spurs. He is the current favorite to win the award, according to BetMGM, but aside from that, let’s talk about the seventh-year guy who’s had to embody a different role nearly every season. He’s shooting a career-best from 3 (42%) and from 2 (63.3%); he’s among the upper echelon in rebounding rate; and he’s simplified his approach to basketball and seen it pay ultimate dividends for the Spurs. This just feels like a San Antonio year. Haberstroh: Jaime Jaquez Jr., Heat. The NBA leaders in points in the paint are a bunch of All-Stars with the exception of one bench player: Jaquez. The UCLA product has bounced back after a dreadful sophomore slump, nearly averaging 15-5-5 off the bench for a winning team in Miami.Devine: Isaiah Stewart, Pistons. You can just stuff your instant-offense guards and wings in a sack, Mister. Beef Stew is an all-around physical menace who leads the NBA in defensive field goal percentage allowed at the rim, who has turned himself into a credible frontcourt floor-spacer (36% from 3-point range) while also having the best interior finishing season of his career, and who has played a massive role in Detroit’s rise to second in the league in defensive efficiency and the top spot in the East. Stewart makes his impact differently than the kind of high-scoring ball-handlers who typically get this award, but that doesn’t mean the impact he makes is any less forceful, vital or worthy of recognition.Jensen: Keldon Johnson. This guy used to average 22 points per game, but has totally rebranded himself as a complete buy-in guy who does whatever is asked of him. He's rebounding better than ever, taking more shots from around the rim, and moving the ball with intent, all while coming off the bench and embracing his own role. It's a major success story for both him and the Spurs. Jones: Jaime Jaquez Jr. There are a variety of bench players who have really impacted their teams, so this could get even more interesting in the second half of the season. As of now, I salute Jaquez for how he’s helped lift Miami’s offensive attack. A shift to more spacing, more drive-and-kick and more cutting has been helped by Jaquez’s consistent ability to get into the paint and not only finish but showcase improved decision-making. The Midseason Most Improved Player is ...Iko: Deni Avdija, Trail Blazers. It’s hilarious to recall Avdija was the throw-in piece in the Malcolm Brogdon deal; this is a man averaging a stunning 30/7/7 since the calendar flipped to 2026. How do you argue against a fellow who’s been trusted with carrying Portland’s entire offense on his shoulders all while keeping the Blazers in the thick of the play-in? Look no further than the home-and-home against the Rockets for a microcosm of how important Avdija is to winning basketball. Sometimes all you need is a push. Or a trade away from the Wizards. Jones: Nickeil Alexander-Walker, Hawks. There is always a debate on what exactly this award should mean, and there are a lot of names that could be added to the list. There is a world where people point to Jalen Johnson, Jalen Duren and Dillon Brooks for their contributions. Keyonte George, Collin Gillespie and Anthony Black have consistently turned heads. I point to Alexander-Walker. Opportunity is everything, but to go from averaging single digits to 20 points a night is not easy. Haberstroh: Deni Avdija. The Blazers have missed more games due to injury than any team in the NBA, and yet they’re .500 in the West. It’s all because of Avdija, who’s now one of three players to average at least 25 points, six rebounds and six assists this season. It’s him, Luka Dončić and Nikola Jokić. His first All-Star is coming any day now. If he keeps this up — every value metric has him as a top-15 player this season — so should his first All-NBA appearance.Devine: Keyonte George, Jazz. This time last year, George was shooting under 40% from the floor with a too-high-for-a-lead-guard turnover rate while profiling as one of the NBA’s worst defenders. Now, he’s averaging 24 points, 7 assists and 4 rebounds per game, looking like a completely different, more composed and more aggressive offensive player. (He’s even showing — slightly — improved block and steal rates.) Reasonable arguments can be made for making-the-All-Star-leap dudes like Avdija and Duren; here, though, I’ll shout out someone who looked like he might be circling the drain on his way to being out of the league, but has done the work to climb back into consideration as a cornerstone for his franchise.Jensen: Nickeil Alexander-Walker.It's between Avdija, George, and Alexander-Walker for me. I lean toward Alexander-Walker because of that surprise factor. We saw Avdija wrap up 2024-25 on a high note, so this doesn't register as a major surprise. However, George is playing out of his mind, and if Utah had been just a slightly better team, I might have rewarded him for that. There's still time, though.",
    "author": "Yahoo Sports Staff",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 20:37:32 +0000",
    "ingested_at": "2026-01-20T21:14:12.932664Z"
  },
  {
    "guid": "c224b3f0-2111-43fc-bfe7-9ba7e23beb7b",
    "title": "2026 NBA Finals to begin June 3 with no Sunday games scheduled",
    "link": "https://sports.yahoo.com/nba/article/2026-nba-finals-to-begin-june-3-with-no-sunday-games-scheduled-182228810.html",
    "description": "A potential Game 7 would be played on Friday, June 19",
    "content_html": "The 2026 NBA Finals will begin on Wednesday, June 3 and end on Friday, June 19, should the title need seven games to be decided.According to Sports Media Watch, this will be the first NBA Finals since 1970 to not have a game scheduled for a Sunday. Typically, the league's final playoff series of the season has begun on a Thursday and ended on a Sunday if a Game 7 was necessary. There is also the potential uniqueness of an NBA Finals game airing on a Saturday night (Game 5), something that has only happened once since 1981.2026 NBA Finals scheduleGame 1: Wednesday, June 3Game 2: Friday, June 5Game 3: Monday, June 8Game 4: Wednesday, June 10*Game 5: Saturday, June 13*Game 6: Tuesday, June 16*Game 7: Friday, June 19*if necessary(all games begin at 8:30 p.m. ET on ABC)There are two factors playing into how the NBA and ABC devised the schedule for this year. First, ABC is also airing the Stanley Cup Final, which will take place around the same time. Then you have the World Cup, which begins on June 11 and sees the United States begin its tournament on June 12 at 9 p.m. ET in Los Angeles. The second group game for the USMNT is a week later on Friday, June 19 at 3 p.m. ET in Seattle, hours before a potential Game 7.Since 2017 and 2018 when the Golden State Warriors went back-to-back, the NBA has seen seven different champions. Last season, the Oklahoma City Thunder topped the Indiana Pacers in first seven-game NBA Finals since 2016.As of Tuesday, the Thunder remain on top of the NBA with a 36-8 record. Behind them in the overall standings is the 31-10 Detroit Pistons and the 30-13 San Antonio Spurs.",
    "author": "Sean Leahy",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 18:22:28 +0000",
    "ingested_at": "2026-01-20T18:36:37.777869Z"
  },
  {
    "guid": "ac16fe41-4e1c-449a-9675-8ed28dccd0f3",
    "title": "Warriors&#39; Jimmy Butler helped off court with knee injury, unable to put weight on right leg",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/warriors-jimmy-butler-helped-off-court-with-knee-injury-unable-to-put-weight-on-right-leg-044425420.html",
    "description": "Butler was unable to put weight on his right foot as he made his way to the tunnel with the help of two teammates.",
    "content_html": "Jimmy Butler left Monday's Warriors-Heat game with a knee injury.Lachlan Cunningham via Getty ImagesGolden State Warriors forward Jimmy Butler left Monday's game against the Miami Heat with a knee injury that left him in significant pain and in need of help off the court.The injury took place in the third quarter after Butler caught a contested pass in the paint. Butler landed awkwardly on his right leg and fell to the ground after contact from Davion Mitchell that drew a foul. Butler writhed on the court and clutched his right knee after sustaining the injury. Warriors coach Steve Kerr called a timeout to check on Butler as Butler screamed in pain on the baseline.Prayers up for Jimmy Butler 🙏🙏 pic.twitter.com/0RrwwWkf8w— SleeperHoops (@Sleeper_Hoops) January 20, 2026Butler eventually left the court with the help of two teammates. He was unable to put weight on his right foot as he made his way to the tunnel. Jimmy Butler can’t put weight on his right knee. Buddy Hield and Jonathan Kuminga helping him to the locker room after a concerning scene in Chase Center. pic.twitter.com/4uSCuzXgEk— Anthony Slater (@anthonyVslater) January 20, 2026The Warriors announced after his exit that Butler was ruled out for the game with a right knee injury. The nature and severity of the injury weren't initially clear. Big blow for Butler, WarriorsButler, a five-time All-NBA selection, is in his second season with the Warriors following a midseason trade from the Heat in 2024-25. The Warriors acquired Butler in an effort to compete for another championship on the back end of Stephen Curry's prime. Butler's maintained his high level of play at 36 years old. In 37 games before Monday's, Butler was averaging 20.1 points, 5.6 rebounds, 4.9 assists and 1.4 steals per game while shooting 51.9% from the field and 38.1% from 3. Curry, meanwhile, is averaging 27.6 points per game and leads the league for an 11th time with 4.5 made 3s per game on 38.6% shooting. He was named an All-Star starter earlier Monday.With Butler and Curry leading the team, the Warriors entered Monday's game at 24-19, good for eighth place the Western Conference. A significant injury to Butler would project to end any previous long-shot hope of Golden State competing in the West.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 04:44:25 +0000",
    "ingested_at": "2026-01-20T05:22:24.846133Z"
  },
  {
    "guid": "a2ea111c-f40b-4604-8b13-af7c01c9ab73",
    "title": "Jalen Brunson, Karl-Anthony Towns respond to boos at MSG after skidding Knicks lose ugly to Mavs: &#39;I&#39;d be booing us too&#39;",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/jalen-brunson-karl-anthony-towns-respond-to-boos-at-msg-after-skidding-knicks-lose-ugly-to-mavs-id-be-booing-us-too-031512112.html",
    "description": "The Knicks are 2-9 in their last 11 games, and Knicks fans are fed up.",
    "content_html": "A New York Knicks skid reached what fans can only hope is its nadir Monday in a blowout loss to the hapless Dallas Mavericks at home. This once again — and repeatedly — led to boos from the crowd at Madison Square Garden. This time, the boos started in the second quarter after the Mavericks built a 49-31 lead. The Knicks previously heard boos from the home crowd in Saturday's 106-99 loss to the Phoenix Suns. For the second straight night the Knicks hear loud boos from the MSG crowd. pic.twitter.com/EhWBDKCios— KNICKS BEAST (@KnicksBeast) January 19, 2026The Knicks did not respond well to Monday's boos. The Mavericks remained in control of the game en route to a 114-97 win to improve to 18-26, good for 12th place in the West.The loss for the Knicks was their ninth in 11 games. The slump has dropped them from a 23-9 start to 25-18. That's good enough for third place in the East. But the Knicks are now as close in the standings to the 11th-place Milwaukee Bucks as they are to the first-place Detroit Pistons. And they entered Monday two games behind the much-loathed Boston Celtics.Jalen Brunson: 'I'd be booing us too'All-Stars Jalen Brunson and Karl-Anthony Towns both heard the boos — obviously. And they understand. Brunson finished Monday with 22 points and 6 assists. But he struggled from the field in a 9-of-22 shooting effort. He was asked about the boos at his locker room postgame.\"I'd be booing us too,\" Brunson said. \"Straight up.\"\"I'd be booing us too. Straight up\"- Jalen Brunson on the boos at MSG pic.twitter.com/XtnkiHkqOT— Knicks Videos (@sny_knicks) January 20, 2026Towns posted the best effort by a Knick with 22 points and 18 rebounds, but he committed at team-high 5 turnovers. And he's posted a few duds of his own during the slump, including a 6-point, 1-rebound effort in a 121-90 loss to the Pistons on Jan. 5.Like Brunson, he understands the boos. And he put himself in the perspective of a fan paying to attend Monday's Martin Luther King Jr. Day matinee. Karl-Anthony Towns on the boos at MSG directed at him and the team\"You spend $140 to represent your favorite player with a jersey. You come to MLK Day here at The Garden and tickets are 3x the price. I'd be disappointed too\" pic.twitter.com/vrTAznt1mV— Knicks Videos (@sny_knicks) January 20, 2026\"You come, you spend, what $140 bucks to represent your favorite player with a jersey?\" Towns said. \"And you come to MLK Day here at the Garden and tickets are twice, three times the price?\"And to come here and spend your hard-earned money, money that you've saved up to bring your family to this game and for us to come here and obviously, not only [not] win — which is disappointing — but not really have a chance. I'd be disappointed too.\"The fans who spend their hard-earned money, they give us so much love and motivation to go out there. They expect the results. And so do we. The fans are doing their part. And we've got to do our part.\"If there's any solace for frustrated Knicks fans, it's that those are the exact kind of responses you want to hear from star players who just got booed off their home court for another poor showing. But that won't stop the boos. Only winning will.",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 03:15:12 +0000",
    "ingested_at": "2026-01-20T03:27:07.674959Z"
  },
  {
    "guid": "f857d0fb-a839-416b-b231-a96e44591282",
    "title": "Thunder&#39;s Jalen Williams out a &#39;couple weeks&#39; with right hamstring strain",
    "link": "https://sports.yahoo.com/nba/article/thunders-jalen-williams-out-a-couple-weeks-with-right-hamstring-strain-211608580.html",
    "description": "Jalen Williams missed the first month of the season recovering from a wrist injury, too.",
    "content_html": "<iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://sports.yahoo.com/videos/williams-return-timeline-impact-okc-190831697.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports\" width=\"640\" height=\"360\" sandbox=\"allow-same-origin allow-scripts\" data-yom-embed-source=\"{media_id_1:809d23e1-e036-3f58-a343-e6309110c453}\" data-yahoo-uuid=\"809d23e1-e036-3f58-a343-e6309110c453\"></iframe><p>Oklahoma City Thunder forward Jalen Williams is sidelined yet again.</p><p>Williams will miss at least “a couple of weeks” due to a right hamstring strain, the franchise announced on Monday. He first went down in the second quarter of their loss to the Miami Heat on Saturday, and was spotted grabbing his right hamstring as he limped off the court.&nbsp;</p><p>The team initially said he had right thigh soreness, but confirmed Monday that it was his hamstring.&nbsp;</p><div><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Jalen Williams is headed to the locker room after grabbing at his hamstring 😬 <a href=\"https://t.co/OdBJL04iPT\">pic.twitter.com/OdBJL04iPT</a></p>— Heat Central (@HeatCulture13) <a href=\"https://twitter.com/HeatCulture13/status/2012706433234522546?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p>If Williams is just out for two weeks, he could return in early February and miss only seven games — including Monday’s 136-104 win over the Cleveland Cavaliers.</p><blockquote><p>&quot;I always feel bad for guys,” Thunder coach Mark Diagneault said on Monday, <a target=\"_blank\" class=\"link\" href=\"https://x.com/Justintohoops/status/2013318796337881446?s=20\" data-i13n=\"cpos:1;pos:1\">via The Oklahoman’s Justin Martinez</a>. “This is their life, and they put so much work into it. In his case, he put so much work into getting back to the court. ... It sucks, but you&#39;ve got to play the ball where it is. That&#39;s what he&#39;s going to do. He&#39;s going to put one foot in front of the other and attack the return to play, as he&#39;s always done.&quot;</p></blockquote><p><core-module type=\"curatedLinks\" title=\"More NBA news\" headerlink=\"\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"></core-module></p><p></p><p>Williams, who earned All-Star honors last season while helping the Thunder to their NBA Finals win, has averaged 16.8 points, 5.6 assists and 4.8 rebounds per game this season. He missed the first month of the season while recovering from wrist surgery he underwent during the offseason.&nbsp;</p><p>The Thunder now hold a 36-8 record after Monday’s contest at Rocket Arena, which they led nearly the entire way before outscoring the Cavaliers by 20 points in the fourth quarter. Shai Gilgeous-Alexander led the way with 30 points, and the team shot 56% from the field. They’ve now won six of their last seven games, and hold the best record in the league.</p><p>The Thunder entered Monday’s contest at Rocket Arena with a 35-8 record, which is the best in the league. Their loss to the Heat snapped a five-game win streak, too.</p>",
    "author": "Ryan Young",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:16:08 +0000",
    "ingested_at": "2026-01-20T01:44:07.021463Z"
  },
  {
    "guid": "7e00b8f9-4b72-4247-82d8-4323d3338bca",
    "title": "Cooper Flagg returns from ankle injury, helps Mavericks to blowout win over Knicks at Madison Square Garden",
    "link": "https://sports.yahoo.com/nba/article/cooper-flagg-returns-from-ankle-injury-helps-mavericks-to-blowout-win-over-knicks-at-madison-square-garden-003910165.html",
    "description": "Cooper Flagg missed the last two games for the Mavericks after rolling his left ankle.",
    "content_html": "<figure><img src=\"https://d29szjachogqwa.cloudfront.net/images/2026-01/1526bfc9-da2b-46e6-a018-9fa73baaf2ea\" data-crop-orig-src=\"https://d29szjachogqwa.cloudfront.net/images/2026-01/1526bfc9-da2b-46e6-a018-9fa73baaf2ea\" style=\"height:1923px;width:2884px;\" alt=\"Dallas Mavericks&#39; Cooper Flagg yells during the first half of an NBA basketball game against the New York Knicks, Monday, Jan. 19, 2026, in New York. (AP Photo/Pamela Smith)\" data-uuid=\"871e5681-e3ea-3f88-a921-ef4a174ff982\"/><figcaption>Dallas Mavericks rookie Cooper Flagg returned from a two-game absence after an ankle injury on Monday. (AP/Pamela Smith)</figcaption><div class=\"photo-credit\">ASSOCIATED PRESS</div></figure><p>Cooper Flagg’s ankle appears to be just fine.</p><p>The Dallas Mavericks rookie returned to the court on Monday afternoon after missing a pair of games with a left ankle injury. Flagg picked up right where he left off, and helped lead the Mavericks to a blowout 114-97 win over the New York Knicks at Madison Square Garden.</p><p>Flagg went down with a left foot injury in last week’s win over the Brooklyn Nets, but then he left the team’s loss to the Denver Nuggets on Wednesday after awkwardly landing on his left foot midway through the second quarter.&nbsp;</p><p><a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/breaking-news/article/cooper-flagg-leaves-mavericks-loss-to-nuggets-with-sprained-ankle-063817227.html\" data-i13n=\"cpos:1;pos:1\">Flagg stepped on someone’s foot</a>, Kidd said after that contest, and he didn’t return in the second half.&nbsp;</p><p>Flagg missed two games as a result, both of which ended up being blowout wins over the Utah Jazz. He was considered questionable to play in Monday afternoon’s game with the Knicks — part of the NBA’s MLK Day slate — but was cleared after going through pregame warmups.&nbsp;</p><p>Flagg entered halftime with 13 points, all but two of which came in the second quarter. He shot an impressive 6-of-8 from the field, and seemed perfectly fine with his ankle. Flagg attacked Karl-Anthony Towns in the lane and easily hit a fadeaway jumper over him for the first points of the game.&nbsp;</p><div><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Coop wasting no time 😮‍💨<br><br>📺: KFAA &amp; NBC <a href=\"https://t.co/cNwS8r3gQS\">pic.twitter.com/cNwS8r3gQS</a></p>— Dallas Mavericks (@dallasmavs) <a href=\"https://twitter.com/dallasmavs/status/2013378155080192082?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>But it was Max Christie who sent the Mavericks into the locker room with a massive 28-point lead. Christie had 18 points at the break on six 3-pointers, just more than half of what the rest of the Mavericks made from behind the arc in the first 24 minutes. The Knicks, on the other hand, went just 3-of-16 from the 3-point line in the first half.&nbsp;</p><p>That lead proved to be too much for the Knicks to rally from. Dallas pushed its lead to 30 points briefly before hanging on to secure the 17-point win. It withstood a late 10-2 run in the fourth quarter, which briefly cut the deficit to just 15 points, to pull it off. </p><p><core-module type=\"curatedLinks\" title=\"More NBA news\" headerlink=\"\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"></core-module></p><p>Karl-Anthony Towns led the Knicks with 22 points and 18 rebounds. Jalen Brunson added 20 points and seven assists, too. They were the only starters to hit double figures for New York, though Mitchell Robinson finished with 12 points and 15 rebounds off the bench. The loss was the fourth straight for the Knicks, who fell to 25-18 on the season. They’ve lost nine of their last 11 games.&nbsp;</p><p>Christie finished with 26 points and six rebounds, and went 8-of-10 from behind the arc. That tied the Mavericks’ franchise record for most made 3-pointers at Madison Square Garden. Flagg ended up with 18 points, 7 rebounds and 3 assists. Naji Marshall finished with 19 points and eight rebounds.</p><p>The Mavericks have now won four of their last five, and hold an 18-26 record. They’ll return home to Dallas to host both the Golden State Warriors and Los Angeles Lakers later this week.&nbsp;</p>",
    "author": "Ryan Young",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Tue, 20 Jan 2026 00:39:10 +0000",
    "ingested_at": "2026-01-20T01:01:37.660177Z"
  },
  {
    "guid": "512fad8f-2e63-4202-a299-f56e29da360b",
    "title": "Hawks&#39; Kristaps Porziņģis and Zaccharie Risacher sidelined another week recovering from injuries",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/hawks-kristaps-porzingis-and-zaccharie-risacher-sidelined-another-week-recovering-from-injuries-220603467.html",
    "description": "Atlanta Hawks center Kristaps Porzingis and forward Zaccharie Risacher will both miss another week on the court while recovering from injuries.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/atlanta-hawks-vs-milwaukee-bucks-204716777.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:fb949559-91da-3a1a-8cab-9c67f492edc7}\" data-yahoo-uuid=\"fb949559-91da-3a1a-8cab-9c67f492edc7\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"129da95f2c5c4505873f830813dde125\"></iframe><p>Atlanta Hawks center Kristaps Porzingis and forward Zaccharie Risacher will both miss another week on the court while recovering from injuries.&nbsp;</p><div id=\"27143d7cb30147ae80507c3922ebe224\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An <a href=\"https://twitter.com/emoryhealthcare?ref_src=twsrc%5Etfw\">@emoryhealthcare</a> injury update: <br><br>Center Kristaps Porzingis, who has missed the last five games due to left Achilles tendinitis, is progressing in his recovery and will be re-evaluated in approximately one week.<br><br>Forward Zaccharie Risacher, who has missed the last five games… <a href=\"https://t.co/Jdex4k3gAp\">pic.twitter.com/Jdex4k3gAp</a></p>— Atlanta Hawks (@ATLHawks) <a href=\"https://twitter.com/ATLHawks/status/2013273064448962798?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>Porzingis <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/articles/could-hawks-trade-porzingis-warriors-201322117.html\">missed his sixth consecutive game on Monday</a> when the Hawks faced the Milwaukee Bucks in Atlanta. The Bucks held on for the win down the stretch, 112-110. This <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/videos/atlanta-hawks-vs-milwaukee-bucks-204716777.html\">was Atlanta’s fourth loss in a row</a>. Porzingis has been sidelined with tendinitis in his left Achilles in yet another injury-riddled season.</p><p>Once referred to affectionately as “The Unicorn,” Porzingis has been plagued by injury throughout most of his NBA career. He played in 72 games during his rookie campaign of 2015-16 with the New York Knicks and was named to the NBA All-Rookie team. Since that first year, Porzingis hasn’t played in more than 66 games in a season. Porzingis did that in his second season and wouldn’t come close again until the 2022-23 season in Washington.</p><p>Second-year player Risacher missed his sixth straight game on Monday because of a bone contusion in his left knee. Risacher was the No. 1 overall pick in the 2024 NBA Draft and finished second in Rookie of the Year voting last year. This season, he’s appeared in 36 games, averaging 11.2 points and 3.3 rebounds per game.&nbsp;</p><p id=\"3b7993e8bed645339c5d9c634e138d42\"><core-module id=\"3b7993e8bed645339c5d9c634e138d42\" type=\"curatedLinks\" title=\"More NBA News\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>Both players will be re-evaluated sometime next week. Porzingis has suited up for just 17 games for Atlanta this season after being acquired from the Boston Celtics during the offseason. When Porzingis has been on the court, he’s been productive this year, averaging 17.1 points and 5.1 rebounds while shooting 36% from 3-point range.</p><p>The Hawks are in 10th place in the Eastern Conference with a 20-25 record, clinging to the final play-in tournament slot.</p>",
    "author": "Criss Partee",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 22:06:03 +0000",
    "ingested_at": "2026-01-19T22:48:25.004697Z"
  },
  {
    "guid": "68c14a73-067d-4082-aafd-4a7ee14c47f9",
    "title": "Hawks doomed by 0-for-21 start from 3 in loss to Bucks",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/hawks-doomed-by-0-for-21-start-from-3-in-loss-to-bucks-211010140.html",
    "description": "Atlanta caught fire from 3 in the second half after its woeful start, but lost when a late desperation heave missed the mark.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/atlanta-hawks-vs-milwaukee-bucks-204551208.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:5baaea00-1556-3bdf-be4f-bcbd0bb5aea8}\" data-yahoo-uuid=\"5baaea00-1556-3bdf-be4f-bcbd0bb5aea8\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"7acb3f42a5ee47a9b2ff798fefa138f6\"></iframe><p>The Atlanta Hawks had a chance at the end on Monday despite an atrocious shooting start from beyond the 3-point arc.&nbsp;</p><p>But a late rally against the Bucks fell short as <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/milwaukee-bucks-atlanta-hawks-2026011901/\">Milwaukee held on for a 112-110 win </a>in a Martin Luther King Jr. matinee in Atlanta.&nbsp;</p><p>It was remarkable that the Hawks were in the game at all after their cold shooting in the first half. The Hawks missed their first 21 attempts from 3 and almost went into halftime without a make from beyond the arc.&nbsp;</p><p>A 3-pointer late in the second quarter by C.J. McCollum ensured that they&#39;d enter the break shooting 1 of 22 from long distance. The Hawks managed just 38 first-half points due to the poor shooting and trailed 54-38 at the break.&nbsp;</p><h2 id=\"jump-link-hawks-catch-fire-from-3-after-halftime-but-rally-falls-short\">Hawks catch fire from 3 after halftime, but rally falls short</h2><p>Thanks largely to Nickeil Alexander-Walker, the Hawks found their stroke from 3 after halftime and finished the game shooting 12 for 42 from long distance, including an 11-of-20 clip in the second half. After missing all seven of his attempts from 3 in the first half, Alexander-Walker finished 7 of 16 for the game en route to a game-high 32 points.</p><p>The Hawks rallied to take a 105-104 lead on a Jalen Johnson 3 with 1:10 remaining. They then had a chance at a game-winning or game-tying shot with the ball and a 112-110 deficit in the final 12 seconds. But McCollum lost control of his dribble as the clock ticked down and forced up a contested heave from the elbow that didn&#39;t have a chance.&nbsp;</p><div id=\"8d49a0e211394880b17cee646e247f14\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CJ McCollum&#39;s potential game-tying jumper is NO GOOD. <br><br>Bucks hold off the rallying Hawks on the road! <a href=\"https://t.co/GJmE62V4Dm\">pic.twitter.com/GJmE62V4Dm</a></p>— NBA (@NBA) <a href=\"https://twitter.com/NBA/status/2013351389259333693?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>In the end, Atlanta&#39;s poor start from 3 dug too big of a hole to overcome.&nbsp;</p><p>While woeful, Atlanta&#39;s poor shooting start didn&#39;t make NBA history. The 2012-13 <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/blogs/nba-ball-dont-lie/nuggets-shoot-0-22-3-pointers-loss-blazers-164622970--nba.html\">Denver Nuggets went an entire game without making a 3 </a>in an 0-for-22 effort.&nbsp;</p><p id=\"767f3cc6294d4ae7a26c115226602985\"><core-module id=\"767f3cc6294d4ae7a26c115226602985\" type=\"curatedLinks\" title=\"More NBA news\" headerLink=\"\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>The Houston Rockets, meanwhile, <a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/rockets-missed-27-consecutive-3-pointers-game-7-new-nba-record-034056767.html\">missed 27 consecutive attempts from 3</a> in a historic Game 7 loss to the Golden State Warriors in the 2018 Western Conference finals.&nbsp;</p><p>So the Hawks escaped ignominious history. But that probably doesn&#39;t make them feel much better about Monday&#39;s game.&nbsp;</p>",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:10:10 +0000",
    "ingested_at": "2026-01-19T22:48:25.004732Z"
  },
  {
    "guid": "5c17e5f2-27cd-4fa6-85ab-dda5f296a522",
    "title": "NBA trade deadline hot topics & unhappy teams with Jason Timpf + NFL Playoffs talk with Justin Boone",
    "link": "https://sports.yahoo.com/nba/article/nba-trade-deadline-hot-topics--unhappy-teams-with-jason-timpf--nfl-playoffs-talk-with-justin-boone-212711945.html",
    "description": "Kevin O&#39;Connor & Jason Timpf talk top NBA trade targets & Justin Boone recaps the NFL divisional round.",
    "content_html": "<p></p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://sports.yahoo.com/video/whos-in-and-whos-out-as-nba-announces-all-star-game-starters-202709042.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports\" width=\"640\" height=\"360\" sandbox=\"allow-same-origin allow-scripts\" data-yom-embed-source=\"{media_id_1:8783025c-efd9-49a8-a248-623f7d69a12b}\" data-yahoo-uuid=\"8783025c-efd9-49a8-a248-623f7d69a12b\"></iframe><div><div><div style=\"left:0;width:100%;height:200px;position:relative;\"><iframe src=\"https://iframely.publishing.yahoo.net/xXNb13vb\" style=\"top:0;left:0;width:100%;height:100%;position:absolute;border:0;\" allowfullscreen data-embed-domain=\"player.simplecast.com\" data-provider-name=\"iframe\"></iframe></div></div></div><h2 id=\"jump-link-subscribe-to-the-kevin-oconnor-show\"><strong>Subscribe to The Kevin O&#39;Connor Show</strong></h2><h2 id=\"jump-link-apple-podcasts--spotify--youtube\"><a target=\"_blank\" class=\"link\" href=\"https://podcasts.apple.com/us/podcast/the-kevin-oconnor-show/id1769225582\" data-i13n=\"cpos:1;pos:1\"><strong>Apple Podcasts</strong></a><strong> |</strong><a target=\"_blank\" class=\"link\" href=\"https://open.spotify.com/show/6Phxh0Ph8yzn7pyuspWWzq\" data-i13n=\"cpos:2;pos:1\"><strong> Spotify</strong></a><strong> |</strong><a target=\"_blank\" class=\"link\" href=\"https://www.youtube.com/playlist?list=PLMBGfmxnWp04mrpA2-K1FVktL6r3fY2Bh\" data-i13n=\"cpos:3;pos:1\"><strong> YouTube</strong></a></h2><p>Kevin O’Connor is joined by Jason Timpf to check in with unhappy fan bases across the NBA. They discuss whether the criticism of Karl Anthony-Towns is fair and offer solutions to the problems in New York. Then, they break down the root of Atlanta’s issues since the Trae Young trade. Plus, what’s going on in Los Angeles and can it even be fixed?</p><p>Next, KOC shares why Collin Murray-Boyles could be the next Draymond Green and why the Celtics-Pistons matchup is the game of the week. Who should the Pistons target before the trade deadline? KOC gives his picks! Plus, is Ja Morant’s stock rising? Do the Timberwolves need to trade Anthony Edwards?</p><p>Later, Justin Boone joins to discuss why the Buffalo Bills parted ways with Sean McDermott, recap the wild NFL divisional games and preview the upcoming championship weekend.&nbsp;</p><p>(0:15) Jason Timpf joins</p><p>(1:23) Unhappy fan bases: New York Knicks</p><p>(9:18) Unhappy fan bases: Atlanta Hawks</p><p>(15:49) Unhappy fan bases: Los Angeles Lakers</p><p>(25:16)&nbsp; Collin Murray-Boyles = Draymond Green</p><p>(29:13) Celtics vs. Pistons preview</p><p>(41:56) Is Ja Morant&#39;s stock rising back up?</p><p>(49:19) Do Timberwolves need to make a trade?</p><p>(1:06:23) All-Star starters announced</p><p>(1:10:26) NFL 6 Points! with Justin Boone</p><figure><img src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/KOC_Yahoo_011926.jpg\" data-crop-orig-src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/KOC_Yahoo_011926.jpg\" style=\"height:1080px;width:1920px;\" alt=\"Karl-Anthony Towns #32 of the New York Knicks reacts during the game against the Phoenix Suns at Madison Square Garden on January 17, 2026 in New York City.  (Photo by Evan Bernstein/Getty Images)\" data-uuid=\"117d5810-ccf6-45f8-8b30-37fbc696f9fe\"><figcaption>Karl-Anthony Towns #32 of the New York Knicks reacts during the game against the Phoenix Suns at Madison Square Garden on January 17, 2026 in New York City.  (Photo by Evan Bernstein/Getty Images)</figcaption><div class=\"photo-credit\">(Photo by Evan Bernstein/Getty Images)</div></figure><p><a target=\"_blank\" class=\"link\" href=\"https://youtu.be/osckLarJM9k\" data-i13n=\"cpos:4;pos:1\">🖥️ Watch this full episode</a><strong><em> on the</em></strong><a target=\"_blank\" class=\"link\" href=\"https://www.youtube.com/@YahooNBA\" data-i13n=\"cpos:5;pos:1\"><strong><em> Yahoo Sports NBA YouTube channel</em></strong></a></p><p><strong><em>Check out the rest of the Yahoo Sports podcast family at</em></strong><a target=\"_blank\" class=\"link\" href=\"https://apple.co/3zEuTQj\" data-i13n=\"cpos:6;pos:1\"><strong><em>https://apple.co/3zEuTQj</em></strong></a><strong><em> or </em></strong><a target=\"_blank\" class=\"link\" href=\"http://atyahoosports.tv\" data-i13n=\"cpos:7;pos:1\"></a><a target=\"_blank\" class=\"link\"><strong><em>atyahoosports.tv</em></strong></a></p><p></p><p><br></p><p></p>",
    "author": "Kevin O&#39;Connor",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:27:11 +0000",
    "ingested_at": "2026-01-19T22:48:25.004749Z"
  },
  {
    "guid": "f98976bd-41ce-4f9b-a288-186faa8a46db",
    "title": "LeBron James&#39; All-Star starter streak comes to an end after two-plus decades",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/lebron-james-all-star-starter-streak-comes-to-an-end-after-two-plus-decades-191757615.html",
    "description": "For the first time in 22 years, LeBron James did not receive enough votes to qualify for a starting spot on an All-Star team.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/could-the-lakers-trade-lebron-james-for-jimmy-butler-153437410.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:26dc1640-42bf-3142-b242-71f3d281a5fe}\" data-yahoo-uuid=\"26dc1640-42bf-3142-b242-71f3d281a5fe\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"0ae4b7ee156543d083964f6bc0f21fbd\"></iframe><p>LeBron James’ All-Star starter streak has ended.</p><p>For the first time in 22 years, James did not receive enough votes to <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/nba-all-star-game-starters-2026-luka-doncic-giannis-antetokounmpo-lead-vote-getters-for-new-positionless-lineups-191511323.html\">earn a starting spot on an All-Star team</a>. James finished in eighth in the voting on Monday with just more than 1.8 million votes, one spot ahead of Houston Rockets star Kevin Durant and one spot behind Minnesota Timberwolves star Anthony Edwards. <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/nba-all-star-game-starters-2026-luka-doncic-giannis-antetokounmpo-lead-vote-getters-for-new-positionless-lineups-191511323.html\">Luka Dončić led the voting in the Western Conference</a> with just more than 3.4 million votes.</p><p>As one of the most polarizing figures in sports for over two decades, James has been the most recognizable player in the NBA during that time, and his presence in a starting lineup for every All-Star team has contributed to that reputation.</p><p>Though James finished outside the top five in Western Conference All-Star voting, he could still be named as a reserve. James has long been one of the NBA’s most popular players by many measures. In his <a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/articles/ugly-loss-hornets-shows-lakers-194210972.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHq-LFZk3L4Oe8wNiYnT6rdQoLQnUexBN_ExJc32CRimsL8zyrxeIFO1-WLtFJfPH5FufkiDzk35DtF9tKNodWiSK1GzvZCTKEW0onq3i72CFnhm5iZ83xPHZOcIn06cv5IO5ssFH_zBIxvS8BlXdIKd7i5Nzuj5zoqUbNd1qIRX\">record 23rd season as a pro, James remains a difference-maker for the Lakers</a>, although not quite in the way many remember from his prime years.&nbsp;</p><p>He has averaged 22.6 points, 5.9 rebounds and 6.9 assists per game so far in the 2025-26 NBA season after <a data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-to-reportedly-make-his-2025-26-season-debut-vs-jazz-after-missing-14-games-with-sciatica-014344407.html\">missing the first 14 games of the year</a><a data-i13n=\"cpos:5;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-to-reportedly-make-his-2025-26-season-debut-vs-jazz-after-missing-14-games-with-sciatica-014344407.html\"> managing sciatica</a>.&nbsp;</p><p id=\"95871438eae641b4978e2930784a3620\"><sports-player-card position=\"SF\" player-id=\"nba.p.3704\" stat-type=\"core\" stat-time-range=\"2025-2026\" stat-time-range-type=\"season\" meta-data=\"fantasyCTA:true\"/></p><p>James held a historic streak of double-digit scoring games entering the season, which dated back to 2007 — his age-22 season. That <a data-i13n=\"cpos:6;pos:1\" href=\"https://sports.yahoo.com/article/lebron-james-incredible-10-point-031155818.html\">came to an end in early December after 1,297 consecutive games</a> with 10 or more points.</p><p>In his prime, James carried teams to the NBA Finals through sheer will and overall skill. Although those days are behind him, LeBron could always count on his popularity during All-Star voting. No matter how much criticism James received on social media, All-Star voting consistently showed that, despite the chatter and hate, fans still loved King James.</p><p id=\"863b197140a243e3a370155354f8f667\"><core-module id=\"863b197140a243e3a370155354f8f667\" type=\"curatedLinks\" title=\"More NBA News\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>That long-standing trend, which lasted over two decades, has come to an end. Once regarded as one of the most durable players in league history, injuries have started to take a toll on James, causing him to miss more games. This season, James has appeared in 24 of the Lakers’ 41 games so far. At 41 years old, it seems that Father Time may have finally caught up to James and is pulling ahead in this race.</p><p>The Lakers are currently sitting in sixth place in the Western Conference (25-16) with a slim half-game lead over seventh-place Phoenix.</p>",
    "author": "Criss Partee",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 19:17:57 +0000",
    "ingested_at": "2026-01-19T22:48:25.004764Z"
  },
  {
    "guid": "f857d0fb-a839-416b-b231-a96e44591282",
    "title": "Thunder&#39;s Jalen Williams out a &#39;couple weeks&#39; with right hamstring strain",
    "link": "https://sports.yahoo.com/nba/article/thunders-jalen-williams-out-a-couple-weeks-with-right-hamstring-strain-211608580.html",
    "description": "Jalen Williams missed the first month of the season recovering from a wrist injury, too.",
    "content_html": "<iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://sports.yahoo.com/videos/williams-return-timeline-impact-okc-190831697.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports\" width=\"640\" height=\"360\" sandbox=\"allow-same-origin allow-scripts\" data-yom-embed-source=\"{media_id_1:809d23e1-e036-3f58-a343-e6309110c453}\" data-yahoo-uuid=\"809d23e1-e036-3f58-a343-e6309110c453\"></iframe><p>Oklahoma City Thunder forward Jalen Williams is sidelined yet again.</p><p>Williams will miss at least “a couple of weeks” due to a right hamstring strain, the franchise announced on Monday. He first went down in the second quarter of their loss to the Miami Heat on Saturday, and was spotted grabbing his right hamstring as he limped off the court.&nbsp;</p><p>The team initially said he had right thigh soreness, but confirmed Monday that it was his hamstring.&nbsp;</p><div><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Jalen Williams is headed to the locker room after grabbing at his hamstring 😬 <a href=\"https://t.co/OdBJL04iPT\">pic.twitter.com/OdBJL04iPT</a></p>— Heat Central (@HeatCulture13) <a href=\"https://twitter.com/HeatCulture13/status/2012706433234522546?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p>If Williams is just out for two weeks, he could return in early February and miss only seven games — including Monday’s matchup with the Cleveland Cavaliers.</p><blockquote><p>&quot;I always feel bad for guys,” Thunder coach Mark Diagneault said on Monday, <a target=\"_blank\" class=\"link\" href=\"https://x.com/Justintohoops/status/2013318796337881446?s=20\" data-i13n=\"cpos:1;pos:1\">via The Oklahoman’s Justin Martinez</a>. “This is their life, and they put so much work into it. In his case, he put so much work into getting back to the court. ... It sucks, but you&#39;ve got to play the ball where it is. That&#39;s what he&#39;s going to do. He&#39;s going to put one foot in front of the other and attack the return to play, as he&#39;s always done.&quot;</p></blockquote><p><core-module type=\"curatedLinks\" title=\"More NBA news\" headerlink=\"\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"></core-module></p><p></p><p>Williams, who earned All-Star honors last season while helping the Thunder to their NBA Finals win, has averaged 16.8 points, 5.6 assists and 4.8 rebounds per game this season. He missed the first month of the season while recovering from wrist surgery he underwent during the offseason.&nbsp;</p><p>The Thunder entered Monday’s contest at Rocket Arena with a 35-8 record, which is the best in the league. Their loss to the Heat snapped a five-game win streak, too.</p>",
    "author": "Ryan Young",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:16:08 +0000",
    "ingested_at": "2026-01-19T22:13:32.247742Z"
  },
  {
    "guid": "9b03d2c1-7246-41d9-95a6-e5cdfddcf5a1",
    "title": "Kevin Durant passes Dirk Nowitzki for 6th place on NBA&#39;s all-time scoring list",
    "link": "https://sports.yahoo.com/nba/article/kevin-durant-passes-dirk-nowitzki-for-6th-place-on-nbas-all-time-scoring-list-033851678.html",
    "description": "If Durant stays healthy and plays the last two years of his contract with the Rockets, he should move into fourth place and could challenge for third.",
    "content_html": "<figure><img src=\"https://s.yimg.com/os/creatr-uploaded-images/2026-01/1d5c30e0-f4e3-11f0-b5ed-8bfd13da7b20\" data-crop-orig-src=\"https://s.yimg.com/os/creatr-uploaded-images/2026-01/1d5c30e0-f4e3-11f0-b5ed-8bfd13da7b20\" style=\"height:3497px;width:5246px;\" alt=\"Houston Rockets forward Kevin Durant (7) presses a launch button after surpassing Dirk Nowitzki to become the NBA&#39;s sixth all-time leading scorer in an NBA basketball game against the New Orleans Pelicans in Houston, Sunday, Jan. 18, 2026. (AP Photo/Ashley Landis)\" data-uuid=\"a66a9866-e4b9-3ea3-8700-8d99210694d7\"/><figcaption>Houston Rockets forward Kevin Durant participates in on-court festivities after passing Dirk Nowitzki to move into sixth place on the NBA&#39;s all-time scoring list on Jan. 18, 2026. (AP Photo/Ashley Landis)</figcaption><div class=\"photo-credit\">ASSOCIATED PRESS</div></figure><p>Only five players are now ahead of Kevin Durant on <a data-i13n=\"cpos:1;pos:1\" href=\"https://www.nba.com/stats/alltime-leaders\">the NBA&#39;s all-time scoring list</a>.&nbsp;</p><p>The 18-year veteran scorer passed Dirk Nowitzki for the sixth-highest total in NBA history in the Houston Rockets&#39; <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/nba/new-orleans-pelicans-houston-rockets-2026011810/\">119-110 win</a> over the New Orleans Pelicans on Sunday night. Durant moved ahead of Nowitzki when he hit a free throw with 15.2 seconds remaining in the game.&nbsp;</p><p>A free throw may not be too exciting, but Durant tied Nowitzki with a typically smooth fadeaway from the foul line with 1:05 left to boost the Rockets&#39; lead to 116-102. He finished with 18 points, 6 rebounds and 8 assists in Houston&#39;s win.</p><div id=\"6016f559052b4196bdda23187f4ff6bd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The moment Kevin Durant passed Dirk Nowitzki for 6th all-time in scoring 🙌 <br><br>The Easy Money Sniper has his eyes set on Michael Jordan at 5th 👀 <a href=\"https://t.co/Fm9qp1PV6u\">pic.twitter.com/Fm9qp1PV6u</a></p>— NBA on ESPN (@ESPNNBA) <a href=\"https://twitter.com/ESPNNBA/status/2013074558480269415?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>Durant now has 31,562 career points in 1,161 games. He reached that total in 362 fewer games than Nowitzki.&nbsp;</p><p>The Hall of Famer (Class of 2023) congratulated Durant for passing him with a recorded message.</p><div id=\"f86b73655a6e4089a15f2968e2f2bb6c\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">From one legend to another 🤝<br><br>Dirk Nowitzki congratulates Kevin Durant on becoming 𝟔𝐭𝐡 𝐚𝐥𝐥-𝐭𝐢𝐦𝐞 in <a href=\"https://twitter.com/NBA?ref_src=twsrc%5Etfw\">@NBA</a> scoring.<a href=\"https://twitter.com/KDTrey5?ref_src=twsrc%5Etfw\">@KDTrey5</a> | <a href=\"https://twitter.com/hashtag/AllFire?src=hash&amp;ref_src=twsrc%5Etfw\">#AllFire</a><a href=\"https://t.co/NPzptdzDRG\">pic.twitter.com/NPzptdzDRG</a></p>— Houston Rockets (@HoustonRockets) <a href=\"https://twitter.com/HoustonRockets/status/2013074915830718975?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>&quot;Not super-happy about him passing me,&quot; Nowitzki joked. &quot;No, seriously, to me, he is one of the purest, smoothest scorers the game has ever seen. A seven-footer, basically, which he says he&#39;s not. I think he&#39;s a seven-footer with really a two-guard&#39;s game. The shot-making, the off-the-dribble stuff, the off-balance stuff.&quot;</p><p>&quot;It&#39;s been incredible to watch his career,&quot; he added. &quot;Congrats, KD! Keep it going. Move up a couple more spots and keep it up. Good luck.&quot;</p><p id=\"9a76ad1f999a4170a9e2bac645409a02\"><core-module id=\"9a76ad1f999a4170a9e2bac645409a02\" type=\"curatedLinks\" title=\"More NBA news\" headerLink=\"\" subheadline=\"From the experts at Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>Up next on the NBA&#39;s all-time scoring list is Michael Jordan with 32,292 points. If Durant plays to his career averages and plays 65 or more games this season, he should get the 730 points he needs to reach fifth place on that list.&nbsp;</p><p>From there, going from fourth to first, are Kobe Bryant, Karl Malone, Kareem Abdul-Jabbar and LeBron James.&nbsp;</p><p>Durant is under contract for two more seasons, including a player option for 2027-28, <a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/kevin-durant-agrees-to-2-year-90-million-extension-with-houston-rockets-130635907.html\">after signing an extension</a> before this season. Presuming he stays healthy and plays out his contract, he should pass Bryant and could challenge Malone among the NBA&#39;s all-time leading scorers.</p>",
    "author": "Ian Casselberry",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 03:38:51 +0000",
    "ingested_at": "2026-01-19T03:56:41.621775Z"
  },
  {
    "guid": "b6decc55-8f43-4cbd-8029-0fd9c7fe4ef9",
    "title": "Lakers star LeBron James has played against more than 33% of all NBA players in history after loss to Trail Blazers",
    "link": "https://sports.yahoo.com/nba/article/lakers-star-lebron-james-has-played-against-more-than-33-of-all-nba-players-in-history-after-loss-to-trail-blazers-011351311.html",
    "description": "LeBron James has now played against his 1,822nd player in his career.",
    "content_html": "<iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://sports.yahoo.com/videos/portland-trail-blazers-vs-los-054616959.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports\" width=\"640\" height=\"360\" sandbox=\"allow-same-origin allow-scripts\" data-yom-embed-source=\"{media_id_1:e8f0aa42-584d-3098-a066-2b114a131f9a}\" data-yahoo-uuid=\"e8f0aa42-584d-3098-a066-2b114a131f9a\"></iframe><p>LeBron James has gone up against more than a third of all players who have ever played in the NBA.</p><p>The Los Angeles Lakers star competed against his 1,822nd player — Portland Trail Blazers center Yang Hansen — on Saturday night at the Moda Center, which is a remarkable figure on its own in his 23 seasons in the NBA. According to Stathead, James has now played against 33.8% of all players who have ever competed in an NBA game.&nbsp;</p><div><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">pulled that from <a href=\"https://twitter.com/Stathead?ref_src=twsrc%5Etfw\">@Stathead</a></p>— Tom Haberstroh (@tomhaberstroh) <a href=\"https://twitter.com/tomhaberstroh/status/2012761730187685902?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p>While that feels like a lot, and it is, the roughly one-third benchmark is actually down from a couple of years ago.&nbsp;</p><p>After a game against the Dallas Mavericks during the 2023-24 season, the Lakers revealed that James had actually played against 35% of all players in NBA history. James called that “insane” on social media at the time.</p><div><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">INSANE. <br><br>LeBron has played against 35% of all players in NBA history 🤯 <a href=\"https://t.co/Xr6Qz7IExz\">pic.twitter.com/Xr6Qz7IExz</a></p>— Los Angeles Lakers (@Lakers) <a href=\"https://twitter.com/Lakers/status/1747815528000000102?ref_src=twsrc%5Etfw\">January 18, 2024</a></blockquote></div><p>James broke the record during that season, too, when he played against his 1,669th opponent. So while the figure from Saturday night is cool to see, it’s nothing new for the man many consider to be one of, if not the best, player in NBA history.</p><p>James finished just shy of a triple-double in Sunday night’s 132-116 loss to the Trail Blazers, which dropped the Lakers to 24-16 on the season. He had 20 points, 9 rebounds and 8 assists in that contest, which marked his 23rd game of the season. The 41-year-old has averaged 22.6 points, 6.9 assists and six rebounds per game this season.&nbsp;</p><p><core-module type=\"curatedLinks\" title=\"More NBA news\" headerlink=\"http://sports.yahoo.com/nba\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"></core-module></p><p></p><p>James, who was the No. 1 overall pick in the 2003 NBA Draft, can only miss one more game this season to remain eligible for All-NBA honors and postseason awards. He has been battling several injuries this season, including <a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-to-reportedly-make-his-2025-26-season-debut-vs-jazz-after-missing-14-games-with-sciatica-014344407.html\" data-i13n=\"cpos:1;pos:1\">the first 14 of the season due to sciatica</a>.</p><p>While there are other accolades that James likely cares about more in his career — like the four MVP awards, his all-time scoring title or his four championships, among others — Saturday night’s stat is just the latest wild figure showing how long James has dominated professional basketball.&nbsp;</p>",
    "author": "Ryan Young",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 01:13:51 +0000",
    "ingested_at": "2026-01-19T03:56:41.621826Z"
  },
  {
    "guid": "752a7d90-534f-482a-a078-a22634d72406",
    "title": "Clippers F Kawhi Leonard reportedly sent home from road trip with knee irritation",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/clippers-f-kawhi-leonard-reportedly-sent-home-from-road-trip-with-knee-irritation-183135199.html",
    "description": "Los Angeles Clippers forward Kawhi Leonard has been sent home from the team’s road trip due to left knee irritation.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/clippers-turning-around-150255033.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:8e1d491b-1f68-3178-8307-37036331e84c}\" data-yahoo-uuid=\"8e1d491b-1f68-3178-8307-37036331e84c\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"2ff09e4996eb481d9bf906dac2f50897\"></iframe><p>Los Angeles Clippers forward Kawhi Leonard has been sent home from the team’s road trip due to left knee irritation.&nbsp;</p><p>Leonard is being taken off the road for treatment on his knee and will be evaluated on Wednesday when the Clippers return to LA. Leonard is having a great year despite the team’s struggles, currently sitting in 10th place in the Western Conference with an 18-23 record. In 30 games this season, Leonard is averaging a career high 28.2 points per game while leading the league in steals (2.2 per game) and free throw percentage (94.1).</p><div id=\"5212ea0d8dd54f4fb3e56295ae6b9e83\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Los Angeles Clippers star Kawhi Leonard — who’s having a career year — is dealing with left knee irritation and is being sent home from the road trip for treatment, league sources tell <a href=\"https://twitter.com/NBAonPrime?ref_src=twsrc%5Etfw\">@NBAonPrime</a>, <a href=\"https://twitter.com/NBATV?ref_src=twsrc%5Etfw\">@NBATV</a>. He’ll be evaluated once the team returns Wednesday.</p>— Chris Haynes (@ChrisBHaynes) <a href=\"https://twitter.com/ChrisBHaynes/status/2012923976440279137?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p>Although it’s been a rough start to the season, since Dec. 20 the Clippers are 12-2 and appear to be turning the ship around. During the last 14 games, the Clippers have beaten the Lakers, Rockets, Pistons twice, Warriors and Raptors. Leonard was a huge contributor over the past 14 games, leading the team in scoring in all but three of those games, and he didn’t suit up for the win over Toronto on Friday.&nbsp;</p><p id=\"1813b1aff4c94005a955fb752f130da6\"><core-module id=\"1813b1aff4c94005a955fb752f130da6\" type=\"curatedLinks\" title=\"More NBA News\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>The Clippers have been hot lately due largely to Leonard’s play, and now he’s out again, dealing with a knee injury. LA is turning the season around at the right time, and now their star player will miss at least the last two games of this short road trip. The Clippers will conclude this three-game road trip with games against the Washington Wizards on Monday and the Chicago Bulls on Tuesday.</p><p>Knee irritation might not be a big deal for some players, but with Leonard’s history of knee and leg issues throughout his career, there is cause for concern anytime his knees are mentioned. Due to their recent hot streak, the Clippers have climbed out of the dungeon in the West, but they are still barely hanging on to a play-in spot with a half-game lead over the Memphis Grizzlies in 10th place. The longer Leonard is absent, the more it’s likely to hurt their season an undo all the improvements over the past month.&nbsp;</p>",
    "author": "Criss Partee",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Sun, 18 Jan 2026 18:31:35 +0000",
    "ingested_at": "2026-01-19T03:56:41.621859Z"
  },
  {
    "guid": "77751fad-8e87-4a56-b39a-a7f447b4600d",
    "title": "Anthony Edwards scores 55 points, Victor Wembanyama counters with 39 in Spurs&#39; 126-123 win over Timberwolves",
    "link": "https://sports.yahoo.com/nba/article/anthony-edwards-scores-55-points-victor-wembanyama-counters-with-39-in-spurs-126-123-win-over-timberwolves-035812395.html",
    "description": "Edwards made an explosive return after missing Minnesota&#39;s past two games with a right foot injury.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/videos/anthony-edwards-55-points-vs-034958480.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:a54f5aed-4b20-31eb-9774-51b1a6432d55}\" data-yahoo-uuid=\"a54f5aed-4b20-31eb-9774-51b1a6432d55\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"c05d5f6c552445cda74b0e590add3dd0\"></iframe><p>Anthony Edwards returned to the Minnesota Timberwolves&#39; lineup after missing the team&#39;s past two games with a right foot injury. He scored a career-high 55 points in a superstar showdown with Victor Wembanyama. But the San Antonio Spurs held on for <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/minnesota-timberwolves-san-antonio-spurs-2026011724/\">a 126-123 win </a>at Frost Bank Center on Saturday night.&nbsp;</p><p>Wembanyama also had a spectacular game for the home team, scoring 39 points with 9 rebounds and 2 blocks. His 20-foot jumper with 53.3 seconds remaining in the game gave San Antonio the lead for good. The 7-foot-4 sensation also hit a free throw with 1.3 seconds left for the final 3-point margin.&nbsp;</p><p>The Spurs took a 69-44 lead into halftime after outscoring the T-Wolves, 48-22, in the second quarter. That surge included 20 points from Wembanyama, who knocked down three 3-pointers in the final two minutes of the frame.&nbsp;</p><div id=\"bd30282f37554658b8391559362720ca\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">3 straight triples for Wemby 👌<br><br>He&#39;s got a game-high 23 for the <a href=\"https://twitter.com/spurs?ref_src=twsrc%5Etfw\">@spurs</a>! <a href=\"https://t.co/BH589lHS1a\">pic.twitter.com/BH589lHS1a</a></p>— NBA (@NBA) <a href=\"https://twitter.com/NBA/status/2012709592417906714?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p><strong>[</strong><a data-i13n=\"cpos:2;pos:1\" href=\"http://youtube.com/@YahooNBA\"><strong>Subscribe to Yahoo Sports NBA on YouTube</strong></a><strong>]</strong></p><p>Trailing 96-84 going into the fourth quarter. Minnesota went on a 20-9 run to take the lead at 113-110 with Edwards scoring 13 consecutive points. But Wembanyama tied the score with a 3-pointer and hit two free throws to take the lead back for San Antonio.&nbsp;</p><p>Two straight 3s from Donte DiVincenzo put the T-wolves back on top 119-118 with 1:03 left in regulation. But Wembanyama&#39;s 20-footer put the Spurs back on top for good. He followed that up by blocking Joan Beringer&#39;s reverse layup attempt to preserve the lead.&nbsp;</p><div id=\"dfd81e7b0b3e45e69d6abdf8dad8dabd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ANT BUCKET.<br>WEMBY BUCKET.<br>ANT BUCKET.<br>WEMBY BUCKET.<br><br>ANT HAS 51. WEMBY HAS 38.<br><br>2-POINT GAME WITH UNDER 2 MINS TO GO. <a href=\"https://t.co/vPk0edVXph\">pic.twitter.com/vPk0edVXph</a></p>— NBA (@NBA) <a href=\"https://twitter.com/NBA/status/2012728036622295492?ref_src=twsrc%5Etfw\">January 18, 2026</a></blockquote></div><p>Edwards hit 19 of his 33 shots from the floor, including 9-of-16 on 3-pointers. He also made 8-of-10 free throws in the game. The T-wolves star missed <a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/rockets-get-39-points-from-kevin-durant-in-110-105-win-over-timberwolves-in-1st-meeting-this-season-052823244.html\">Friday&#39;s 110-105 loss</a> to the Houston Rockets on Friday, but played the second end of back-to-back games.&nbsp;</p><p>Saturday&#39;s matchup was the third time this season that the T-wolves have played the Spurs in the second game of a back-to-back on the schedule. Minnesota won the previous two meetings with Edwards scoring a combined 55 points. He matched that total in one game this time around.&nbsp;</p><p id=\"1a2692834ccf4dc5afcda29c10824d8b\"><core-module id=\"1a2692834ccf4dc5afcda29c10824d8b\" type=\"curatedLinks\" title=\"More NBA news\" headerLink=\"\" subheadline=\"From the experts at Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>De&#39;Aaron Fox added 25 points and 12 assists for the Spurs, with Keldon Johnson contributing 20 points off the bench. With the win, the Spurs improve to 29-13, tied with the Denver Nuggets for the No. 2 seed in <a data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/nba/standings/\">the Western Conference standings</a>. Both teams are 5.5 games behind the Oklahoma City Thunder.&nbsp;</p><p>For Minnesota, Jaden McDaniels scored 23 points with 5 rebounds and 5 assists. Julius Randle added 17 points with 10 rebounds, 2 steals and 2 blocks. The T-wolves have lost two games in a row and three of their past five. Saturday&#39;s defeat drops them to 27-16, but Minnesota maintains the fourth spot in the West, one game ahead of the Rockets.</p>",
    "author": "Ian Casselberry",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Sun, 18 Jan 2026 03:58:12 +0000",
    "ingested_at": "2026-01-19T03:56:41.621886Z"
  },
  {
    "guid": "b5c042da-e7f6-45bb-99e6-c2c42ef1ee34",
    "title": "Kings&#39; Domantas Sabonis returns from injury vs. Wizards, weeks before NBA trade deadline",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/kings-domantas-sabonis-returns-from-injury-vs-wizards-weeks-before-nba-trade-deadline-190321937.html",
    "description": "Sacramento Kings forward Domantas Sabonis scored 13 points in his return from injury on Friday night against the Washington Wizards. He has been sidelined with a partial meniscus tear for the last 27 games.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/could-jonathan-kuminga-stay-in-california-after-his-trade-request-203841184.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:ee80e8b6-7edc-42cf-b401-d0ea95e3751e}\" data-yahoo-uuid=\"ee80e8b6-7edc-42cf-b401-d0ea95e3751e\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"d31dd3684f1a413c8a56df3e46a32139\"></iframe><p>Sacramento Kings forward Domantas Sabonis returned on Friday night against the Washington Wizards, scoring 13 points with 6 rebounds and 5 assists in <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/washington-wizards-sacramento-kings-2026011623/\">a 128-115 win</a>. Sabonis has been sidelined with a partial meniscus tear for the last 27 games.&nbsp;</p><p>He played 21 minutes, hitting 5 of his 6 shots from the floor.&nbsp;</p><p>Sabonis last played on Nov. 16, and in his 11 games this season, he&#39;s averaged 17.2 points, 12.3 rebounds and 3.7 assists. The three-time All-Star ultimately opted against surgery and rehabbed carefully, per Slater.&nbsp;</p><p id=\"5117977c22ad4d16964fc444ddc78b3d\"><core-module id=\"5117977c22ad4d16964fc444ddc78b3d\" type=\"curatedLinks\" title=\"More NBA news\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>Trade speculation has surrounded Sabonis and the Kings in general, and that will only ratchet up as the deadline looms less than three weeks away. Sabonis signed a four-year, $186 million contract before the 2024-25 season, and has three years and $136.3 million remaining.</p><p>The Kings are 12-30, which is the second-worst record in the Western Conference, and they went 8-19 without Sabonis in the lineup. But after seven straight losses, Sacramento is on a four-game win streak, after prevailing over the 10-30 Wizards.</p>",
    "author": "Yahoo Sports Staff",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Fri, 16 Jan 2026 19:03:21 +0000",
    "ingested_at": "2026-01-19T03:56:41.621909Z"
  },
  {
    "guid": "24206564-f4b8-4c0c-9f3c-23cf589768e1",
    "title": "Should the Pistons go all-in at the trade deadline? 8 potential targets who could turn Detroit into a title favorite",
    "link": "https://sports.yahoo.com/nba/article/should-the-pistons-go-all-in-at-the-trade-deadline-8-potential-targets-who-could-turn-detroit-into-a-title-favorite-155025537.html",
    "description": "The Pistons have their foundation in place — and the ammo to address any holes on their roster.",
    "content_html": "<p>Two years ago today, the <a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/teams/detroit/\" data-i13n=\"cpos:1;pos:1\">Detroit Pistons</a> were 4-37 and stumbling out of an NBA record 28-game losing streak. The Pistons were the league’s punchline, a team that would scrape together just 10 more wins before the nightmare finally ended. Now, they’re 30-10 and staring down at the rest of the Eastern Conference.</p><p>But the climb is only starting. The next few weeks before the Feb. 5 trade deadline will reveal what Detroit still needs to jump from a great story to an unquestionable favorite. Because when April turns into a possession-by-possession fight, everything starts with who can create offense against a set defense.</p><p>The hardest piece is already in place. The first thing a team needs to contend is a superstar, and <a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/article/nba-all-star-2026-picking-the-eastern-conference-starters-205711016.html\" data-i13n=\"cpos:2;pos:1\">Cade Cunningham has officially leveled up</a> into a genuine All-NBA engine. He’s manipulating defenses with patience, ranking near the top of the league in assists while maintaining three-level scoring and versatile defense.</p><figure><img src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/ED_011625_PistonsTradeDeadline.jpg\" data-crop-orig-src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/ED_011625_PistonsTradeDeadline.jpg\" style=\"height:846px;width:1692px;\" alt=\"(Hayden Hodge/Yahoo Sports Illustration)\" data-uuid=\"c3541701-a588-4a5b-97e6-62bfc5fa55ec\"><figcaption>(Hayden Hodge/Yahoo Sports Illustration)</figcaption><div class=\"photo-credit\"></div></figure><p>Stars aren’t enough in the modern NBA though. Recent champions and runners-up have been defined by depth. Between smart additions and developmental leaps, Detroit’s supporting cast is strong. Some of it is external. Duncan Robinson’s movement gravity has added a new wrinkle to the offense, while Caris LeVert has provided secondary creation off the bench. But like Cade’s leap, Detroit’s rise is really built on internal growth.</p><p>Jalen Duren belongs in the <a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/article/first-time-nba-all-stars-whos-a-lock-whos-on-the-bubble-here-are-10-names-to-watch-204738521.html\" data-i13n=\"cpos:3;pos:1\">East All-Star conversation</a> for his violent rim pressure, elite rebounding, and back-line defense. He used to drift in and out of games. Now he looks like the spine of an elite unit.</p><p>That shift has unlocked a second one. Last season, J.B. Bickerstaff barely played Duren next to another big. Duren and Isaiah Stewart shared the floor for only eight minutes. This season, about 25% of Duren’s minutes have come alongside Stewart. And it’s working because Stewart is also playing the best basketball of his life.</p><p><strong>[</strong><a target=\"_blank\" class=\"link\" href=\"http://youtube.com/@YahooNBA\" data-i13n=\"slk:Subscribe to Yahoo Sports NBA on YouTube;cpos:4;pos:1\"><strong>Subscribe to Yahoo Sports NBA on YouTube</strong></a><strong>]</strong></p><p>Stewart still has a reputation as the “tough guy,” and while that is true, he’s not just a classic interior bruiser. Over the last three seasons he’s a 37% 3-point shooter, which changes Detroit’s geometry when he can space to the line and punish any defender inside. But Stewart’s real gift is on defense.</p><p>Among 107 players who have defended at least 80 isolations this season, Stewart ranks best, allowing only 0.68 points per isolation. That’s one of the most dominant marks in recent years. The Pistons have comfortably let Stewart switch screens onto the likes of Donovan Mitchell and Kevin Durant, and he has the agility to stay connected without bleeding downhill drives.</p><p>If just one of Duren or Stewart is on the floor, the Pistons still have great rim protection thanks to their respective shot-blocking prowess. That lineup flexibility is a big reason the Pistons are second in NBA defensive rating, trailing only the Oklahoma City Thunder.</p><sports-player-card home-or-away=\"\" opposing-team=\"\" week=\"\" stat-list=\"\" player-id=\"nba.p.6703,nba.p.6408\" position=\"C\" stat-time-range=\"2025-2026\" stat-time-range-type=\"season\" stat-type=\"core\" season=\"2025-2026\" meta-data=\"\"/><p>Bench players like Alex Caruso and Aaron Wiggins had big scoring performances in OKC’s run last year, which serves as another example of why true contenders also need players who can light a spark.</p><p>For Detroit, you’d think it would be Jaden Ivey, Ron Holland, or Ausar Thompson, one of Detroit’s former lottery picks. And while each of them has carved out a role, the biggest jolt has often come from Daniss Jenkins, a 24-year-old guard on his second two-way contract after going undrafted in 2024. He’s already had a few “Jenkinsanity” bursts, recently erupting for a 20-point quarter and dishing out a career-high 15 assists. That fearless creation keeps Detroit’s offense from cratering when the starters catch a breather.</p><p>The Pistons certainly check a lot of boxes. And a great start makes fans happy, but it also creates a responsibility for the front office to figure out what breaks in the playoffs before the playoffs break it for you. When teams send two at Cade, is it because Thompson or Holland still can’t consistently make them pay as a spacer? If the ball is forced out of Cade’s hands, can Ivey or Tobias Harris be relied on to make a play? And does this roster have enough shooting to win playoff math? Detroit is 27th in 3-point attempts and 18th in 3-point percentage. That profile can survive in January. But maybe not in April.</p><p><strong>[</strong><a target=\"_blank\" rel=\"\" class=\"link\" href=\"http://sports.yahoo.com/nba/teams/detroit\" data-i13n=\"slk:Get more Pistons news;cpos:5;pos:1\"><strong>Get more Pistons news: Detroit team feed</strong></a><strong>]</strong></p><p>All of which brings us to the deadline. The Pistons have the ammo to address any holes. They control a full stash of future firsts, which means they can put four firsts plus three swaps on the table. They also have young players with value (Thompson, Ivey, Holland, Chaz Lanier, Marcus Sasser, and Bobi Klintman). And they have clean salary tools to make any deal work: Ivey is a $10.1 million upcoming restricted free agent, Harris is on a $26.6 million expiring contract, and LeVert will make just over $14 million for one additional season. Between them, other smaller salaries, and their assets, the Pistons can target just about any player.</p><p>Here are eight calls Detroit should make, ranked by impact and fit first, and availability second.</p><p><strong>1. Trey Murphy, Pelicans forward: </strong>Murphy is the cleanest fit for Detroit. He slides into the ecosystem without changing anyone’s shot diet, and his shooting and length raise both the floor and ceiling. At age 25, he also matches Cade’s timeline. The price would be steep (multiple firsts plus youth), but that’s what true two-way wings cost.</p><p><strong>2. Michael Porter Jr., Nets forward:</strong> MPJ is the more extreme version of the same idea. He is not the same defender as Murphy, but he is a more lethal shooter. Put a 6-foot-10 shotmaker next to Cade, Robinson, and Stewart, and defenses start running out of coverages. The Nets would expect a large return for MPJ.</p><div><div><div style=\"left:0;width:100%;height:200px;position:relative;\"><iframe src=\"https://iframely.publishing.yahoo.net/J0KhIu9Z\" style=\"top:0;left:0;width:100%;height:100%;position:absolute;border:0;\" allowfullscreen data-embed-domain=\"player.simplecast.com\" data-provider-name=\"iframe\"></iframe></div></div></div><p><strong>3. Jaren Jackson Jr., Grizzlies power forward:</strong> JJJ is the swing-for-the-fences option. He gives Detroit a third defensive superpower plus a big who can space and close playoff games. Memphis isn’t eager to move him, but given the uncertain state of the team, <a target=\"_blank\" rel=\"\" class=\"link\" href=\"https://sports.yahoo.com/nba/article/unlocking-a-contender-the-jaren-jackson-jr-trade-market-174324585.html\" data-i13n=\"cpos:6;pos:1\">Detroit should make the call</a>.</p><p><strong>4. Naz Reid, Timberwolves big: </strong>The Wolves aren’t trying to trade Reid. But in theory, he’s the salary that’d have to move if Minnesota makes a big acquisition. And the Pistons previously expressed interest in signing him during his free agency just last summer, so maybe he could find his way to Detroit in some type of three-way deal. With his shot creation, shooting, and contagious energy, he’d be a perfect third big in Detroit’s frontcourt.</p><p><strong>5. Ayo Dosunmu, Bulls guard:</strong> Dosunmu has turned into a real shooter, he can slash into space, and he competes defensively. The Bulls are going nowhere and Dosunmu can be a free agent this summer, so perhaps they’d be willing to cash in.</p><p><strong>6. Nickeil Alexander-Walker, Hawks wing: </strong>NAW is making 42.1% of his catch-and-shoot 3s this season and he can do work off the dribble while also providing versatile defense. There&#39;s no reason for the Hawks to move him, especially since he&#39;s on such a team-friendly contract of four years, $60.6 million. But the Hawks seem stuck, and maybe they’d listen if the Pistons are willing to overpay.</p><p><strong>7. Klay Thompson, Mavericks wing:</strong> Klay is quietly having a bounce-back year in less-than-ideal circumstances in Dallas. He still bends defenses with instant-trigger shooting and elite relocation. At $16.7 million this season, he is also the kind of salary you can realistically absorb without detonating the rotation.</p><p><strong>8. Jerami Grant, Blazers wing:</strong> Welcome back! Grant was traded to the Blazers in 2022 following a career year with the Pistons, and he’s still a good player today. He’s a clean fit who can guard wings, hit spot-ups, and punish closeouts as a third option without stealing too many touches from Cade.&nbsp;</p><p><core-module type=\"curatedLinks\" title=\"More NBA news\" headerlink=\"\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"></core-module></p><p></p><p>Pistons fans who were around for the 2004 championship will remember the Rasheed Wallace acquisition. The Pistons were already a Finals hopeful at 34-22 and third in the East on the morning of the deadline. Chauncey Billups and Rip Hamilton were an exciting backcourt, Tayshaun Prince was having a breakout season on the wing, and Ben Wallace was in the middle of his second consecutive Defensive Player of the Year run. The Pistons were contenders. But the front office recognized that “good enough” wasn’t going to cut it.</p><p>So Detroit targeted Wallace just 10 days after he was already traded to Atlanta, and acquired him for a rotation player and multiple firsts. Wallace came with his warts with a league record technical foul history and a fiery personality that risked disrupting chemistry. And it did, but in a great way. The Pistons finished the year 20-6, as Sheed became a perfect on-court complement and the emotional spark plug that transformed Detroit into a championship unit.</p><p>Today’s Pistons find themselves in a nearly identical headspace. They have the engine in Cade, the defensive foundation in Duren and Stewart, and a newfound culture of winning under Bickerstaff. But how hard do you push? Detroit knows how quickly windows can open and shut. Two years ago, this was the league’s worst team. Now, the Pistons get to decide whether to act like a title team.</p>",
    "author": "Kevin O&#39;Connor",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 15:50:25 +0000",
    "ingested_at": "2026-01-19T16:18:33.076856Z"
  },
  {
    "guid": "f98976bd-41ce-4f9b-a288-186faa8a46db",
    "title": "LeBron James&#39; All-Star starter streak comes to an end after two-plus decades",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/lebron-james-all-star-starter-streak-comes-to-an-end-after-two-plus-decades-191757615.html",
    "description": "For the first time in 22 years, LeBron James did not receive enough votes to qualify for a starting spot on an All-Star team.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/could-the-lakers-trade-lebron-james-for-jimmy-butler-153437410.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:26dc1640-42bf-3142-b242-71f3d281a5fe}\" data-yahoo-uuid=\"26dc1640-42bf-3142-b242-71f3d281a5fe\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"0ae4b7ee156543d083964f6bc0f21fbd\"></iframe><p>LeBron James’ All-Star starter streak has ended.</p><p>For the first time in 22 years, James did not receive enough votes to <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/nba-all-star-game-starters-2026-luka-doncic-giannis-antetokounmpo-lead-vote-getters-for-new-positionless-lineups-191511323.html\">earn a starting spot on an All-Star team</a>. James finished in eighth in the voting on Monday with just more than 1.8 million votes, one spot ahead of Houston Rockets star Kevin Durant and one spot behind Minnesota Timberwolves star Anthony Edwards. <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/nba-all-star-game-starters-2026-luka-doncic-giannis-antetokounmpo-lead-vote-getters-for-new-positionless-lineups-191511323.html\">Luka Dončić led the voting in the Western Conference</a> with just more than 3.4 million votes.</p><p>As one of the most polarizing figures in sports for over two decades, James has been the most recognizable player in the NBA during that time, and his presence in a starting lineup for every All-Star team has contributed to that reputation.</p><p>Though James finished outside the top five in Western Conference All-Star voting, he could still be named as a reserve. James has long been one of the NBA’s most popular players by many measures. In his <a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/articles/ugly-loss-hornets-shows-lakers-194210972.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHq-LFZk3L4Oe8wNiYnT6rdQoLQnUexBN_ExJc32CRimsL8zyrxeIFO1-WLtFJfPH5FufkiDzk35DtF9tKNodWiSK1GzvZCTKEW0onq3i72CFnhm5iZ83xPHZOcIn06cv5IO5ssFH_zBIxvS8BlXdIKd7i5Nzuj5zoqUbNd1qIRX\">record 23rd season as a pro, James remains a difference-maker for the Lakers</a>, although not quite in the way many remember from his prime years.&nbsp;</p><p>He has averaged 22.6 points, 5.9 rebounds and 6.9 assists per game so far in the 2025-26 NBA season after <a data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-to-reportedly-make-his-2025-26-season-debut-vs-jazz-after-missing-14-games-with-sciatica-014344407.html\">missing the first 14 games of the year</a><a data-i13n=\"cpos:5;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-to-reportedly-make-his-2025-26-season-debut-vs-jazz-after-missing-14-games-with-sciatica-014344407.html\"> managing sciatica</a>.&nbsp;</p><p id=\"95871438eae641b4978e2930784a3620\"><sports-player-card position=\"SF\" player-id=\"nba.p.3704\" stat-type=\"core\" stat-time-range=\"2025-2026\" stat-time-range-type=\"season\" meta-data=\"fantasyCTA:true\"/></p><p>James held a historic streak of double-digit scoring games entering the season, which dated back to 2007 — his age-22 season. That <a data-i13n=\"cpos:6;pos:1\" href=\"https://sports.yahoo.com/article/lebron-james-incredible-10-point-031155818.html\">came to an end in early December after 1,297 consecutive games</a> with 10 or more points.</p><p>In his prime, James carried teams to the NBA Finals through sheer will and overall skill. Although those days are behind him, LeBron could always count on his popularity during All-Star voting. No matter how much criticism James received on social media, All-Star voting consistently showed that, despite the chatter and hate, fans still loved King James.</p><p id=\"863b197140a243e3a370155354f8f667\"><core-module id=\"863b197140a243e3a370155354f8f667\" type=\"curatedLinks\" title=\"More NBA News\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"Keep up with the 2025-26 NBA season with Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>That long-standing trend, which lasted over two decades, has come to an end. Once regarded as one of the most durable players in league history, injuries have started to take a toll on James, causing him to miss more games. This season, James has appeared in 24 of the Lakers’ 41 games so far. At 41 years old, it seems that Father Time may have finally caught up to James and is pulling ahead in this race.</p><p>The Lakers are currently sitting in sixth place in the Western Conference (25-16) with a slim half-game lead over seventh-place Phoenix.</p>",
    "author": "Criss Partee",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 19:17:57 +0000",
    "ingested_at": "2026-01-19T20:15:03.034760Z"
  },
  {
    "guid": "03f3e99a-b420-4478-82c7-928690d0ca25",
    "title": "NBA All-Star Game starters 2026: Luka Dončić, Giannis Antetokounmpo lead vote-getters, LeBron James misses cut",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/nba-all-star-game-starters-2026-luka-doncic-giannis-antetokounmpo-lead-vote-getters-lebron-james-misses-cut-191511249.html",
    "description": "There are no longer positional requirements for All-Star lineups ahead of this year&#39;s USA vs. World round-robin tournament.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/shai-gilgeous-alexander-reached-whole-221306262.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:2cda8ecc-21ee-3815-a52f-375310a5279d}\" data-yahoo-uuid=\"2cda8ecc-21ee-3815-a52f-375310a5279d\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"7468bcbb63d0418393ceb3e84ddfe51d\"></iframe><p>The starting lineups for the 2026 NBA All-Star Game were announced Monday. Los Angeles Lakers guard Luka Dončić and Milwaukee Bucks forward Giannis Antetokounmpo were the top vote-getters from fans.</p><p>Dončić and Antetokounmpo also headlined the <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/luka-doncic-giannis-antetokounmpo-lead-nba-all-star-game-fan-voting-in-first-reveal-190122491.html\">first</a> and <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/nba/article/luka-doncic-giannis-antetokounmpo-still-lead-the-way-in-second-returns-of-nba-all-star-game-fan-voting-190932295.html\">second fan voting returns</a> the league released.</p><p>Fans are responsible for 50% of the vote that selects each conference&#39;s five starters. NBA players (25%) and a media panel (25%) account for the other slices of the vote.&nbsp;</p><p>This year&#39;s All-Star Game will be played in Inglewood, California, at the Los Angeles Clippers&#39; Intuit Dome on Feb. 15. For the first time in the exhibition&#39;s soon-to-be-75-year history, there are no positional requirements for lineups.</p><p><a data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/lebron-james-all-star-starter-streak-comes-to-an-end-after-two-plus-decades-191757615.html\">Notably absent from the list of NBA All-Star starters this year is LeBron James</a>, whose 22-year streak as an All-Star starter has officially come to an end.</p><p>With that in mind, here are the starting fives for the Eastern and Western Conference:</p><h2 id=\"jump-link-eastern-conference\">Eastern Conference</h2><ul><li><p>Giannis Antetokounmpo, F, Milwaukee Bucks</p></li><li><p>Jalen Brunson, G, New York Knicks</p></li><li><p>Cade Cunningham, G, Detroit Pistons</p></li><li><p>Tyrese Maxey, G, Philadelphia 76ers</p></li><li><p>Jaylen Brown, F, Boston Celtics</p></li></ul><h2 id=\"jump-link-western-conference\">Western Conference</h2><ul><li><p>Nikola Jokić, C, Denver Nuggets</p></li><li><p>Luka Dončić, F, Los Angeles Lakers</p></li><li><p>Shai Gilgeous-Alexander, G, Oklahoma City Thunder</p></li><li><p>Stephen Curry, G, Golden State Warriors</p></li><li><p>Victor Wembanyama, F, San Antonio Spurs</p></li></ul><h2 id=\"jump-link-so-whats-next\">So what&#39;s next?</h2><p>The conferences&#39; reserves will be selected by NBA head coaches on Feb. 1. Each conference will have seven reserves.</p><p>Previously, those seven reserves were made up of two backcourt players and three frontcourt players, plus two wild cards. Now they, too, will be picked without regard to position.</p><h2 id=\"jump-link-what-you-need-to-know-about-the-all-star-games-new-format\">What you need to know about the All-Star Game&#39;s new format</h2><p>This year&#39;s All-Star Game will feature three teams: <a data-i13n=\"cpos:4;pos:1\" href=\"https://sports.yahoo.com/nba/breaking-news/article/nba-switching-all-star-game-format-again-will-have-usa-vs-world-round-robin-tournament-in-2026-024710036.html\">Two will consist of players from the United States, and a third will be made up of players from the rest of the world</a>.</p><p>The process for assigning players to the two U.S. teams will be determined at a later date, <a data-i13n=\"cpos:5;pos:1\" href=\"https://www.nba.com/news/nba-all-star-faq-2026\">according to the league</a>.&nbsp;</p><p>Ideally, of the 24 total All-Star roster spots, voting will fill 16 of them with U.S. players and eight of them with international players, who, if necessary, can be American players with ties to other countries.</p><p>But if those numbers aren&#39;t reached organically, NBA commissioner Adam Silver will pick additional All-Stars so that each group hits its mark. In that scenario, at least one team would end up with more than eight players.</p><p id=\"0713322509a643658268b4173f3a850a\"><core-module id=\"0713322509a643658268b4173f3a850a\" type=\"curatedLinks\" title=\"More NBA news\" headerLink=\"https://sports.yahoo.com/nba/\" subheadline=\"From the experts at Yahoo Sports\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>For instance, if there&#39;s a 15-9 split among U.S. and international All-Stars, one extra U.S. player would get the commissioner&#39;s nod, meaning that there&#39;d be 25 total All-Stars and the international team would have nine players instead of eight.</p><p>In terms of the game itself, there will still technically be four 12-minute quarters, although each will be its own game, as each of the three teams will play twice during round-robin action. The fourth &quot;quarter&quot; will pit the two teams with the best records — point differential will be the post-round-robin tiebreaker if all three teams have 1-1 records — to decide a champion.</p>",
    "author": "Andy Backstrom",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 19:15:11 +0000",
    "ingested_at": "2026-01-19T20:15:03.034783Z"
  },
  {
    "guid": "68c14a73-067d-4082-aafd-4a7ee14c47f9",
    "title": "Hawks doomed by 0-for-21 start from 3 in loss to Bucks",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/hawks-doomed-by-0-for-21-start-from-3-in-loss-to-bucks-211010140.html",
    "description": "Atlanta caught fire from 3 in the second half after its woeful start, but lost when a late desperation heave missed the mark.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/atlanta-hawks-vs-milwaukee-bucks-204551208.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:5baaea00-1556-3bdf-be4f-bcbd0bb5aea8}\" data-yahoo-uuid=\"5baaea00-1556-3bdf-be4f-bcbd0bb5aea8\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"7acb3f42a5ee47a9b2ff798fefa138f6\"></iframe><p>The Atlanta Hawks had a chance at the end on Monday despite an atrocious shooting start from beyond the 3-point arc.&nbsp;</p><p>But a late rally against the Bucks fell short as Milwaukee held on for a 112-110 win in a Martin Luther King Jr. matinee in Atlanta.&nbsp;</p><p>It was remarkable that the Bucks were in the game at all after their cold shooting in the first half. The Hawks missed their first 21 attempts from 3 and almost went into halftime without a make from beyond the arc.&nbsp;</p><p>A 3-pointer late in the second quarter by C.J. McCollum ensured that they&#39;d enter the break shooting 1 of 22 from long distance. The Hawks managed just 38 first-half points due to the poor shooting and trailed 54-38 at the break.&nbsp;</p><h2 id=\"jump-link-hawks-catch-fire-from-3-after-halftime-but-rally-falls-short\">Hawks catch fire from 3 after halftime, but rally falls short</h2><p>Thanks largely to Nickeil Alexander-Walker, the Hawks found their stroke from 3 after halftime and finished the game shooting 12 for 42 from long distance, including an 11-of-20 clip in the second half. After missing all seven of his attempts from 3 in the first half, Alexander-Walker finished 7 of 16 for the game en route to a game-high 32 points.</p><p>The Hawks actually rallied to take a 105-104 lead on a Jalen Johnson 3 with 1:10 remaining. The Hawks then had a chance at a game-winning or game-tying shot with the ball and a 112-110 deficit in the final 12 seconds. But McCollum lost control of his dribble as the clock ticked down and forced up a contested heave from the elbow that didn&#39;t have a chance.&nbsp;</p><div id=\"8d49a0e211394880b17cee646e247f14\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CJ McCollum&#39;s potential game-tying jumper is NO GOOD. <br><br>Bucks hold off the rallying Hawks on the road! <a href=\"https://t.co/GJmE62V4Dm\">pic.twitter.com/GJmE62V4Dm</a></p>— NBA (@NBA) <a href=\"https://twitter.com/NBA/status/2013351389259333693?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>In the end, Atlanta&#39;s poor start from 3 dug too big of a hole to overcome.&nbsp;</p><p>While woeful, Atlanta&#39;s poor shooting start didn&#39;t make NBA history. The 2012-13 <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/blogs/nba-ball-dont-lie/nuggets-shoot-0-22-3-pointers-loss-blazers-164622970--nba.html\">Denver Nuggets went an entire game without making a 3 </a>in an 0-for-22 effort.&nbsp;</p><p>The Houston Rockets, meanwhile, <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/rockets-missed-27-consecutive-3-pointers-game-7-new-nba-record-034056767.html\">missed 27 consecutive attempts from 3</a> in a historic Game 7 loss to the Golden State Warriors in the 2018 Western Conference finals.&nbsp;</p><p>So the Hawks escaped ignominious history. But that probably doesn&#39;t make them feel much better about Monday&#39;s game.&nbsp;</p>",
    "author": "Jason Owens",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:10:10 +0000",
    "ingested_at": "2026-01-19T21:12:04.714248Z"
  },
  {
    "guid": "512fad8f-2e63-4202-a299-f56e29da360b",
    "title": "Hawks&#39; Kristaps Porzingis and Zaccharie Risacher sidelined another week recovering from injuries",
    "link": "https://sports.yahoo.com/nba/breaking-news/article/hawks-kristaps-porzingis-and-zaccharie-risacher-sidelined-another-week-recovering-from-injuries-220603467.html",
    "description": "Atlanta Hawks center Kristaps Porzingis and forward Zaccharie Risacher will both miss another week on the court while recovering from injuries.",
    "content_html": "<iframe src=\"https://sports.yahoo.com/the-spin-nba/atlanta-hawks-vs-milwaukee-bucks-204716777.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports&amp;player_autoplay=false\" sandbox=\"allow-same-origin allow-scripts\" width=\"640\" height=\"360\" data-yom-embed-source=\"{media_id_1:fb949559-91da-3a1a-8cab-9c67f492edc7}\" data-yahoo-uuid=\"fb949559-91da-3a1a-8cab-9c67f492edc7\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" id=\"129da95f2c5c4505873f830813dde125\"></iframe><p>Atlanta Hawks center Kristaps Porzingis and forward Zaccharie Risacher will both miss another week on the court while recovering from injuries.&nbsp;</p><div id=\"27143d7cb30147ae80507c3922ebe224\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">An <a href=\"https://twitter.com/emoryhealthcare?ref_src=twsrc%5Etfw\">@emoryhealthcare</a> injury update: <br><br>Center Kristaps Porzingis, who has missed the last five games due to left Achilles tendinitis, is progressing in his recovery and will be re-evaluated in approximately one week.<br><br>Forward Zaccharie Risacher, who has missed the last five games… <a href=\"https://t.co/Jdex4k3gAp\">pic.twitter.com/Jdex4k3gAp</a></p>— Atlanta Hawks (@ATLHawks) <a href=\"https://twitter.com/ATLHawks/status/2013273064448962798?ref_src=twsrc%5Etfw\">January 19, 2026</a></blockquote></div><p>Porzingis <a data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/articles/could-hawks-trade-porzingis-warriors-201322117.html\">missed his sixth consecutive game on Monday</a> when the Hawks faced the Milwaukee Bucks in Atlanta. The Bucks held on for the win down the stretch, 112-110. This <a data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/videos/atlanta-hawks-vs-milwaukee-bucks-204716777.html\">was Atlanta’s fourth loss in a row</a>. Porzingis has been sidelined with tendinitis in his left Achilles in yet another injury-riddled season.</p><p>Once referred to affectionately as “The Unicorn,” Porzingis has been plagued by injury throughout most of his NBA career. He played in 72 games during his rookie campaign of 2015-16 with the New York Knicks and was named to the NBA All-Rookie team. Since that first year, Porzingis hasn’t played in more than 66 games in a season. Porzingis did that in his second season and wouldn’t come close again until the 2022-23 season in Washington.</p><p>Second-year player Risacher missed his sixth straight game on Monday because of a bone contusion in his left knee. Risacher was the No. 1 overall pick in the 2024 NBA Draft and finished second in Rookie of the Year voting last year. This season, he’s appeared in 36 games, averaging 11.2 points and 3.3 rebounds per game.&nbsp;</p><p id=\"3b7993e8bed645339c5d9c634e138d42\"><core-module id=\"3b7993e8bed645339c5d9c634e138d42\" type=\"curatedLinks\" title=\"More NBA News\" headerlink=\"https://sports.yahoo.com/nba/\" subheadline=\"\" listid=\"eb86ae4b-e092-459b-a90f-9848764a50fb\"/></p><p>Both players will be re-evaluated sometime next week. Porzingis has suited up for just 17 games for Atlanta this season after being acquired from the Boston Celtics during the offseason. When Porzingis has been on the court, he’s been productive this year, averaging 17.1 points and 5.1 rebounds while shooting 36% from 3-point range.</p><p>The Hawks are in 10th place in the Eastern Conference with a 20-25 record, clinging to the final play-in tournament slot.</p>",
    "author": "Criss Partee",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 22:06:03 +0000",
    "ingested_at": "2026-01-19T22:13:32.247709Z"
  },
  {
    "guid": "5c17e5f2-27cd-4fa6-85ab-dda5f296a522",
    "title": "NBA trade deadline hot topics & unhappy teams with Jason Timpf + NFL Playoffs talk with Justin Boone",
    "link": "https://sports.yahoo.com/nba/article/nba-trade-deadline-hot-topics--unhappy-teams-with-jason-timpf--nfl-playoffs-talk-with-justin-boone-212711945.html?test=1",
    "description": "Kevin O&#39;Connor & Jason Timpf talk top NBA trade targets & Justin Boone recaps the NFL divisional round.",
    "content_html": "<p></p><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://sports.yahoo.com/video/whos-in-and-whos-out-as-nba-announces-all-star-game-starters-202709042.html?format=embed&amp;region=US&amp;lang=en-US&amp;site=sports\" width=\"640\" height=\"360\" sandbox=\"allow-same-origin allow-scripts\" data-yom-embed-source=\"{media_id_1:8783025c-efd9-49a8-a248-623f7d69a12b}\" data-yahoo-uuid=\"8783025c-efd9-49a8-a248-623f7d69a12b\"></iframe><div><div><div style=\"left:0;width:100%;height:200px;position:relative;\"><iframe src=\"https://iframely.publishing.yahoo.net/xXNb13vb\" style=\"top:0;left:0;width:100%;height:100%;position:absolute;border:0;\" allowfullscreen data-embed-domain=\"player.simplecast.com\" data-provider-name=\"iframe\"></iframe></div></div></div><h2 id=\"jump-link-subscribe-to-the-kevin-oconnor-show\"><strong>Subscribe to The Kevin O&#39;Connor Show</strong></h2><h2 id=\"jump-link-apple-podcasts--spotify--youtube\"><a target=\"_blank\" class=\"link\" href=\"https://podcasts.apple.com/us/podcast/the-kevin-oconnor-show/id1769225582\" data-i13n=\"cpos:1;pos:1\"><strong>Apple Podcasts</strong></a><strong> |</strong><a target=\"_blank\" class=\"link\" href=\"https://open.spotify.com/show/6Phxh0Ph8yzn7pyuspWWzq\" data-i13n=\"cpos:2;pos:1\"><strong> Spotify</strong></a><strong> |</strong><a target=\"_blank\" class=\"link\" href=\"https://www.youtube.com/playlist?list=PLMBGfmxnWp04mrpA2-K1FVktL6r3fY2Bh\" data-i13n=\"cpos:3;pos:1\"><strong> YouTube</strong></a></h2><p>Kevin O’Connor is joined by Jason Timpf to check in with unhappy fan bases across the NBA. They discuss whether the criticism of Karl Anthony-Towns is fair and offer solutions to the problems in New York. Then, they break down the root of Atlanta’s issues since the Trae Young trade. Plus, what’s going on in Los Angeles and can it even be fixed?</p><p>Next, KOC shares why Collin Murray-Boyles could be the next Draymond Green and why the Celtics-Pistons matchup is the game of the week. Who should the Pistons target before the trade deadline? KOC gives his picks! Plus, is Ja Morant’s stock rising? Do the Timberwolves need to trade Anthony Edwards?</p><p>Later, Justin Boone joins to discuss why the Buffalo Bills parted ways with Sean McDermott, recap the wild NFL divisional games and preview the upcoming championship weekend.&nbsp;</p><p>(0:15) Jason Timpf joins</p><p>(1:23) Unhappy fan bases: New York Knicks</p><p>(9:18) Unhappy fan bases: Atlanta Hawks</p><p>(15:49) Unhappy fan bases: Los Angeles Lakers</p><p>(25:16)&nbsp; Collin Murray-Boyles = Draymond Green</p><p>(29:13) Celtics vs. Pistons preview</p><p>(41:56) Is Ja Morant&#39;s stock rising back up?</p><p>(49:19) Do Timberwolves need to make a trade?</p><p>(1:06:23) All-Star starters announced</p><p>(1:10:26) NFL 6 Points! with Justin Boone</p><figure><img src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/KOC_Yahoo_011926.jpg\" data-crop-orig-src=\"https://d29szjachogqwa.cloudfront.net/images/user-uploaded/KOC_Yahoo_011926.jpg\" style=\"height:1080px;width:1920px;\" alt=\"Karl-Anthony Towns #32 of the New York Knicks reacts during the game against the Phoenix Suns at Madison Square Garden on January 17, 2026 in New York City.  (Photo by Evan Bernstein/Getty Images)\" data-uuid=\"117d5810-ccf6-45f8-8b30-37fbc696f9fe\"><figcaption>Karl-Anthony Towns #32 of the New York Knicks reacts during the game against the Phoenix Suns at Madison Square Garden on January 17, 2026 in New York City.  (Photo by Evan Bernstein/Getty Images)</figcaption><div class=\"photo-credit\">(Photo by Evan Bernstein/Getty Images)</div></figure><p><a target=\"_blank\" class=\"link\" href=\"https://youtu.be/osckLarJM9k\" data-i13n=\"cpos:4;pos:1\">🖥️ Watch this full episode</a><strong><em> on the</em></strong><a target=\"_blank\" class=\"link\" href=\"https://www.youtube.com/@YahooNBA\" data-i13n=\"cpos:5;pos:1\"><strong><em> Yahoo Sports NBA YouTube channel</em></strong></a></p><p><strong><em>Check out the rest of the Yahoo Sports podcast family at</em></strong><a target=\"_blank\" class=\"link\" href=\"https://apple.co/3zEuTQj\" data-i13n=\"cpos:6;pos:1\"><strong><em>https://apple.co/3zEuTQj</em></strong></a><strong><em> or </em></strong><a target=\"_blank\" class=\"link\" href=\"http://atyahoosports.tv\" data-i13n=\"cpos:7;pos:1\"></a><a target=\"_blank\" class=\"link\"><strong><em>atyahoosports.tv</em></strong></a></p><p></p><p><br></p><p></p>",
    "author": "Kevin O&#39;Connor",
    "publisher": "Yahoo Sports",
    "source": "Yahoo Sports",
    "pub_date": "Mon, 19 Jan 2026 21:27:11 +0000",
    "ingested_at": "2026-01-19T22:13:32.247730Z"
  }
]